{
  "numberOfDays": 3,
  "title": "The Beginning",
  "charts": [
    {
      "dayRecap": "## Day 1: Welcome to Libestal\n\nAnd so the journey begins. Summoned to the fantastical **Kingdom of Lisbestal** by its King, 19 heroes, each with their uniquie quirks, are tasked with a vital mission: to combat the looming threat known as The Stains. Yet, this new reality is not without its complications. Each of them, stripped of their memories, awoke with no recollection of their past lives, leaving them to navigate this strange world as strangers even to themselves.\n<br>\n\n\nChaos and confusion ruled the day, which was to be expected. The girls were divided into four distinct guilds, each representing a unique philosophy:\n\n- **Jade Sword**: The beacon of the righteous and loyal, where great threats are faced with even greater courage  \n- **Cerulean Cup**: The sanctum of healing, where the spirit of empathy and devotion thrives.\n- **Amber Coin**: The home for glory-seekers with ambition and vision, where closest allies become fiercest rivals.\n- **Scarlet Wand**: The haven for the curious, where knowledge and creativity are valued above all.\n<br>\n\n[The four guild masters](#image:https://cdn.holoen.fans/hefw/media/guildmasters.png)\n<br>\n\nTasked and trusted by the king, the heroes set out to acclimate to their new world. They learned about its intricate systems, including forming parties, using telepathic devices for communication, undertaking quests to earn coins, and more. Central to their roles were the unique weapons bestowed upon them. Each weapon possessed a special ability, or **Revelation** tied exclusively to its wielder—a power as mysterious as it was significant. \n<br>\n\n\nThe day's primary mission led them to the **Underworld Dungeon**, a foreboding place tied to the essence of death. Success in conquering the dungeon promised a reward of profound value: the restoration of fragments of their lost memories.\n<br>\n\n[The girls attempting the Underworld Dungeon](#image:https://cdn.holoen.fans/hefw/media/underworld-dungeon.png)\n<br>\n\nHowever, this was far from the day's only story. The heroes summoned by the king proved to be anything but ordinary. Beyond the main quest, countless shenanigans unfolded, along with budding relationships and unexpected narratives. For every grand objective, there were personal moments of humor, mischief, and discovery.",
      "title": "",
      "nodes": [
        {
          "id": "fuwawa-abyssguard",
          "type": "image",
          "position": {
            "x": 475,
            "y": 300
          },
          "data": {
            "title": "Fuwawa Abyssguard",
            "content": "A soft, timid *“Bau bau”* escaped from **Fuwawa** as she woke up in the white box. Everything was unfamiliar, and like someone who seemed oddly familiar to her—Mococo Abyssguard—Fuwawa was completely lost and confused. \n<br>\n\nAs she moved around, sniffing those around her, she couldn’t shake the feeling that Nerissa was [trouble](https://www.youtube.com/live/3s_pVYBEax0?feature=shared&t=572), much like Mococo had sensed. When talking to Raora, Fuwawa introduced herself as a [demon dog](https://www.youtube.com/live/3s_pVYBEax0?feature=shared&t=871), though her gentle demeanor and iconic “Ehehehe” giggle made it hard to imagine anything demonic about her. She radiated warmth, more fluffy than fearsome.\n<br>\n\n\nDuring the battle with the *Stain King*, Fuwawa revealed her weapon: a pair of [sharp blue claws](https://www.youtube.com/live/3s_pVYBEax0?feature=shared&t=3181). When she activated their *Revelation*, a whirlwind of slashes tore through the enemy. After the battle, she was sorted into the **Jade Sword** [guild](https://www.youtube.com/live/3s_pVYBEax0?feature=shared&t=3471), ready to begin her journey.\n<br>\n\n\nFuwawa’s adventure in the kingdom was off to a calm start. She explored the new world, took on quests, and, like always, found herself adorably [confused](https://www.youtube.com/live/3s_pVYBEax0?feature=shared&t=4981) most of the time. But that was part of her charm, and everyone around her found it endearing. Oddly, Mococo’s voice would occasionally echo around Fuwawa, even when Mococo wasn’t nearby, as if the two were in the [same room](https://www.youtube.com/live/3s_pVYBEax0?feature=shared&t=4778). \n<br>\n\nTo avoid further confusion when filling out tasks, Fuwawa tried her best to stay focus when reading the requirements. She was so focused that she completely ignored the Hot Pink One's attempt to greet her.\n<br>\n\n[Fuwawa completely ignoring the Hot Pink One](#embed:https://www.youtube.com/live/3s_pVYBEax0?t=5438)\n<br>\n\n\nLater, Fuwawa joined forces with Nerissa, Bijou, Mococo, and Raora to tackle the Underworld Dungeon. The conquest, though chaotic, ended successfully with the group recovering memories of Mori Calliope. Afterward, Fuwawa spent time with the group before calling it a day.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Fuwawa-Abyssgard_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#67b2ff"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "mococo-abyssguard",
          "type": "image",
          "position": {
            "x": 700,
            "y": 300
          },
          "data": {
            "title": "Mococo Abyssguard",
            "content": "**Mococo** woke up in a strange white room, completely confuzzled and [on edge](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=540). Everyone around her seemed suspicious, but Nerissa especially set off her alarms—something about her just felt like [bad news](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=587). \n<br>\n\nBacked into a corner and overwhelmed, she let out a series of nervous “Haeh” sounds, her usual response when she doesn’t know what’s going on. Thankfully, the tension eased as she got to know the others. They were weird but friendly. She also ocasionally let out \"Bau Bau\" as a way to express her emotions.   \n<br>\n\n\nDuring the battle with the *Stain King*, Mococo didn’t have the best start—being the [first to fall](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=3153). She didn’t stay down long, though, and that’s when her true weapon made its debut: a pair of [sharp pink claws](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=3184). When their *Revelation* activated, Mococo unleashed a wild flurry of slashes, her movements filled with raw fury. After the battle, she found herself sorted into the **Jade Sword** [guild](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=3462).\n<br>\n\n\nHer first encounter in the guild was with *Fuwawa Abyssguard*, who looked so similar it was almost [uncanny](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=3549). \n<br>\n\nJust when Mococo thought she’d gotten over her initial fear of this new world, a different fear crept in: loneliness. When checking out the Jade Sword arena, she wandered off alone and, realizing she was left behind, began to panic. Luckily, her guildmates found her in time and promised they’d always stick by her (see [Elizabeth-Mococo: By your side](#edge:mococo-abyssguard-elizabeth-rose-bloodflame-left-3-right-2)). \n<br>\n\n\nWith her fears calmed, Mococo dove into learning about this strange world. She lit up with joy when she figured out how to ride a [horse](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=4345) and couldn’t stop laughing as she repeatedly destroyed a berry bush for [fun](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=6611). Though she was often confused, it didn’t stop her from having a blast.\n\n<br>\n\n\nLater, Mococo teamed up with *Bijou, Nerissa, Fuwawa, and Raora* to tackle the **Underworld Dungeon**. Let’s just say it was chaos—filled with shrieks and yelps, mostly from [Mococo and Fuwawa](https://www.youtube.com/live/ASF0b50sKM0?feature=shared&t=2143). Despite her best efforts to be brave, she looked more like a frightened pup than a fierce guard dog.\n<br>\n\n\nThrough many screams, screeches, and the many times falling into their doom, the five of them did manage to conquer the dungeon, and recovered memories of **[Mori Calliope](https://www.youtube.com/live/ASF0b50sKM0?feature=shared&t=3463)**. She hung out with the four girls for a bit afterwards, getting very frusrated when she got [lost](https://www.youtube.com/live/ASF0b50sKM0?feature=shared&t=3688), got escorted by *Mysterious Hero I* to the [shore](https://www.youtube.com/live/ASF0b50sKM0?feature=shared&t=4152), and finally dedcided to call it a day. \n<br>\n\n\nIt was a day full of confusion and excitement for Mococo. Her pure, innocent nature made her stand out, and everyone appreciated her for it. Hopefully, she’d stay that way—untouched by greed or temptation, especially when things like, say, a lottery came into play.",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Mococo-Abyssgard_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#f7a6ca"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "elizabeth-rose-bloodflame",
          "type": "image",
          "position": {
            "x": 475,
            "y": 500
          },
          "data": {
            "title": "Elizabeth Rose Bloodflame",
            "content": "Elizabeth Rose Bloodflame, once the mighty queen of the Bloodflame Kingdom, awoke in the fantastical kingdom of Libestal with no memory of her past life. Confusion was inevitable, but within her burned an unyielding fire—a deep sense of justice and a natural instinct to protect the weak. It was no surprise, then, that she was placed in the [Jade Sword](https://www.youtube.com/live/2qiX7084obE?si=wjA60_hrPgwaKHhO&t=3519), the guild known as the beacon of righteousness and loyalty.\n<br>\n\n\nElizabeth wielded a massive claymore named Thorn, its fiery scarlet hue reflecting her unbreakable spirit. The sheer size of the blade made Shakira feel a tad self-conscious about her own [weapon](https://www.youtube.com/live/2qiX7084obE?si=C9BFKwM0cwgfjdSw&t=3987), but Elizabeth, ever the knight, reassured her that size didn’t matter—it’s how you wield it. She was, after all, a symbol of knighthood: diligent, kind, and beloved by all. Or so it should have been.   \n<br>\n\n\nReality painted a different picture. Instead of a tale of a noble knight, Elizabeth's first day became a comedy of errors. She was run over by [horses](https://www.youtube.com/live/2qiX7084obE?si=9E-oTwiGMR2lsnub&t=8617), got [lost](https://www.youtube.com/live/2qiX7084obE?si=uOp34AwQFe8CymWf&t=8087) repeatedly (even while searching for her own guild), left by her lonesome after everyone promised her a [duel](https://www.youtube.com/live/2qiX7084obE?si=7bnMESvqaIYNGCRN&t=8624), and was teased endlessly for being mistaken as a member of [Amber Coin](https://www.youtube.com/live/2qiX7084obE?si=yttis-Jdo0fiakRM&t=7205). The cherry on top? She was branded a harlot simply for hushing the gums of the Hot Pink One, albeit it was with no consent (see Elizabeth-Tam: Red and Blue). During all this, her internal [\"music\"](https://www.youtube.com/live/2qiX7084obE?si=aFtzqtqD04vkkJTW&t=8848) seemed to change with the situation, as if her life were a melodramatic play.\n<br>\n\n\nDespite the chaos, Elizabeth found solace in her guildmates, with whom she felt an undeniable connection. Perhaps her nature was to be kind, to stand for the weak, no matter the mishaps. She felt this strongly with the two doggos (see Elizabeth-Mococo: By your side). \n<br>\n\nContinuing on, by the end of the day, alongside Gonathan G and Nino Ina, two of which are of Cerulean Cup, Elizabeth conquered the **Underworld Dungeon**, reclaiming the lost memories of [Mori Calliope](https://www.youtube.com/live/2qiX7084obE?feature=shared&t=12428). It marked not just the end of her chaotic first day but the beginning of her journey in this strange new world.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Elizabeth-Rose-Bloodflame_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#d46759"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false
        },
        {
          "id": "jyan-watson",
          "type": "image",
          "position": {
            "x": 700,
            "y": 500
          },
          "data": {
            "title": "Jyan Watson",
            "content": "**The maiden in blonde** awoke in the mysterious white box, completely disoriented. [Questions](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=287) flooded her mind: \"Am I dead?\", \"Am I in limbo?\", \"Why do these people have buttons floating over their heads?\". \n<br>\n\nBut those concerns were secondary. The real issue? She had no memory of anything, not even her own name. Her first interaction was with a sharky girl, who, to her observation, had a questionable [smell](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=552). The people around her seemed equally bizarre. Confused and overwhelmed, the blonde tried to break out, but escape was impossible. \n<br>\n\n\nShe soon discovered that she had been summoned by a King to save the kingdom. Save it? Not her style. Instead, she had a different plan: take over the kingdom. Revelation? No thanks—she was more about [revolution](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=2486). Despite overhearing murmurs from others, including *Gonathan*, about her rebellious plans, the blonde was undeterred. Her determination to overthrow the King was clear, evident in how she brushed off any explanations from the guild masters and focused on her singular goal.   \n<br>\n\n[Skippa Skippa Skippa](#embed:https://www.youtube.com/live/hUCfCWOj-1w?t=2609)\n<br>\n\n\nDuring the battle with the Stain King, Ame—who introduced herself as [Jyan Watson](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=2554)—revealed her weapon: a [magnifying glass](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=3055). Its Revelation is a bonk on the enemy’s head. Cute, but not exactly earth-shattering. After the battle, she was sorted into the **Jade Sword** [guild](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=3328)—a group dedicated to protecting the King. Oh, the irony.\n<br>\n\nJyan's journey to overthrow the kingdom officially began. True to her rebellious nature, she quickly made a name for herself by riding her horse into random [bystanders](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=3966). Still, even revolutionaries need to learn the ropes. Jyan begrudgingly completed quests and figured out how the world worked, all while having chaotic run-ins with [others](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=5214). One notable incident involved Gonathan making a scene after spotting her, but thanks you her guild mates, she was able to slither out of [trouble](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=5893).\n<br>\n\n\n\nThen came the moment Jyan had been waiting for: her attempt to assassinate the King. She sneaked her way into the kingdom's castle, stealthily approached the King, carefully lining up her strike. With a dramatic flourish, she activated her Revelation, bonking the King on the head with her magnifying glass. She followed up with a flurry of attacks using her stone sword and even dug a hole beneath him with a pickaxe. The King was sure gone now... actually, none of her attacks worked. Defeated but undeterred, she vowed to return for [vengeance](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=6333).\n<br>\n\n[Jyan's attempt in assasinating the King](#embed:https://www.youtube.com/live/hUCfCWOj-1w?t=7359)\n<br>\n\nLater, Gonathan confronted her again. This time, Jyan managed to persuade him, spinning a tale that convinced him to let her go (see [Gonathan-Amelia: King Killer](#edge:gonathan-g-jyan-watson-top-2-bottom-2)). With that hurdle cleared, she capped off her day with a [prank call](https://www.youtube.com/live/hUCfCWOj-1w?feature=shared&t=7353) to Gura, claiming to represent the “Libestonian Charity.” Unsurprisingly, Gura wasn’t fooled and rejected her scam. \n<br>\n\nSatisfied with the chaos she’d caused, Jyan called it a day.",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/ame.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#f8db92"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 300
          },
          "data": {
            "title": "Tanakisha Shakaria",
            "content": "The maiden in orange awoke in a mysterious white box with no memories of her past, much like everyone else trapped there. Despite the confusion, she realized she could speak a language called German and quickly connected with Cecilia Immergreen, another German speaker, when they first crossed paths in the box, with a [conversation](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=907) only they understood. Nerissa Ravencroft also claimed she and Kiara were [married](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=2651), adding even more confusion to the perplexing situation.\n<br>\n\n\nThough Kiara was baffled, her purpose became clear when summoned by the king to fight off the Stains—she was to protect the ~~Lesbians~~ [Lebestians](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=2687). Embracing her role, she adopted the name *Tanakisha Karia*, though it proved difficult for others to pronounce, leading to the nickname [\"Shakira\"](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=2943).\n<br>\n\nHer Revelation took the form of a blazing sword, [*Burning Phoenix*](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=3181), carving a path of flames through its enemies.\n<br>\n\nShakira was sorted into the **Amber Coin** guild, a lively group that nearly gained another member, The Hot Pink One, before the Cerulean Cup  reclaimed the maiden despite Kiara's bold [attempt](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=5610) to recruit her. \n<br>\n\nDetermined to forge her own path, Kiara embarked on her first major quest with her guildmates: delving into the **Underworld dungeon**. There, they sought to recover the memories of [Mori Calliope](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=9829), someone Kiara felt an inexplicable, deep connection to. With each step of their journey, Kiara grew more resolved to uncover the truth behind their strange new world and her place within it.\n<br>\n\nOh and she also [drowned Gura.](https://www.youtube.com/live/izEX6XKyApQ?feature=shared&t=6894)\n<br>\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Takanashi-Kiara_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#ff511c"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "peasant-da-bae",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 300
          },
          "data": {
            "title": "Peasant Da Bae",
            "content": "When she suddenly found herself in a mysterious white box surrounded by strangers, her immediate reaction was to [panic](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=281). Huh, whuh, where am I? Who are all these folks? Crikey, what’s happenin’? Let me out!. That was the rat's entrance into the fantasy world, it was...understandable to say the least. \n<br>\n\nShe claimed a corner to herself, staying put like a feral animal, ranting like one crazed old man would about the end of the world. Anyone who dared approach was met with a wild-eyed glare and threatening [babbling](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=343). She was not having it. She made it clear to everyone that she was a rat—a very weak one, in fact—and had no interest in playing hero, or whatever it was that she was summoned for.\n<br>\n\n[She just wants to go home](#embed:https://www.youtube.com/live/y8bcLA6BQsw?t=466)\n<br>\n\nHer first real interaction was with **Tam Gandr**, who casually mentioned she was destined to become the next *Queen of Libestal* (or so she claimed). Bae, starstruck by the revelation, saw an opportunity. If Tam became queen, maybe she could convince the king to send Bae back to her old life. Introducing herself as **Peasant Da Bae**, she swore to protect Tam in hopes of earning that [favor](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=2919).\n<br>\n\nDuring the battle with the Stain King, Bae briefly entertained the idea that she might actually be destined for a heroic title. That hopeful thought vanished the moment a laser beam hit her square in the [face](https://www.youtube.com/watch?v=y8bcLA6BQsw&t=3059s). Her weapon of choice, a [dice](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=3171), mirrored her unpredictable nature. Its Revelation? Rolling a number between 1 and 6, with the resulting explosions matching the roll. \n<br>\n\nDespite her paranoia, she made it through the fight and was sorted into the **[Amber Coin](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=3446)** guild alongside three others.\n<br>\n\nOnce in the kingdom, Bae’s adventures continued. She immediately clashed with *Cleopatra Eisenhower Da Vinci III the Great*, known as Three, who was also part of Amber Coin. Three wasted no time calling Bae a [weirdo](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=3510). Three did make fun of Bae before when someone tried to claim her [precious corner](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=2482), but this solidified the fact that her guildmate was not someone she can get along with. The two developed a love-hate relationship that leaned heavily on the hate. (see [Bae-Three: Friends](#edge:peasant-da-bae-cleopatra-eisenhower-da-vinci-bottom-2-top-2)) \n<br>\n\nDespite her grumbling and reluctance, Bae completed her quests diligently. She hated the King for dragging her away from her comfortable life but went along with the tasks nonetheless. Toward the end of the day, she and her guildmates tackled the **Underworld Dungeon** and recovered memories of [Mori Calliope](https://www.youtube.com/live/y8bcLA6BQsw?feature=shared&t=9842). \n<br>\n\nFor a moment, Bae considered the possibility that life here might not be so bad. Maybe she could make friends, build relationships, and fulfill her role as a hero...yeah, no. One dungeon was more than enough. After that, she disappeared, retreating to what she hoped would be an eternal nap, leaving her guildmates to handle the rest of the journey without her. A true hero’s exit.\n<br>\n\n[Adios, suckers](#embed:www.youtube.com/live/y8bcLA6BQsw?t=10388)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Hakos-Baelz_list_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#ff675d"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "raora-panthera",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 500
          },
          "data": {
            "title": "Raora Panthera",
            "content": "**Raora** awoke in the white box and, true to her nature, did what any self-respecting big cat might do: she [lashed out](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=847) at a few unfortunate souls and, oddly enough, offered comfort to a [lost dog](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=934). \n<br>\n\nThe image of a fearsome panther only lasted for a moment, though, as not too long after, she was very content being doted on, purring as others [pet her](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=1645). Like everyone else summoned into this world, she had no recollection of her past. When *Bijou* introduced herself, Raora followed suit, though Bijou struggled to pronounce her name, instead calling her [Waowa](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=2777).\n<br>\n\n\nDuring the confrontation with the Stain King, Raora’s prowess came to light. Her weapon of choice was that of a pair of sleek [white claws](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=3272). Upon activating their Revelation, she moved with the swiftness and agility of a panther, teleporting around her enemy and delivering a flurry of slashes. After the battle, Raora was assigned to the **Amber Coin** [guild](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=3543).\n<br>\n\n\nWithin the guild, Raora was treated much like a cherished pet. Her guildmates found her endearing, caring for her attentively and often searching for her when she [wandered off](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=3929). *Shakira*, in particular, took it upon herself to ensure Raora’s comfort and well-being (see [Shakira-Raora: Big Pink Cat](#edge:tanakisha-shakaria-raora-panthera-bottom-2-top-2)). Raora was not one to talk, but rather, she remained quiet and [passive](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=5774) during most interactions, preferring to listen and occasionally offer a chuckle (wheeze) or a nod. \n<br>\n\n[Raora giggling to herself as chaos unfolds](#embed:https://www.youtube.com/live/8ybUOw9NhMc?t=5854)\n<br>\n\nThroughout the day, she participated in various quests, often relying on her guildmates' assistance. Together, they successfully conquered the **Underworld Dungeon** and recovered the memories of *[Mori Calliope](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=9964)*. While many would have taken a moment to rest, Raora chose to continue exploring the world.\n<br>\n\n\nHer adventures led to several memorable encounters. She met new faces, laughed at their antics, and at one point, suggested trading *Gura’s* life for her [hat](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=10513). Raora's fondness for building soon became apparent as she gathered materials and began [constructing](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=12337) a base for her guild alongside Shakira. In doing so, she was among the first heroes to focus on such tasks, finding great satisfaction in the process.\n<br>\n\n\nOne of the more entertaining moments of her adventure then involved *Tam Gandr*. Tam made repeated efforts to teach Raora the correct pronunciation of her name, but Raora consistently mispronounced it, much to Tam’s frustration. Their conversation took an interesting turn when Tam declared her destiny to become the *Queen of Libestal*. Raora, however, countered with a confident assertion that she was destined for that role (see [Raora-Tam: Say my name](#edge:raora-panthera-tam-gandr-right-2-top-1)). \n<br>\n\n\nHer interactions with others were just as unpredictable. She accidentally hurt *Nerissa’s* feelings by bluntly saying they weren’t [friends](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=13860), she also tried to charm *Gonathan* with some [suggestive gestures](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=14436), only to casually mention that she planned to [overthrow](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=14473) the king.\n<br>\n\n\nLater on, deciding that earning the trust of her “future subjects” was important, Raora volunteered to help *Nerissa, Bijou, and the dog-like twins* in the Underworld Dungeon, as she was to be the next queen after all. Although it's debatable whether her bursting into laughter when Fuwawa and Bijou fell into a pool of lava would be considered queenly behavior.\n\n<br>\n\n[The 'Queen' laughing as her future subjects fall to their doom](#embed:https://www.youtube.com/live/8ybUOw9NhMc?t=15966)\n<br>\n\nAfter helping them complete the dungeon, Raora finally called it a day. It had been a fun and eventful one, and perhaps the first steps toward her self-proclaimed destiny as the next queen of Libestal.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Raora-Panthera_list_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#f087a9"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "cleopatra-eisenhower-da-vinci",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 500
          },
          "data": {
            "title": "Cleopatra Eisenhower Da Vinci the Great the Third",
            "content": "**Mumei** woke up in the white box and just like everyone else, she... didn't lose her memories? Wait hold on that something isn't right, let's fix that real quick. ***[Bang](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=520)***. A swift head-to-table collision later. Whoa, what happened, where am I? The maiden in brown's reaction upon waking up in the white box was the same as everyone else: confused, dazed, and completely lost. \n<br>\n\nIt was very loud there, the noise from all the talking was overwhelming, but our subject, ever the quiet observer, simply wandered around, tossing out random [one-liners](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=2327) at people. For some reason, though, she saved most of her jabs for *Peasant Da Bae*. No one knew why—probably not even herself. \n<br>\n\nAnd as she wanderered around, the saw how everyone was trying to break one particular block. Wanting to be helpful, the brown maiden came over to offer a hand. And then...\n<br>\n\n[Breaking Dimensions](#embed:https://www.youtube.com/embed/vuij6YTMIzw?si=uT5gm9w8EjDPGNX0&amp;start=2426)\n<br>\n\n\n\nNext thing we know, our hero had somehow skipped ahead and was already fighting the Stain King. [Alone](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=2768). At the very least, there weren't any voices yammering around her anymore. During the battle, she revealed her weapon of choice: a [dagger](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=2940). When she activated its Revelation, it unleashed a flurry of rapid slashes towards the targeted enemy. Afterward, she had a chat with the guild masters and the King, finding herself amused by the Amber Coin guild master's [accent](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=2987). Coincidentally, she was sorted into the **Amber Coin** [guild](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=3306).  \n<br>\n\n\nWhen she first met up with her guildmates, after calling Bae a weirdo, Mumei introduced herself as ***Cleopatra Eisenhower Da Vinci The Great III***. Bae shortened it to *Three*, for obvious reasons. Later, at the quest board, Three’s eyes lit up when she saw someone riding a [horse](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=3947). From that moment on, she was all about the horses. She enjoyed herself [way](https://www.youtube.com/live/vuij6YTMIzw?t=4951s) too much, riding around like a knight from some chaotic medieval fair. Unfortunately for everyone else, her idea of fun included using her steed as a [battering ram](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=5259).\n<br>\n\n\nAlthough they started off rocky, Mumei and Bae ended up sticking together for most of the day. Sure, they bickered and called each other names, but somewhere along the way, a weird little friendship formed (see [Bae-Three: Friends](#edge:peasant-da-bae-cleopatra-eisenhower-da-vinci-bottom-2-top-2)).\n\n<br>\n\n\nBy the end of the day, Three and her guildmates conquered the **Underworld Dungeon** and recovered *[Mori Calliope’s](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=9831)* memories. Her start was odd indeed, but Three throughout the day had fun nontheless. Here’s hoping things stay fun—and that her love for trampling people with horses doesn’t get her in too much trouble.\n<br>\n\n[Three gets into trouble for trampling people with horses](#embed:https://www.youtube.com/live/vuij6YTMIzw?t=10378)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Nanashi-Mumei_list_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#dcc4b2"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "mori-calliope",
          "type": "image",
          "position": {
            "x": 250,
            "y": 400
          },
          "data": {
            "title": "Mori Calliope",
            "content": "**Calli** had been working tirelessly—deadlines, projects, you name it. She decided it was time for a well-deserved break, going for a stroll with her beloved Deadbeats. But just as she was enjoying her walk, a truck crashed into her, knocking her out and sending her to the mysterious white box. How a truck managed to take down the literal incarnation of Death? No clue, but here we are.  \n<br>\n\n[Calli getting knocked out by a truck](#embed:https://www.youtube.com/live/xE3JQ1R2DdU?t=331)\n<br>\n\n\nWhen Calli opened her eyes, confusion hit her like a second truck. She couldn't remember anything, everything looked boxy, voices were everywhere, and a chaotic red figure was [shouting](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=2575). Overwhelmed and disoriented, Calli managed to find a bit of solace after a brief, calming exchange with *Shakira*, who she quickly took a [liking to](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=893). Calli soon learned her name was *Mori Calliope*, thanks to the “floating text” above her head that everyone could [see](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=1658). \n<br>\n\n\nDuring the battle with the *Stain King*, Calli revealed her weapon: a [scythe](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=3259). Its Revelation? A deadly slash that cut through enemies with ease. After the battle, she was sorted into the **Jade Sword** [guild](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=3639), fitting her strong will and courage.\n<br>\n\n\nAs her journey began, Calli stumbled her way through learning the ropes: tackling quests, forming parties, and figuring out how to use the telekinesis device. Adapting wasn’t easy—she even struggled with entering and leaving the [kingdom](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=4875). But Calli’s resolve was unbreakable. When Frieda and some others kept riding their horses into her and Liz, Calli didn’t hesitate to declare she’d duel them if it meant setting things [right](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=5481).\n\n<br>\n\n\nCalli eventually began building her own small [home](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=7457) in the kingdom. Later, she joined the Cerulean Cup members to take on the **Underworld Dungeon**. Before that, however, there was a bit of chaos when Liz, trying to pass as an Amber Coin member, accidentally got exposed by Calli, much to Liz’s dismay. Calli, blissfully unaware of the drama, observed the scene like a lost [child](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=8558).  \n<br>\n\n\n\nOnce inside the Underworld Dungeon with Tam and “The Hot Pink One”, Calli felt something familiar. The bony, eerie atmosphere resonated deeply within her. When she saw a giant skull statue, she instinctively called it [“Father”](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=11570). It wasn’t until they conquered the dungeon that her memories returned. She was **Mori Calliope**, a Grim Reaper who had rejected the traditional role of taking lives. Instead, she sought a higher purpose—finding beauty and joy in human emotion as a replacement for souls.\n<br>\n\n[Calli recollecting her true identity](#embed:https://www.youtube.com/live/xE3JQ1R2DdU?t=12230)\n<br>\n\n\nThe return of her memories filled Calli with fear and guilt. She felt like a traitor for abandoning her duties and leaving her people behind. But Tam and her fellow adventurers reassured her, accepting her [unconditionally](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=12438). Afterward, Calli had another chat with Shakira and spent more time exploring the kingdom, preparing for the next dungeon with the Cerulean Cup members. She even got called “Dad” by Koseki Bijou, much to her [surprise](https://www.youtube.com/live/xE3JQ1R2DdU?feature=shared&t=14424).\n<br>\n\n\nAt the end of the day—a day that included being hit by a truck, losing her memories, navigating chaos, and rediscovering herself—Calli took a moment to reflect. It had been wild, but it wasn’t the end. Her enigmatic journey was only just beginning, with many more adventures yet to come.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/calli.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#c90d40"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "ceres-fauna",
          "type": "image",
          "position": {
            "x": 475,
            "y": 800
          },
          "data": {
            "title": "Ceres Fauna",
            "content": "The first thing **Fauna** noticed upon waking in the white box was how absurdly [bright](https://www.youtube.com/live/VrLNA0SjYN8?si=8uBOHktGG-Kzh9WB&t=247) it was, folllowing up with a complaint about how loud everyone’s voices were. Complaining seemed like the logical first step when you’ve lost all your memories, right? \n<br>\n\nUnlike the other heroes, though, Fauna remained calm, collected, and entirely in control. It was as if she had done this before, casually remarking that the world reminded her of [\"Minecraft\"](https://www.youtube.com/live/VrLNA0SjYN8?si=s__Wo-nNYnk4VH3F&t=1682). Which explained her immediate urge to chop down a lone tree when she spotted one, it wasn’t just nostalgia—it was fueled by her [OCD](https://www.youtube.com/live/VrLNA0SjYN8?si=4SkKMgTqMYkdVuaV&t=2875).\n<br>\n\n\nDuring the battle with the *Stain King*, Fauna’s weapon made its debut: a wand topped with a [golden apple](https://www.youtube.com/live/VrLNA0SjYN8?si=c8218mEL2pzXTcr2&t=3173). Its *Revelation*, *“Instant Tipi”* as she named it, summoned a magical tipi-like dome that trapped enemies. More importantly, the wand also functioned as a healing tool, making Fauna the only one capable of providing support. \n<br>\n\nIn a brief exchange with the guildmasters, she mimicked the *Amber Coin* guild master’s accent, calling it “British”, and, knowing how \"good\" Fauna is at her accents, the voices in her head went into an immediate state of [panic](https://www.youtube.com/live/VrLNA0SjYN8?si=0_DR3pQaTV-Eefyw&t=3234). She was eventually sorted into the **Scarlet Wand** [guild](https://www.youtube.com/live/VrLNA0SjYN8?si=-WFwPJ36yVIN8B7Z&t=3441).\n<br>\n\n\nAfter entering the new world, Fauna began familiarizing herself with her surroundings. While completing a quest to slay stains, Fauna discovered something intriguing—she earned money for each stain defeated. The realization amused her, sparking a newfound joy. The stains were no longer just enemies to vanquish for the greater good—they were a source of [income](https://www.youtube.com/live/VrLNA0SjYN8?si=Ewua3iV9CrElQap3&t=5008). With dollar signs in her eyes, Fauna’s motivation shifted ever so slightly as she continued questing with her guildmates. \n<br>\n\n\nContinuing on, in a memorable moment involving *Shakira*, the lady in orange challenged *Gura* to float on water, given that she had a shark tail. Gura gave it a go and promptly drowned. Fauna, observing the entire fiasco, didn’t lift a finger to help (she did but only after Gura'd drowned). She did feel very guilty for her guild mate, however, because right after Gura cried out, *“HEALER? WHERE’S MY HEAL?”*, holding the support title, Fauna felt it was her resposibility to provide a sincere apoplogy, and so she replied:\n\n[gg no re](#embed:https://www.youtube.com/live/VrLNA0SjYN8?t=6903)\n<br>\n\n\nLater, Fauna teamed up with her guildmates, Gura and Cecilia, to conquer the **Underworld Dungeon**, where they recovered memories of [Mori Calliope](https://www.youtube.com/live/VrLNA0SjYN8?si=-eUxCKiyxKEaV8hA&t=9484). The trio then explored the world further, buying “gacha boxes” along the way. Gura pulled a ridiculously long, pointy hat, prompting Fauna to quip that she looked like a [garden gnome](https://www.youtube.com/live/VrLNA0SjYN8?si=k2bJ5eR6M8O7z9M6&t=10304). \n<br>\n\nThe two later dueled, with Fauna emerging victorious—and promptly extorting Gura for some loot, as a good guild mate [would](https://www.youtube.com/live/VrLNA0SjYN8?si=xCvDCmma03qWhWhk&t=11073). Their next adventure led them to a casino, where Fauna’s love of money truly shone. Betting everything on the color green—the color of money—she won a few rounds but lost just as many. Still, the thrill of the gamble fueled her, and despite her questionable behavior for a hero, she couldn’t get enough.\n<br>\n\n[It has to be green this time, right?](#embed:https://www.youtube.com/live/VrLNA0SjYN8?t=11878)\n<br>\n\n\nAfter a long day of questing and gambling her life away, Fauna decided to call it a night. But something had awoken within her. It wasn’t the thrill of saving the world or helping people—it was the joy of money. Who knows where this newfound passion will lead her? Perhaps… a business empire?\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Ceres-Fauna_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 0,
            "bgCardColor": ""
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "shiori-nyavella",
          "type": "image",
          "position": {
            "x": 700,
            "y": 800
          },
          "data": {
            "title": "Shiori Nyavella",
            "content": "**Shiori** woke up in the white box with no memories, full of questions: *Who’s this? What’s that? Where’s Waldo?* As she wandered around, inspecting (and judging) the [others](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=97), she frequently conversed with the 'guardian angels' in her head, affectionately calling them *“Chat”*. \n<br>\n\nEvery time she tried something new, she’d ask, [“Chat, am I cookin’?”](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=157). She also faintly recalled an image of a truck heading toward her in a place called \"New York,\" hinting at how she might have ended up [here](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=342).\n<br>\n\n\nHer first interactions with the group were, predictably, odd. She called Bijou “rock hard” and demanded money from [Calli](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=840), just because she could. Then she met Nerissa, who claimed to be her [wife](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=2562). Shiori, unconvinced, pointed out the lack of a ring and refused a kiss, noting Nerissa seemed like she’d kiss anyone. \n<br>\n\nShiori’s unpredictability was, well, unpredictablle, she floated around to wherever she found interseting, and said the most absurd things one can [think of](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=2519).\n<br>\n\nWhen the *Stain King* was about to appear, Shiori tried to [run](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=2774) from her responsibilities but was stopped by an invisible barrier. Resigned to her fate, she fought..or not. Instead of assiting her comrades, she stood by the side, and just watched, for the entirety of the fight. \n<br>\n\n[Shiori standing by as she watches her comrades get beaten up](#embed:https://www.youtube.com/live/KSaC99K4IF8?t=2992)\n<br>\n\nIt wasn't until she was forced into a 'cutscene' did she finally start to act. Her weapon, a [feather](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=3110), revealed its *Revelation*: shooting magical beams at enemies, but she liked to refered to it as “tickling them to death.” After the battle, she was sorted into the **Scarlet Wand** [guild](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=3347).\n<br>\n\n\n\nAs her journey began, Shiori embarked on quests with her guildmates, spending much of her time with her “goth” comrade Fauna, whom she affectionately called her wonderful majestic [green lady](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=4218). In return, Fauna referred to Shiori as her wonderful majestic Oreo. Their conversations meandered through topics like dentists and places like 'hot topics', a prime example of what some might call [“yapping”](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=4528).\n<br>\n\n\nUnlike the others, Shiori didn’t tackle the **Underworld Dungeon** on the first day, as she had other matters to attend to. Left alone with her thoughts, she began to question everything. She didn’t believe the town was real, suspecting it was part of a complex scheme to keep her memoryless because she was “too dangerous.” Shiori didn’t trust the King—or, as she put it, “this suspicious place.” Her skepticism ran deep, and her unpredictable mind continued to wander as her journey unfolded.\n<br>\n\n[Shiori and her conspiracy theories](#embed:https://www.youtube.com/live/KSaC99K4IF8?t=5588)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Shiori-Novella_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#b8a0cd"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "cecilia-immergreen",
          "type": "image",
          "position": {
            "x": 475,
            "y": 1025
          },
          "data": {
            "title": "Cecilia Immergreen",
            "content": "**Cecilia**, the very durable *automaton*, was minding her own business when, out of nowhere, a grand piano fell on her, knocking her out [instantly](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=435). Don’t you just hate it when random pianos fall from the sky, indoors? \n<br>\n\nAnyway, upon waking up in the mysterious white box, Cecilia was immediately greeted by Shakira, who asked if she spoke *German*, in German: \"Ach san Sie auch Deitsch?\" To her surprise, Cecilia did, and the two struck up a hearty [conversation](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=781). It was a strange way to start, but oddly comforting amid the chaos. Like everyone else, Cecilia had no memory of her past—aside from knowing she liked [pizza](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=1090). \n<br>\n\n\nDuring the battle with the *Stain King*, Cecilia’s role was... questionable. She didn’t actually fight but justified her idleness by claiming to be “standing by as medic.” Shiori, also opted out of fighting, the difference is she didn't even have an excuse. \n<br>\n\n[The medic of the team, doing absolutely nothing](https://www.youtube.com/live/SAdndMvNK98?t=2950)\n<br>\n\nFor heroes summoned to save a kingdom, their approach was, well, unconventional. Eventually, Cecilia revealed her weapon: [a spear](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=3060). Upon activating its *Revelation*, it unleashed a flurry of rapid jabs against the enemy. She, like her 'watch mate' Shiori, was sorted into the **Scarlet Wand** [guild](https://www.youtube.com/live/KSaC99K4IF8?feature=shared&t=3347).\n<br>\n\n\nCecilia’s adventure officially began with great enthusiasm, especially after donning the [Libestal Cloak](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=3483). She started tackling quests with her guildmates, learning the basics of the world: communication devices, forming parties, and more. She quickly formed bonds, particularly with Raora, as her fondness for cats became increasingly [evident](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=6770).\n\n<br>\n\n\nLater, Cecilia teamed up with *Gura and Fauna* to take on the **Underworld Dungeon**. She had the most animated reactions during their journey, reacting dramatically to every [twist and turn](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=8277). Together, they conquered the dungeon and unlocked the memories of *[Mori Calliope](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=9328)*. Afterward, the trio decided to hang out in the kingdom, exploring buildings, dueling, and purchasing “gacha boxes.” Gura’s prize—a ridiculously long hat—left Cecilia in fits of [laughter](https://www.youtube.com/live/SAdndMvNK98?feature=shared&t=10126).\n\n<br>\n\n\nTheir day didn’t end there. They ventured into a casino to test their luck. Cecilia and Fauna both bet on green (naturally, as green ladies). Cecilia faced some losses but managed to win back her money in the end—unlike Gura, who lost everything. Despite the ups and downs, Cecilia wrapped up her day feeling fulfilled, looking forward to more adventures with her guildmates and hoping the fun would continue.\n<br>\n\n[Green women whispering into your ears](https://www.youtube.com/live/SAdndMvNK98?t=12161)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Cecilia-Immergreen_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#119a5c"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "nerissa-ravencroft",
          "type": "image",
          "position": {
            "x": 700,
            "y": 1025
          },
          "data": {
            "title": "Nerissa Ravencroft",
            "content": "**Nerissa**, like everyone else, woke up in a white box with no memories of her past. Although overwhelmed, she tried her best to start conversations with those around her, having small chats here and there. \n<br>\n\nHowever, her longest initial conversation was with a maiden in red, *Elizabeth Rose Bloodflame*. Their chat was simple introductions, but there was an undeniable sense of familiarity, like a deeper connection existed between [them](https://www.youtube.com/live/PJSd7DYlGNo?si=l3socXPAD6ViAdz6&t=1654). \n<br>\n\nThe voices in Nerissa’s head complicated things further by claiming Shiori was her [wife](https://www.youtube.com/live/PJSd7DYlGNo?si=IrdKxeAeyiGiGTRo&t=2831). Hold on a minute, as if that wasn’t confusing enough, Nerissa also believed Shakira was her [wife?](https://www.youtube.com/live/PJSd7DYlGNo?si=OQzUggvD5b5qEPR-&t=2858) She had two wives?? And that they were destined to save the [lesbians???](https://www.youtube.com/live/PJSd7DYlGNo?si=mFVLccqol1nRAhOa&t=2883) Wasn't this supposed to be a heroic tale about saving a kingdom invaded by dark forces?\n<br>\n\n\nA-anyway, during the battle with the Stain King, Nerissa’s weapon—a large [tuning fork](https://www.youtube.com/live/PJSd7DYlGNo?si=YUlEKwX4-40_5Ozy&t=3378)—was revealed. Upon activating its *Revelation*, she struck the fork against the enemy’s head, creating a shockwave dealing damage towards the enemy. After the battle, she was sorted into the **Scarlet Wand** [guild](https://www.youtube.com/live/PJSd7DYlGNo?si=bBVH8rYcn0cL0hzO&t=3533).\n<br>\n\n\nVenturing into the new kingdom with her guildmates, Nerissa began adjusting to her new life. It was anything but smooth. She was baffled by the quest system, randomly earned [100 coins](https://www.youtube.com/live/PJSd7DYlGNo?si=Y5p-IBZHw__yD9o1&t=4842) without doing anything, got ambushed by [stains](https://www.youtube.com/live/PJSd7DYlGNo?si=ee1ikNmeMoYdUCkA&t=5226) while trying to gather wood, and “soft locked” Gura in a [trade](https://www.youtube.com/live/PJSd7DYlGNo?si=cGT81Dci8yieBCmn&t=5619). She was very much confused, and the voices in her head described her as having *\"wet cat energy\"*, whatever that meant. \n<br>\n\nDespite the chaos, Nerissa persevered, accompanied by the support and adoration of her guildmates, who found her quirks endearing.\n<br>\n\n[Nerissa mimicking an Amber Coin citizen's accent](https://www.youtube.com/live/PJSd7DYlGNo?t=6344)\n<br>\n\n\nWhile exploring the kingdom, she overheard a peculiar conversation between [Tam and Raora](https://www.youtube.com/live/DDwNcYCtAXw?si=HEyqQCWXDnTaUrnB&t=474), watching in silent bewilderment as Raora laughed hysterically and Tam spiraled into frustration. “I feel like I just experienced something I wasn’t supposed to”, Nerissa muttered as she walked away. \n<br>\n\n\nLater, Nerissa teamed up with *Fuwawa, Mococo, Bijou, and Raora* to tackle the **Underworld Dungeon**. The experience was more amusing than frightening, especially when Nerissa watched her friends fall into a bottomless lava [pit](https://www.youtube.com/live/DDwNcYCtAXw?si=mGSwx70XvMtulrqg&t=3511). Despite the mishaps, they conquered the dungeon and recovered *[Mori Calliope’s](https://www.youtube.com/live/DDwNcYCtAXw?si=ceD6NIenRuYSxQYk&t=5176)* memories.\n<br>\n\n\nAfter a bit more wandering, Nerissa called it a day. It had been confusing, chaotic, and a little painful at times, but ultimately fun—and that was all that mattered.\n<br>\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Nerissa-Ravencroft_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#2233fb"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "koseki-bijou",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 800
          },
          "data": {
            "title": "Koseki Bijou",
            "content": "There are many different ways a person may gets transported to another world. They might get hit by a truck, get hit by a train, basically get hit by any moving vechile. While many heroes claimed to have arrived through these methods, **Koseki Bijou's** tale stood out. She was crushed by a giant [Moai statue](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=327), complemented with mutiple *vine boom sound effect*. \n<br>\n\nOdd as it was, Bijou managed to arrive in the same mysterious white box as the others—that was what mattered. \n<br>\n\nThanks to something many referred to as a 'stream overlay', she knew her name was [Koseki Bijou](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=381). Being the curious little gem she is, she wasted no time running around asking the important questions—like whether *Nerissa* laid eggs, if *Fauna* was her mom, or if *Shiori* was her [lover](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=972). You know, totally normal, first-day-in-another-world stuff.  She also kept asking people to comment on her [feet](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=2669). \n<br>\n\n\nDuring the fight with the Stain King, Bijou showed off her weapon of choice: [two dazzling gems](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=3377) that launched an endless array of radiant gemstones at their foes. After that, she got sorted into the **Cerulean Cup** guild, joining the ranks of other not-so-normal heroes.\n<br>\n\nHer journey officially began in classic Bijou fashion—with a mix-up. She somehow (not deliberately) joined the [wrong](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=4058) party at first, but it was quickly resolved. While working on a quest outside the kingdom, she discovered a [sheep](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=4470) she grew strangely attached to and also developed an odd fondness for the world’s [rocks](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=5204). She hesitated to mine them, even though it was part of her task, feeling an emotional connection to them. \n<br>\n\nBijou later played a key role in the *Hot Pink One* incident, being the first to find her and calling in the rest of the guild for [support](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=5851). Despite her contributions, Bijou secretly claimed to be an *undercover agent of evil*, plotting to overthrow the system someday. She even went so far as to offer her assistance to Jyan Watson in [assassinating](https://www.youtube.com/live/OTmQwttr1Aw?feature=shared&t=6329) the King, proving she’s more unpredictable than the King might have anticipated.\n<br>\n\nAs her day continued, Bijou eventually, she teamed up with Nerissa, the two doggos, and later Raora to take on the **Underworld Dungeon**. Amidst plenty of chaos and [screaming](https://www.youtube.com/live/Fr6yMByDTIs?feature=shared&t=3318v), they managed to recover [Mori Calliope’s](https://www.youtube.com/live/Fr6yMByDTIs?feature=shared&t=4986) memories. But Bijou’s day didn’t end there.\n<br>\n\nTrue to her adventurous spirit—or questionable priorities—she decided to gamble all her money. Unsurprisingly, she lost [60%](https://www.youtube.com/live/Fr6yMByDTIs?feature=shared&t=7354) of it, but in her words: “99% of gamblers quit before they lose (?)” she persevered. Eventually, her luck turned around, and she won it all [back](https://www.youtube.com/live/Fr6yMByDTIs?feature=shared&t=8864).\n<br>\n\n\nHer actions, however, may have raised some eyebrows among the voices in her head. After all, one of the supposed heroes of the realm turned out to be a gambling enthusiast who openly planned to overthrow the King that trusted them so. But despite her chaotic tendencies, Bijou’s day was eventful, and whatever lies ahead, her journey is sure to be just as unpredictable as she is. Whether her mischievous tendencies would lead to any kind of *corruption* remained to be seen.\n<br>\n\n\nOh and one more thing, wooden shovel.\n<br>\n\n[Wooden shovel](#embed:https://www.youtube.com/live/Fr6yMByDTIs?t=7886)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Koseki-Bijou_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#6e5bf4"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "gonathan-g",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 800
          },
          "data": {
            "title": "Gonathan G",
            "content": "Only minutes after waking up in the mysterious white box, the individual cladded in orange proclaimed a new identity: **Gonathan with a G**, or simply [Gonathan G](https://www.youtube.com/live/y9KKa_k2VTU?si=wZsW1DBJimIdz-06&t=607Gonathan), a knight with medieval flair, speaking in a manner that added a peculiar charm to the group's already chaotic dynamic. Like everyone else, they were completely clueless about the strange fantasy world they had been summoned to. \n<br>\n\n\nAn important detail about Gonathan: *he* (at least for the time being) identifies as a knight, and his weapon of choice, was a pair of metal fists, or [Gremlin Grenade](https://www.youtube.com/live/y9KKa_k2VTU?feature=shared&t=3085)—unleashes devastating explosions when activated.\n<br>\n\n\nGonathan was sorted into the Cerulean Cup guild, known for its spirit of empathy, along with four other members. However, the harmonious image didn’t last long. Tensions flared when their rival guild, the Amber Coin, attempted to [kidnap](https://www.youtube.com/live/y9KKa_k2VTU?si=xE2vDkSE0e1yKT_w&t=5565) one of Cerulean Cup’s own, the so-called Hot Pink One. This act of aggression led the Cerulean Cup members to unanimously declare Amber Coin their worst enemy. Fortunately, our empaths eventually managed to retrieve their guildmate back.\n<br>\n\nGonathan G, though brave, wore his heart on his sleeve. His emotions ran high, and he was easily affected by the words and actions of others. For instance, he couldn’t help but cause a [commotion](https://www.youtube.com/live/y9KKa_k2VTU?si=vc1KGcH05IKM9TgX&t=5967) every time he encountered Jyan Watson, the so accused King Killer (see [Gonathan-Jyonathan: King Killer](#edge:gonathan-g-jyan-watson-top-2-bottom-2)). \n<br>\n\n\nHe also grew visibly agitated when Elizabeth, one of Jade Sword's members, referred to him as [\"the loud one\"](https://www.youtube.com/live/y9KKa_k2VTU?si=xoXIP9Ni9qdFv1mJ&t=9070). And crying? Well, Gonathan did that often, for just about any reason. Whether it was Liz [\"hushing the gums\"](https://www.youtube.com/live/y9KKa_k2VTU?si=uOA9eA5-H_wGz8oT&t=7910) of the Hot Pink One, insulting his [long-forgotten mother](https://www.youtube.com/live/y9KKa_k2VTU?si=m_ePVuEIKMxJr459&t=6031), or even refusing to share her [melons](https://www.youtube.com/live/y9KKa_k2VTU?si=XQ3I0HtnRB2G2yhn&t=9151), Gonathan’s tears flowed freely.\n<br>\n\n\nGonathan's first day wasn’t entirely marked by screams and tears. Many of the people he encountered treated him kindly, especially his guildmates. One person, however, stood out above all the rest. She wasn’t just any ordinary individual—she was destined to become the next Queen of this new kingdom. Moved by a sense of honor and purpose, Gonathan vowed his loyalty to her (see [Gonathan-Tam: You're the Queen!](#edge:gonathan-g-tam-gandr-bottom-2-left-2)).\n<br>\n\nAnyhow, alongside Elizabeth Rose Bloodflame and Nino Ina, he ventured into the **Underworld Dungeon**. Together, they recovered memories tied to [Mori Calliope](https://www.youtube.com/live/y9KKa_k2VTU?feature=shared&t=12343), taking their first steps in unraveling the mysteries of their fragmented pasts.\n<br>\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Gigi-Murin_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#fdb440"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "hot-pink-one",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 1025
          },
          "data": {
            "title": "Hot Pink One",
            "content": "The lady in pink's introduction to the fantasy world was, well, a little different from the others. She awoke in the mysterious white box by herself, spoke with the king by herself, and even faced the Stain King...[by herself.](https://www.youtube.com/live/Rk7nZ91vme4?si=SR-vjc02WKIL4nUb&t=1084)\n<br>\n\n\nAn odd and grueling start it was, but the isolation didn’t last long. Once she entered the Kingdom of Lisbestal, her presence made an immediate impact, transforming her lonely beginning into something much more dynamic.\n<br>\n\n\n\nAfter her exhausting and painful battle with the Stain King, she was officially sorted into the Cerulean Cup. Shortly after, she had her first encounter with the lively members of Amber Coin. That’s when <em>Shakira</em>, ever the opportunist, swooped in and attempted to recruit the pink one to her own guild instead. \n<br>\n\n\nLittle did Shakira knew, the pink one was not that of a simpleton. She was of someone loyal to her friends and true to the ideals of empathy, someone who would never betray her guild no matter what, it was her destiny to be that of the Cerulean Cup, and no forces would ever change such... She accepted Shakira's invitation without a second thought.\n<br>\n[Everyone wants the pink woman](#embed:https://www.youtube.com/live/Rk7nZ91vme4?t=2087)\n<br>\n\nThis betrayal was short-lived, however. When the rest of Cerulean Cup arrived to retrieve their wayward guildmate, she eventually returned to her proper guild, albeit reluctantly. After showcasing her unique Revelation, *Light and Darkness*, which some dubbed it similar to a [fart](https://www.youtube.com/live/Rk7nZ91vme4?si=uFnTUFLfBm36VZS-&t=2668), she threw herself into the day’s activities. Completing quests, enduring [hushed gums](https://www.youtube.com/live/Rk7nZ91vme4?si=5AhwIkLOBX3MgfA2&t=4480), and earning her fair share of [eyebrow-raising](https://www.youtube.com/live/Rk7nZ91vme4?si=5jr_c9OW9ds8maMQ&t=5777) remarks.\n<br>\n\nher journey culminated in the group’s venture into the **Underworld Dungeon**, where she recovered the memories of [Mori Calliope](https://www.youtube.com/live/Rk7nZ91vme4?feature=shared&t=8690), and also where she was first nicknamed [Hot Pink One](https://www.youtube.com/live/Rk7nZ91vme4?si=PZSB2R7NaSzFRo_b&t=7601). \n<br>\n\n\nIt was a whirlwind of a day for the maiden, filled with ups, downs, and plenty of chaos. But through it all, she had fun, marking the vibrant beginning of The Hot Pink One’s journey.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/IRyS_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#e10e5b"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "nino-ina",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 1025
          },
          "data": {
            "title": "Nino Ina",
            "content": "**Ina's** introduction to the journey began much like everyone else's: waking up in the blindingly white box, disoriented and uncertain. Yet, her experience stood apart in her calmness. Unlike Peasant Da Bae's dramatic exclamations or Tam's barrage of questions, Ina approached the situation with a quiet sense of detachment, simply observing and [taking it all in](https://www.youtube.com/live/THllQCVOYzY?feature=shared&t=240s). Perhaps this was her nature—to remain composed and collected, even in the face of chaos. \n<br>\n\n\nThis trait became even more apparent during the battle with the Stain King, where she calmly wielded her Revelation—a magical book, [Violet Miasma](https://www.youtube.com/live/THllQCVOYzY?feature=shared&t=3183s)—while her companions screamed. When its ability was activated, the book unleashed radiant beams of energy that struck nearby enemies. Her serene demeanor and empathetic spirit naturally led to her being sorted into the Cerulean Cup [guild](https://www.youtube.com/watch?v=THllQCVOYzY&t=3425s). \n<br>\n\n\nAt first, Ina believed this journey might not be as daunting as she'd feared. The guild seemed filled with empathetic, heroic individuals, and the kingdom's tasks felt manageable. But her optimism soon wavered as she began to grasp the eccentricities of her guildmates. During the dispute with Amber Coin over recruiting the Hot Pink One, Ina couldn't help but notice their [unusual antics](https://www.youtube.com/live/THllQCVOYzY?feature=shared&t=5761). Her concerns further deepened during confrontations with Elizabeth and Jyan Watson, leaving Ina to wonder: \n<br>\n\n\n[“Am I right to be in Cerulean? This cast seems a little…”](#embed:https://www.youtube.com/live/THllQCVOYzY?t=6125s)\n<br>\n\n\nDespite being surrounded by chaos, Ina embraced her role as the level-headed one in the group. She diligently completed her tasks, made puns whenever [inspiration](https://www.youtube.com/live/THllQCVOYzY?feature=shared&t=7603s) struck, and had [fleeting](https://www.youtube.com/watch?v=THllQCVOYzY&t=9680s) interactions with members of other guilds. Her day culminated in the **Underworld Dungeon**, where she teamed up with Elizabeth and Gonathan. \n<br>\n\n\nAfter successfully completing the challenge, she regained memories of [Mori Calliope](https://www.youtube.com/watch?v=THllQCVOYzY&t=12389s). While most heroes chose to retire for the day afterward, Ina's adventures continued. She exchanged friendly [banter](https://www.youtube.com/watch?v=THllQCVOYzY&t=14236s) with Nerissa, tackled additional quests, and stumbled upon a peculiar \"glitch\" that allowed her to [duplicate items](https://www.youtube.com/watch?v=THllQCVOYzY&t=17960s). True to her empathetic nature, she refrained from exploiting it and dutifully reported it to the Gods of the world.\n<br>\n\n\nAs her day drew to a close, Ina took on yet another self-imposed task: escorting the two doggos and Bijou to the shores, parting ways with the title of [\"Mysterious Hero I\"](https://www.youtube.com/live/THllQCVOYzY?feature=shared&t=18239s). She then decided to unwind in her own unique way—by [solo-conquering](https://www.youtube.com/live/THllQCVOYzY?feature=shared&t=19659s) the Underworld Dungeon. A peculiar choice for relaxation, but it was undeniably Ina. \n<br>\n\n\nDespite being placed in a guild full of quirky personalities, she remained calm at the center of the storm. Her composed demeanor and quiet strength suggested that she might just be the true hero the King had hoped for, one whose traits would carry her far in this enigmatic journey.\n<br>\n\n[Ina observing her not so normal guildmates from afar](#embed:https://www.youtube.com/live/THllQCVOYzY?t=6842)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/ina.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#4c3f5a"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "king-of-libestal",
          "type": "image",
          "position": {
            "x": 850,
            "y": 75
          },
          "data": {
            "title": "King of Libestal",
            "content": "The King of Libestal was the one who had summoned all the adventurers to this kingdom. He described it as a desperate act, a final hope, for his kingdom and its people stood on the brink of ruin. A calamity known as the Stains—a corrupted force threatening to consume the world—was closing in. And so, he summoned these nineteen heroes, placing his faith in them as the kingdom’s saviors, holding great hopes that they would rise to the occasion and fend off the terrible fate looming ahead.\n<br>\n\n[The King greets his heroes](#embed:https://www.youtube.com/live/2qiX7084obE?feature=shared&t=2768)\n<br>\n\nAfter the heroes successfully defended the kingdom from the first wave of corruption, the King took notice of the strange power they possessed—Revelation. \n<br>\n\nIt was unlike anything he had seen before, and he believed it to be the key to defeating the Stains once and for all. With this newfound hope, he called upon the heroes, asking them to lend their strength, to embark on a long and arduous journey, and ultimately, to save the world. He entrusted the four guild leaders with guiding them, allowing them to explain their purpose and direction. And in doing so, he provided the heroes with a place to call home—where they would forge bonds, grow stronger, and prepare for the [enigmatic journey](https://www.youtube.com/live/PJtapc2_7ok?feature=shared&t=3169) ahead.",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/king.png",
            "teamId": "none",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#f6e7c8"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "tam-gandr",
          "type": "image",
          "position": {
            "x": 1450,
            "y": 925
          },
          "data": {
            "title": "Tam Gandr",
            "content": "**The maiden in blue** woke up in a peculiar white box, her first thought fixating on why everything—her hands, the world, even the people—appeared so square and pixelated. Ever curious, she roamed around asking anyone and everyone a barrage of questions: “Is your name Kiara? What are you doing in the corner? The server closed? What does that mean?” Her confusion was palpable, and it became evident that she couldn’t even recall her own name. \n<br>\n\n\nThis changed when she crossed paths with Gonathan G, who suggested the title *'The Azure Maiden'* because of her fondness for blue. While Kronii found it poetic, she also thought it was a bit too long. Gonathan shortened it to *'Tam'*, and Kronii, in her own flair, appended *Gandr*. Thus, her new identity was born—***Tam Gandr***\n<br>\n\n\nWhen summoned by the King alongside the other heroes, Tam felt a unique sense of destiny. Unlike the rest, she was convinced that the King’s fateful words, “Will you—” were the prelude to a royal proposal. Naturally, this meant she was destined to be his *Queen* (see Tam-King: Guess I'm Queen now). \n<br>\n\nBrimming with this belief, she shared her newfound 'truth' with *Peasant the Bae*, who became awestruck at the honor of standing in the presence of [royalty](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=1333). \n<br>\n\n\nDuring the battle with the *Stain King*, Tam unsheathed her weapons: a pair of dual-wielding blades shaped like clock hands, which upon activation, unleashed a relentless flurry of attacks. She was then sorted into the ***Cerulean Cup*** guild.\n<br>\n\n\nTam’s presence in Cerulean Cup quickly established her as a dominant figure, her charisma and aura of confidence naturally earning her respect as the guild leader. This was evident during the first major conflict in the kingdom, a heated recruitment battle between *Cerulean Cup and Amber Coin* over *the Hot Pink One*. \n<br>\n\nTam’s empathetic nature shone as she leveraged her remarkable powers of persuasion—a skill she had already demonstrated while aspiring a [Libestan child](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=5140). It was no surprise when The Hot Pink One eventually succumbed to her words, sealed with Tam’s unforgettable declaration: \n<br>\n\n[“Nobody wants you except us.”](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=6213)\n<br>\n\nAs the day progressed, Tam found herself caught in various shenanigans. Yet, she always managed to handle situations with an air of maturity. When Gonathan was interrogated by Elizabeth, Tam intervened, *calmly* defusing the tension (see [Elizabeth-Tam: Red and Blue](#edge:elizabeth-rose-bloodflame-tam-gandr-top-3-top-2)). \n<br>\n\n\nBy the day's end, Tam joined The Hot Pink One and Mori Calliope in the **Underworld Dungeon**, where they recovered fragments of their lost [memories](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=11965). It was a chaotic, exhausting day for Tam, filled with triumphs, conflicts, and laughter. She gained devoted followers who pledged their unwavering loyalty (see [Gonathan-Tam: You're the Queen!](#edge:gonathan-g-tam-gandr-bottom-2-left-2)). She stood as a beacon of righteousness, a protector and a leader. \n<br>\n\nBut above all, she found solace in the simple yet profound comfort of having a name—Tam. Though it was given impulsively by Gonathan, it resonated with her, becoming a cherished part of her identity. To Tam, that name was more than just a label; it was a symbol of her newfound self, one she would carry and treasure throughout the rest of her journey.\n<br>\n\nAs the kingdom settled into quiet, Tam yearned for a peaceful night’s sleep. Surely, nothing else would trouble her now. Surely...(see [Raora-Tam: Say my name](#edge:raora-panthera-tam-gandr-right-2-top-1)). \n\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Ouro-Kronii_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#6879c7"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "gawr-gura",
          "type": "image",
          "position": {
            "x": 250,
            "y": 925
          },
          "data": {
            "title": "Gawr Gura",
            "content": "*\"I want to punch this one. I don't know why, I just have an urge,\"* was one of the first things **Gura** said after waking up in the white room. The target? A blonde maiden named [Jyan Watson](https://www.youtube.com/live/PJtapc2_7ok?si=Y5cIDsVzAWQ_KLyt&t=535). It felt like there was unresolved tension between them—despite Gura not remembering anything about her past. Or maybe she was just feeling extra sassy, later casually calling Tam a dumbass when addressing her [name](https://www.youtube.com/live/PJtapc2_7ok?si=DZTu5_2xTqaUWn3X&t=2562). Honestly, that’s probably just her personality: a sassy child with attitude for everyone she meets.\n\n<br>\n\n\nDuring the battle with the Stain King, Gura’s weapon—a [trident](https://www.youtube.com/live/PJtapc2_7ok?si=iOr1m3bizOsFkBs6&t=3078)—was revealed. When she activated its Revelation, it summoned a wave of water that pushed back enemies. After the battle, she was sorted into the **Scarlet Wand** [guild](https://www.youtube.com/live/PJtapc2_7ok?si=0VHccAIdMWhD0QQf&t=3413).\n<br>\n\n\nAnd so, Gura’s journey began. Like everyone else, her first task was figuring out this strange new world. She started doing quests with her guildmates but was confused most of the time—thanks to her [shork brain](https://www.youtube.com/live/PJtapc2_7ok?si=6UmKNJggTOPF7KXR&t=5172). All sass, zero intelligence. Luckily, her guildmates included *Nerissa, Fauna, Shiori, and Cecilia*, who lived up to the Scarlet Wand's reputation for being smart. They carried her through most challenges. \n<br>\n\nNot everything went smoothly, though. She got involved in a [hit-and-run](https://www.youtube.com/live/PJtapc2_7ok?si=SyZDDDTLhI0pvuNb&t=5252) incident with *Cleopatra Eisenhower Da Vinci The Great III* and, in another instance, drowned after accepting Shakira’s challenge to float on water. Yes, despite her shark-like features and literal tail, she somehow managed to drown.   \n<br>\n\n[The 'shark' somehow manages to drown](#embed:https://www.youtube.com/live/PJtapc2_7ok?t=6778)\n<br>\n\nLater, Gura teamed up with Fauna and Cecilia to tackle the **Underworld Dungeon**. During their conquest, Gura got an unexpected call from [Jyan Watson](https://www.youtube.com/live/PJtapc2_7ok?si=Zjtfn-It4RAxI-V-&t=7423), claiming to represent the 'Libestonian Charity'. Predictably, Gura saw through the scam and shut it down immediately. The trio conquered the dungeon, recovering memories of [Mori Calliope](https://www.youtube.com/live/PJtapc2_7ok?si=Jtp8XzHA_FLV9Wi9&t=9383), though not without some [screaming](https://www.youtube.com/live/PJtapc2_7ok?si=Zst9EdhSWxT2Oh3-&t=7627) along the way.  \n<br>\n\n\nTheir day didn’t end there. The group continued exploring the world, with one highlight being the *gacha boxes*. Gura scored a ridiculous, long, pointy red velvet hat and proudly declared herself *The Appointed Point*. \n<br>\n\n[The Appointed Point](#embed:https://www.youtube.com/live/PJtapc2_7ok?t=10161)\n<br>\n\n\nThe almighty Appointed Point didn’t stay mighty for long, as Fauna promptly beat her up and extorted some [loot](https://www.youtube.com/live/PJtapc2_7ok?si=YkwgWZsNZ_jUp72e&t=10970). Turns out, the hat didn’t boost her strength—or intelligence. Finally, the three of them wrapped up their day at the casino. While Fauna and Cecilia made decent profits, Gura went bankrupt, she lost so much money she couldn't feel her legs anymore. Again, the hat offered no perks. Despite that, she had a blast and was excited for whatever adventures lay ahead.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Gawr-Gura_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 0,
            "bgCardColor": "#5d81c7"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        }
      ],
      "edges": [
        {
          "id": "gonathan-g-jyan-watson-top-2-bottom-2",
          "source": "gonathan-g",
          "target": "jyan-watson",
          "sourceHandle": "top-2",
          "targetHandle": "bottom-2",
          "type": "fixed",
          "style": {
            "stroke": "#ffd885"
          },
          "data": {
            "relationshipId": "alliance",
            "title": "King Killer",
            "content": "Gonathan was a thorn in Jyan Watson's side for most of the day. The orange knight had discovered Jyan's plan to assassinate the King, a plot that Gonathan couldn’t tolerate in good conscience. Every time he encountered the blonde maiden, he would shout accusations and cause a scene, determined to expose her treachery to the rest of the kingdom.\n<br>\n\n[Gonathan confronts Jyan Watson](#embed:https://www.youtube.com/live/y9KKa_k2VTU?t=5967)\n<br>\n\nThe others, however, were far less invested. Many found the interactions between the two amusing—watching Gonathan chase Jyan around like an overzealous guard dog. Most of them, save for Elizabeth, didn’t care much for the King anyway.\n<br>\n\nEventually, Jyan seemed to tire of the relentless pursuit and finally decided to confront her pursuer. She stopped and calmly explained her reasoning for wanting to take down the King.\n<br>\n\n[Jyan explains to Gonathan why she wants to slay the King](#embed:https://www.youtube.com/embed/y9KKa_k2VTU?si=3dehAp08bmCG59ye&amp;start=7108)\n<br>\n\nAccording to her, the King was corrupted and bore a \"Stain\" (on his pants, no less) and was deceiving everyone into serving him for his own nefarious purposes. However, her claims were offered without evidence, sources, or any tangible proof... so it made perfect sense for Gonathan to believe her without question. Whether it was her striking beauty or her confident delivery that swayed him, the knight cast aside all of his earlier accusations.\n<br>\n\nSwearing allegiance to her cause, Gonathan vowed to help Jyan in her endeavors to bring down the King. The transformation left the rest of the kingdom baffled, but to Gonathan, it seemed like the most natural course of action.\n\n",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "elizabeth-rose-bloodflame-tam-gandr-top-3-top-2",
          "source": "elizabeth-rose-bloodflame",
          "target": "tam-gandr",
          "sourceHandle": "top-3",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "Red and Blue",
            "content": "It wasn’t long before a conflict—if you could call it that—erupted in the Kingdom between two of Libestal's most fiery personalities: Tam Gandr, the self-proclaimed future \"Queen\" of Libestal, and Elizabeth Rose Bloodflame, a former Queen in her past life. \n<br>\n\nThe tension sparked during an interrogation of Jyan Watson, the would-be king-slayer, led by Gonathan G. Elizabeth, a member of the same guild as Jyan, wasn’t about to let her guildmate be accused without defense (even if Jyan did plot to kill the King). On the other side, Tam wasn’t about to let anyone disrespect her guildmate Gonathan, setting the stage for a dramatic clash of wills.\n<br>\n\n[Red and Blue, round one](#embed:https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=5877)\n<br>\n\n\nWhat followed was a verbal showdown—sharp words flying between them, though much of it boiled down to one repeatedly telling the other to [shut up](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=5985). Neither backed down, but the feud escalated when Elizabeth claimed to be part of Amber Coin, a guild Tam utterly [despised](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=5964) (for some odd reason). For Tam, this was confirmation: Elizabeth was her enemy. Tam wasted no time mocking Elizabeth’s supposed allegiance to Amber Coin, and every subsequent interaction between them became a battle of petty [exchanges](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=6995).  \n\n<br>\n\n\nThings reached a boiling point when Tam discovered Elizabeth was actually a member of Jade Sword. This revelation didn’t defuse the situation; instead, Tam branded Elizabeth a compulsive [liar](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=7706) and kept her guard up at all times.\n\n<br>\n\n\nIt seemed clear: these two weren’t about to reconcile anytime soon. Their rivalry had just begun, and the Kingdom of Libestal would undoubtedly bear witness to more clashes between the self-assured would-be Queen and the regal knight of fire.\n\n<br>\n\n[Red and Blue, round two](#embed:https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=8324)",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria-raora-panthera-bottom-2-top-2",
          "source": "tanakisha-shakaria",
          "target": "raora-panthera",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#c65cff"
          },
          "data": {
            "relationshipId": "big-pink-cat",
            "title": "Catlady",
            "content": "Raora, affectionately known as the “beeg cat” of the group, quickly became a favorite of Shakira, who clearly had a soft spot for cats. From the moment they met, Shakira went out of her way to ensure Raora was comfortable and cared for. \n<br>\n\nHer attentiveness was unwavering—when Raora went missing, Shakira was the first to notice. Without hesitation, she rallied everyone to search for [her](https://www.youtube.com/watch?v=izEX6XKyApQ&t=3874s). On another ocassion, when Shakira found Raora on her own after wandering around on her lonesome herself, she was [overjoyed](https://www.youtube.com/watch?v=izEX6XKyApQ&t=4707s), like an owner finding their lost pet.\n<br>\n\n[Kitty kitty, where are you?](#embed:https://www.youtube.com/live/izEX6XKyApQ?t=3874)\n<br>\n\n\nThroughout the day, the two shared countless moments together, forming a bond that felt natural and heartwarming amidst the chaos. They chatted about various topics, laughed, and worked together to build up their guild base. Shakira seemed intent on keeping Raora company at all [times](https://www.youtube.com/watch?v=izEX6XKyApQ&t=6381s), treating her with the same affection one might give to a beloved pet. \n<br>\n\nBefore the day ended, Shakira called out to Raora one last time to say [goodbye](https://www.youtube.com/watch?v=izEX6XKyApQ&t=13636s)—like a caring cat owner bidding farewell before heading off to work. It was a sweet and wholesome connection, a refreshing contrast to the madness unfolding around them.\n<br>\n\n[Orange woman and her pink cat goofing around](#embed:https://www.youtube.com/live/izEX6XKyApQ?t=12541)\n",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "tam-gandr-king-of-libestal-top-3-right-2",
          "source": "tam-gandr",
          "target": "king-of-libestal",
          "sourceHandle": "top-3",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "relationshipId": "marriage",
            "title": "Guess I'm Queen now",
            "content": "When Tam was summoned to this world, she didn’t share the confusion or fear that consumed the others. No, she felt superior, as if destiny itself had singled her out for greatness. Tam was convinced she wasn’t just any commoner but someone of immense importance—the future Queen, to be precise. After all, didn’t the King himself begin a sentence with, *“Will you-”?* Surely, the only possible continuation was *“marry,”* right? It was obvious to her.\n<br>\n\n[Tam accepting the King's proposal (?) with various demands](#embed:https://www.youtube.com/live/zgioohaY0m4?t=2555)\n<br>\n\nBrimming with confidence, Tam wasted no time sharing her “royal engagement” with everyone. She told [Peasant the Bae](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=1331), [Gura](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=2497), and essentially all her [guild mates](https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=5589). To her delight—or perhaps bewilderment—everyone believed her, or at least went along with it, not knowing any better.\n<br>\n\nBefore long, word spread throughout the entire kingdom: Tam was destined to marry the diminutive rabbit-man King, who stood at half her height. Whether or not anyone questioned the absurdity of it, one thing was certain—the kingdom would never be the same with Tam’s unique brand of shaping her path forward.  \n\n\n",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "mococo-abyssguard-elizabeth-rose-bloodflame-left-3-right-2",
          "source": "mococo-abyssguard",
          "target": "elizabeth-rose-bloodflame",
          "sourceHandle": "left-3",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#77e03e"
          },
          "data": {
            "relationshipId": "protector",
            "title": "By your side",
            "content": "The new world brought confusion and fear to everyone. Stripped of their memories and thrust into an unfamiliar place filled with strange faces, the situation was overwhelming. But even amidst the chaos, Elizabeth stood strong. It was as though she was destined to be a knight; her fiery resolve burned brightly, illuminating the path forward even in the darkest moments.\n<br>\n\nMococo, however, was her opposite. Timid and fearful, she resembled a lost pup, unsure of herself and the world around her. Whenever left alone, she would fall into [distress](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=4128), panic consuming her. It was during one of these moments that the fiery knight, Elizabeth, took notice. \n<br>\n\nSeeing the small girl in such a state, Elizabeth's sense of duty as a righteous knight compelled her to act. She approached Mococo and made a heartfelt promise: she would protect her and stay by her side. From that moment on, Elizabeth became Mococo's shield, her unwavering guardian in this strange new world.  \n<br>\n\n[From here on out, I will promise you I will remain by your side](#embed:https://www.youtube.com/live/2qiX7084obE?t=3891)\n<br>\n\n\nThe knight's words were stirdy, firm, and trustworthy. They provided warmth and comfort, and Mococo felt safe under the protection of Elizabeth, so much that even losing sight of her would cause her to go into a minor [panic](https://www.youtube.com/live/OSjlqA0FS9Q?feature=shared&t=4131). She wished to be by her side, and Elizabeth in turn, would uphold that promise, no matter what.\n",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "gonathan-g-tam-gandr-bottom-2-left-2",
          "source": "gonathan-g",
          "target": "tam-gandr",
          "sourceHandle": "bottom-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#77e03e"
          },
          "data": {
            "relationshipId": "protector",
            "title": "You're the Queen!",
            "content": "The blue maiden was still disoriented when she was first summoned to the white box, grappling with the unsettling realization that all of her memories were gone. The most pressing issue, of course, was that she couldn’t even recall her own name. Giving herself one felt like far too much effort, so when she encountered someone brimming with confidence, she simply asked them to name her.\n<br>\n\n[Gonathan gives the blue maiden a name](#embed:https://www.youtube.com/live/zgioohaY0m4?t=699)\n<br>\n\nThus, she became Tam Gandr—a name she quickly decided was befitting of royalty. Declaring herself the future ruler of this strange new kingdom (self-proclaimed, of course), Tam embraced her role with an air of grandeur. Gonathan, summoned with a sense of knightly duty already deeply instilled, immediately recognized Tam’s \"regal\" potential. Believing her to be a rightful queen, he pledged himself as her [knight](https://www.youtube.com/live/y9KKa_k2VTU?feature=shared&t=5727), swearing to protect and follow her wherever she went.\n<br>\n\nTam, in her self-proclaimed royal empathy, didn’t just demand loyalty; she reciprocated it. Whenever her loyal knight faced confrontations—particularly from Elizabeth, who doubted the legitimacy of their claims—Tam stood by Gonathan, shielding him in her own way.\n<br>\n\nTheir bond was unwavering, though their united disdain for the Amber Coins raised eyebrows. Whether or not such behavior could be deemed \"knightly\" or \"queenly\" was debatable, but to Tam, Gonathan was her most trusted follower, and to Gonathan, Tam was the queen he was destined to serve.\n<br>\n\n[Tam demanding Elizabeth to apologize to Gonathan](#embed:https://www.youtube.com/live/zgioohaY0m4?t=9132)\n",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "peasant-da-bae-cleopatra-eisenhower-da-vinci-bottom-2-top-2",
          "source": "peasant-da-bae",
          "target": "cleopatra-eisenhower-da-vinci",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#ffd885"
          },
          "data": {
            "relationshipId": "alliance",
            "title": "Friends (?)",
            "content": "You put a rat and an owl in the same room, and it’s only a matter of time before the owl starts picking on the rat. That was precisely what happened between Three and Bae on their first day. Three wasn’t particularly kind to her newfound companion—teasing her, calling her crazy—and Bae knew all too well that she was being picked on.\n<br>\n\n[Bae and Three's initial encounter](#embed:https://www.youtube.com/live/vuij6YTMIzw?t=3422)\n<br>\n\nBut that dynamic didn’t last long. In a chaotic fantasy kingdom filled with equally chaotic inhabitants, survival demanded teamwork. It wasn’t long before Bae and Three put their differences aside to face the day’s challenges together. From quests to learning the kingdom’s peculiar mechanics, the two stuck together, becoming unlikely allies.\n<br>\n\nTheir teamwork extended to investigating the arrival of the [Hot Pink One](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=6025). After some awkward introductions and a hilariously confusing debate over whether the Hot Pink One’s weapon was a halo or a set of shurikens, Bae and Three came to a unanimous conclusion: she was too much trouble. Deciding against recruiting her, they [left her](https://www.youtube.com/live/vuij6YTMIzw?feature=shared&t=6319) to her eccentricities. Perhaps bringing the town loony into their guild would have done more harm than good.",
            "pathType": "smoothstep",
            "day": 0
          },
          "selected": false
        },
        {
          "id": "raora-panthera-tam-gandr-right-2-top-1",
          "source": "raora-panthera",
          "target": "tam-gandr",
          "sourceHandle": "right-2",
          "targetHandle": "top-1",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "Say my name",
            "content": "The (self-proclaimed) Libestian Queen was already making a name for herself across the kingdom. She had gathered loyal followers, asserted her dominance, and made others bow whenever they stood in her presence. \n<br>\n\nIt was only natural—after all, she was perfect. Brimming with empathy and compassion, she never let anything get under her skin, always maintaining her mature composure throughout the day… that was, until a certain pink cat appeared.\n<br>\n\n[Stop laughing, that's my name you're laughing about!](#embed:https://www.youtube.com/live/zgioohaY0m4?feature=shared&t=12506)\n<br>\n\nNever had Tam imagined that someone could get on her nerves so much simply by mispronouncing her name—albeit, repeatedly. But this wasn’t just any pink cat. Upon learning that Tam was supposedly the \"Queen\" of the kingdom, Raora wasted no time in claiming the title for herself, declaring that she was the true queen and that Tam was merely second in line. Tam, of course, refused to back down, firing back that she was the actual queen, while Raora was just an impostor.\n<br>\n\n\nWhat followed was a [conversation](https://www.youtube.com/live/8ybUOw9NhMc?feature=shared&t=13146) that could only be described as something straight out of a playground argument—two individuals, going back and forth, each trying to one-up the other in their imaginary rule. The only problem? These were fully grown adult women.\n<br>\n\nRaora, however, wasn’t just playing around—she was serious. She would do whatever it took to prove she was the true queen. But Tam? She could only shake her head and brush the whole thing off, thinking to herself, \"What the heck is wrong with this person?\"",
            "pathType": "custom",
            "day": 0,
            "offsets": {
              "HL": 0,
              "VL": 18.379173679952537,
              "HC": 0,
              "VR": 0,
              "HR": 0
            }
          },
          "selected": false
        }
      ]
    },
    {
      "dayRecap": "## Day 2: Love, Hats and FaunaMart\n\nThe second day in the Kingdom of Lisbestal brought more than just progress—it brought chaos, laughter, and the blossoming of peculiar relationships. As everyone began to settle into their roles and understand the mechanics of this world, new bonds were forged, and the dynamics among the heroes grew even quirkier.\n<br>\n\n\nMarriages became the talk of the day: Gonathan and Jyan Watson tied the knot in an impromptu ceremony, Shiori and Bijou declared their undying love, and Nino Ina and The Hot Pink One became each other's eternal consort. The royal status Tam Gandr held, the 'Queen', also gained more attraction with its followers. \n<br>\n\nMeanwhile, a mysterious faction known as **The Appointed Points** formed—a group connected telepathically by their distinctive pointy hats. Their bond was so profound that if one member were to remove their hat, the entire group would perish (or so they claimed). \n<br>\n\n[The Appointed Points' tips touching ritual](#image:https://i.imgur.com/ziC2ztl.png)\n<br>\n\n\nAmong the day's other notable developments was the grand opening of **FaunaMart**, a convenience store managed by Ceres Fauna. While Fauna claimed her establishment, complete with lottery tickets, was a gift for the community, skepticism abounded. Whispers of it being a scam circulated, with some heroes keeping a wary eye on the 'witch' and her growing enterprise.\n\n<br>\n\n\nBut amidst the shenanigans, the heroes did not forget their primary mission: to conquer the [**Ocean Temple Dungeon**](#out:https://x.com/hololive_En/status/1830425412440404160). This underwater labyrinth, reminiscent of the lost city of Atlantis, presented puzzles, secrets, and the allure of a hidden treasure, the most coveted prize of the day- the music disc titled *Reflect*. The dungeon proved to be a significant challenge, testing their teamwork and wit, but ultimately, they prevailed.\n<br>\n\n[The girls attempting the Ocean Temple Dungeon](#image:https://i.imgur.com/nwjf0wa.png)\n<br>\n\nIn completing the dungeon, the heroes unlocked another fragment of their forgotten past—this time, uncovering the story of [Gawr Gura](https://www.youtube.com/watch?v=SDnRHwpnIH4).\n",
      "title": "",
      "nodes": [
        {
          "id": "fuwawa-abyssguard",
          "type": "image",
          "position": {
            "x": 475,
            "y": 300
          },
          "data": {
            "title": "Fuwawa Abyssguard",
            "content": "Upon re-entering the kingdom, Fuwawa teamed up with Mococo to seek companions for a dungeon expedition. Their search led them to Liz, and as the trio exchanged pleasantries, their conversation was interrupted by a peculiar advertisement call from Fauna, promoting her new business venture, [FaunaMart](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=665). While Fuwawa was only mildly interested to the pitch, Mococo was thoroughly intrigued, and her excitement dragged both Fuwawa and Liz to the newly opened convenience store.\n<br>\n\n\nFuwawa decided to try her luck and purchased a single [lottery ticket](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=903). Mococo, on the other hand, went all in, buying an astonishing sixty-eight tickets. Fuwawa was visibly concerned, quietly sharing her worries with Liz about Mococo’s impulsive spending habits and the possibility of her running out of money for basic necessities like food.  \n\n<br>\n\n[Fuwawa worries that the fuzzy one won't have any money left](#embed:https://www.youtube.com/live/jjCVWFJl-_o?t=967)\n<br>\n\nAs Mococo painstakingly listed all sixty-eight of her ticket numbers, Fuwawa’s patience wore thin, with each new number called, her annoyance grew more [visibly](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=1180).\n\n<br>\n\n\nWith the lottery escapade behind them, the group turned their attention back to preparing for the **Ocean Temple Dungeon**. Along the way, they encountered other adventurers. Fuwawa, ever curious, was captivated by the Scarlet Wand members and their striking long [red hats](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=1594). Later on, her innate clumsiness soon got the better of her, and she wandered off into a random area of the map, momentarily [getting lost](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=2257).\n\n<br>\n\nEventually, the party made their way into the dungeon. The labyrinth was filled with challenging puzzles, and Fuwawa’s empty-headed moments and occasional [screams](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=5170) punctuated the adventure. Despite her frequent distractions, the group managed to overcome the obstacles and successfully recovered memories of [Gawr Gura](https://www.youtube.com/live/jjCVWFJl-_o?feature=shared&t=4848). \n<br>\n\nSatisfied with the day’s achievements, Fuwawa decided to call it a night. ",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Fuwawa-Abyssgard_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#67b2ff"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "mococo-abyssguard",
          "type": "image",
          "position": {
            "x": 700,
            "y": 300
          },
          "data": {
            "title": "Mococo Abyssguard",
            "content": "On her second day in the kingdom, the fuzzy one, Mococo, awoke with a sense of renewed determination. Her first day had been overwhelming—strange people, unfamiliar surroundings, and a whirlwind of emotions had left her quite shaken. But amidst all the chaos, there was a comforting presence: the lady in red, Elizabeth, who promised to always stay by her side. That promise gave Mococo a sense of ease.\n<br>\n\n\nBeing the sociable doggo she was, Mococo wasted no time seeking companionship. She reached out to Raora and Elizabeth, asking if they’d be interested in tackling the second dungeon together. Both agreed, and with Fuwawa tagging along, Mococo excitedly went to group up. During their gathering, Mococo brought up a new establishment she’d heard about—**FaunaMart**. \n<br>\n\nShe had her eyes on the intriguing promise of lottery tickets being sold there. Before she could explain further, she received an ad call from [Fauna](https://www.youtube.com/live/0rhoyO69kAQ?feature=shared&t=703) herself, enthusiastically pitching the lottery and its grand prizes. While Elizabeth and Fuwawa seemed indifferent, Mococo was hooked. Without giving them much of a choice, she dragged the two to check out the shop. \n<br>\n\n\nAt FaunaMart, Mococo dove right in and bought her first lottery ticket. She reasoned it was best to play it safe—after all, this could be a scam. Therefore, Mococo, being the resposible doggo that she was, bought only one, two, three...four...sixty-eight tickets. She spent every last coin she had, her tail wagging with excitement. \n<br>\n\nElizabeth and Fuwawa exchanged worried glances as Mococo gleefully held her mountain of tickets, certain she’d struck gold. She assured Elizabeth that she’d soon be rich and promised to treat her friends once she hit the [jackpot](https://www.youtube.com/live/0rhoyO69kAQ?feature=shared&t=1310). Elizabeth, though still concerned, wished her the best of luck.\n<br>\n\n\n[Mococo buying 68 lottery tickets, the voices in her head begging her to stop](#embed:https://www.youtube.com/live/0rhoyO69kAQ?t=923)\n<br>\n\n\nWith their detour to FaunaMart complete, the group returned to focus on their goal: the **Ocean Temple Dungeon**. They regrouped with Shakira and Raora, their companions for the dungeon conquest. Upon learning of Mococo’s excessive ticket-buying spree, Shakira couldn’t help but question her [decision](https://www.youtube.com/live/0rhoyO69kAQ?feature=shared&t=2368). Mococo was unbothered, she was determined that her decision was anything but wrong.\n\n<br>\n\n[Shakira's concern for Mococo's questionable decision](#embed:https://www.youtube.com/live/0rhoyO69kAQ?t=2365)\n<br>\n\nGetting back on track, the second dungeon proved challenging, but together, the group triumphed. They solved the puzzles, fought through peril, and recovered memories of [Gawr Gura](https://www.youtube.com/live/0rhoyO69kAQ?feature=shared&t=4851). \n<br>\n\nAs the day drew to a close, Mococo felt fulfilled by their adventure. Her thoughts, however, lingered on the jackpot she was certain awaited her. With dreams of riches dancing in her mind, she settled down for the night, a smile on her face and her paws crossed for good fortune. As innocent as she was, this marked the beginning of a storyline nobody saw coming. ",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Mococo-Abyssgard_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#f7a6ca"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "elizabeth-rose-bloodflame",
          "type": "image",
          "position": {
            "x": 475,
            "y": 500
          },
          "data": {
            "title": "Elizabeth Rose Bloodflame",
            "content": "As the knight in red stirred from her slumber, fragments of a memory surfaced—a faint recollection from day one. It was the moment Elizabeth Rose Bloodflame had sworn her unwavering loyalty to the fuzzy dog, Mococo. This memory wasn’t just a fleeting thought but a cornerstone of who she was, a defining piece of her identity. Elizabeth’s journey would be marked by such recollections, each day unearthing a new fragment that shaped her character and story.\n<br>\n\n[A fragment of memory from the first day](#embed:https://www.youtube.com/live/M3cuDNZrIKM?t=90)\n<br>\n\nWith the memory fading into the background, Elizabeth prepared to enter the kingdom. Upon arrival, she was greeted warmly by the doggy duo, [Fuwawa and Mococo](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=933). Their lively chat quickly set the tone for the day. Mococo excitedly asked if Elizabeth would join them in tackling the second dungeon and if she’d heard of the newly established FaunaMart.\n<br>\n\nJust as Elizabeth began to respond, an unexpected voice echoed in her mind. It was Fauna, delivering a telepathic advertisement for her new business. \n<br>\n\n[She's in my brain!](#embed:https://www.youtube.com/live/M3cuDNZrIKM?t=1078)\n<br>\n\nThe red knight froze, startled by the direct intrusion into her thoughts. To Elizabeth, this wasn’t just clever marketing—it was witchcraft. The idea of a \"witch\" targeting her so brazenly filled her with unease, and she began to suspect that Fauna might wield dark powers.\n<br>\n\n\n\nDespite her apprehension, Elizabeth accompanied Fuwawa and Mococo to FaunaMart. The doggos, especially Mococo, seemed eager to investigate this mysterious store that sold lottery tickets. \n<br>\n\nAt the shop, Fauna welcomed them with her usual charm and started explaining how the lottery system worked. Elizabeth, however, remained vigilant, keeping a watchful eye on Fauna’s every move. To her, the long red hat Fauna wore was the mark of a witch, and she couldn’t shake the feeling that danger lurked beneath Fauna’s cheerful [demeanor](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=1231). \n<br>\n\n\nMococo, unbothered by Elizabeth’s suspicions, decided to buy not one, not two, but sixty-eight lottery tickets. The sheer extravagance left both Elizabeth and Fuwawa stunned, their concern growing with each ticket Mococo [purchased](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=1615).\n<br>\n\n\n\nAfter bidding farewell to the \"witch,\" the group turned their attention to the day’s main quest: conquering the **Ocean Temple Dungeon**. Joining Elizabeth and the doggos were Shakira and Raora. The journey was fraught with challenges, including several failed attempts and plenty of [trolling](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=4122), but their persistence paid off. By the end of the ordeal, they emerged victorious, recovering memories of [Gawr Gura](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=5143).\n<br>\n\n\nReturning to the kingdom, Elizabeth encountered a figure she had taken an instant disliking to on the first day—Tam Gandr, the self-proclaimed queen. Fueled by her distaste, Elizabeth wasn't going to let the blue maiden get the better of her this time (see [Elizabeth-Tam: Some queen, eh?](#edge:elizabeth-rose-bloodflame-tam-gandr-top-3-top-2)).\n<br>\n\n\nLater on, Elizabeth refocused her efforts. She joined Shakira in uncovering the first dungeon’s secret treasure, a hidden music disc. The day ended on a brighter note as the group celebrated their success with a lively party at the [tavern](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=10446).\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Elizabeth-Rose-Bloodflame_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#d46759"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false
        },
        {
          "id": "jyanthan",
          "type": "image",
          "position": {
            "x": 700,
            "y": 500
          },
          "data": {
            "title": "Jyanthan",
            "content": "There was no \"active POV\" from Jyan Watson on the second day, but she was spotted with other members throughout the day. She began by catching up on the first dungeon, having missed the opportunity to explore it on her first day. Accompanied by Shiori, Bijou, and Gonathan G, Jyan finally experienced the dungeon's mysteries.\n<br>\n\n\nHer day took an unexpected turn when she entered into a spontaneous marriage with Gonathan (see [Gonathan-Jyan: My Pearl!](#edge:gonathan-g-jyan-watson-top-2-bottom-2), prompted by his gift of ten diamonds. True to her dynamic nature, Jyan found herself amidst a variety of shenanigans—being flirted with, witnessing duels, and \"humorously\" referring to the Hot Pink One as her \"backup plan.\" (see [Hot Pink One-Jyan: Plan B](#edge:jyan-watson-hot-pink-one-left-2-bottom-2)) \n<br>\n\nLater, Jyan joined forces with Ina, Nerissa, and Calli to tackle the **Ocean Temple Dungeon**. Together, they solved puzzles, braved the challenges, and successfully recovered memories of Gawr Gura.\n<br>\nFor a closer look at the events of the day, her perspective was woven through the views of others.",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/ame.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#f8db92"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 300
          },
          "data": {
            "title": "Tanakisha Shakaria",
            "content": "Shakira embarked on the second day of her adventure with excitement buzzing in her chest. It wasn’t long before she found herself at the quest board, where she encountered Fauna, Darwin, and Cecilia. \n<br>\n\nThe group struck up a lively conversation, with Shakira and Cecilia bonding over their shared knowledge of German, with Shakira proclaiming it to be the [“language of the gods”](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=378). Fauna also enthusiastically introduced Shakira to her latest business venture—**FaunaMart**, a store offering local goods and lottery tickets.\n<br>\n\n\nWhile Fauna spoke with confidence about the “big jackpot” awaiting lucky customers, Shakira and Darwin exchanged skeptical glances. Something about the whole setup felt off, so Shakira decided to accompany the group to investigate this so-called convenience store. As Fauna continued to boast about the elusive jackpot without providing any evidence, Shakira’s suspicions deepened. She eventually warned Fauna that if her business turned out to be a scam, she wouldn’t hesitate to report it to [Queen](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=1129).\n<br>\n\n\nLater, Cecilia invited everyone to join her German-learning quest. Shakira, still wary of the red hats, dismissed the idea, claiming she could teach German far better—boasting that her Germany was the [“superior Germany”](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=1335) (oh god not again). Regardless, Shakira chose not to join the quest and went her ways. Later on, Darwin called Shakira through the telekenisis device, now suddenly speaking fluent German—a skill she had just acquired from Cecilia’s quest. It was a deliberate jab, and Shakira couldn’t help but feel annoyed by the scam call.\n<br>\n\n[Dieser Satz ist auf Deutsch](#embed:https://www.youtube.com/embed/qKlzaYirN88?si=cYKwhcQJE8Dwtauq&amp;start=1719)\n<br>\n\n\nShakira stopped by Calli and Gonathan, using the opportunity to warn them about FaunaMart and the potential dangers posed by the red hats. Despite it only being her second day in the kingdom, Shakira’s keen sense of justice was already attuned to the undercurrents of deceit. Though her trust in others was beginning to waver, she found some comfort in her pink cat and her guildmates, at least these folks would never betray her...right? (see [Darwin-Shakira: Double Agent](#edge:tanakisha-shakaria-darwin-roosevelt-dicaprio-jr-top-2-right-2)) \n<br>\n\nFast forward, when Shakira noticed Calli interacting with the red hats, seemingly on the verge of being scammed, she rushed to intervene. To her surprise, Calli assured her that she had the situation under control and revealed that she was, in fact, [scamming](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=2663) them instead. Although Shakira felt conflicted—knowing this only perpetuated the cycle of deception—she decided to trust Calli’s judgment and let her continue.\n<br>\n\nAs the day wore on, Shakira sought solace in the company of her pink cat, the one companion she felt she could truly rely on. Shakira then prepared herself for the **Ocean Temple Dungeon**, joining forces with Elizabeth, the pink cat, and the two doggos. Her sharp “RPG senses” guided the team to a hidden treasure—a music disc labeled Reflect. Pleased with the find, Shakira made a mental note to revisit the first dungeon to uncover its secrets [as well](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=9051).\n<br>\n\n\nAfter conquering the dungeon and recovering memories of Gawr Gura, Shakira returned to the kingdom. On her way back, she noticed that Queen Tam Gandr had awakened. Wasting no time, she approached the queen to report her suspicions about FaunaMart’s alleged scams, introducing herself as the savior of the ~~[lesbians](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=9867)~~ Libestians in hopes of earning the queen’s trust.\n<br>\n\n\nAs the day drew to a close, Shakira, joined by Liz and Raora, ventured back into the first dungeon. Guided once again by her RPG instincts, she uncovered another hidden music disc, *\"Excuse me, can you please RIP\"*. She became the first adventurer to own this artifact, a small but satisfying [victory](https://www.youtube.com/live/qKlzaYirN88?feature=shared&t=13548) to end a chaotic day.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Takanashi-Kiara_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#ff511c"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "peasant-da-bae",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 300
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "raora-panthera",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 500
          },
          "data": {
            "title": "Raora Panthera",
            "content": "The big pink cat awoke from her slumber, feeling fully refreshed and ready for mischief. As soon as she arrived, she greeted Shakira and Gonatha, and wasting no time, Raora seized the chance to tease Gonathan, tricking him into kneeling before [her](https://www.youtube.com/live/qDhyA4-79ko?feature=shared&t=524). She knew all too well that his loyalty was solely reserved for Tam Gandr, the so-called \"fake queen\", as Raora often referred to her. \n<br>\n\nHer disdain for Tam ran deep, and she took the moment to try and sway Shakira, claiming that she, Raora, was the true queen while Tam was nothing more than a pretender.\n<br>\n\n[\"She is FA KE! She is FA KE!\"](#embed:https://www.youtube.com/live/qDhyA4-79ko?t=696)\n<br>\n\nGetting back on track, Raora refocused on the day’s main objective: the **Ocean Temple Dungeon**. She assembled her team, including Shakira, Elizabeth, and the two doggos, and together they embarked on the challenging journey. The adventure was anything but quiet, with bursts of shouting and chaotic moments scattered [throughout](https://www.youtube.com/live/qDhyA4-79ko?feature=shared&t=3654), but their determination paid off. In the end, they successfully recovered the memories of [Gawr Gura](https://www.youtube.com/live/qDhyA4-79ko?feature=shared&t=4663).\n\n<br>\n\n\nUpon their return, they found themselves face-to-face with Tam Gandr and her guildmates at the quest board. Shakira knelt before Tam and brought up her concerns about the suspicious FaunaMart scam. Shakira’s act of loyalty was also a statement of trust—she saw Tam as the rightful ruler, much to Raora’s visible [displeasure](https://www.youtube.com/live/qDhyA4-79ko?feature=shared&t=6292). Raora couldn’t help but feel that Shakira’s allegiance should lie with her instead.\n<br>\n\n\nLater in the day, Raora crossed paths with Tam again, this time finding her in a heated argument with Elizabeth. Sensing an opportunity to rile Tam up, Raora wasted no time stirring the pot (see Raora-Tam: [Fake Queen](#edge:raora-panthera-tam-gandr-right-2-top-1)).\n<br>\n\n\nAfter cooling off, Raora joined Shakira in revisiting the first dungeon to uncover its secret treasure. They managed retrieve a hidden music disc, which became the centerpiece of a celebratory evening at the [tavern](https://www.youtube.com/live/qDhyA4-79ko?feature=shared&t=9968). Together, they reveled in their small victory, their bond strengthened by the shared adventure.",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Raora-Panthera_list_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#f087a9"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "darwin-roosevelt-dicaprio-jr",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 500
          },
          "data": {
            "title": "Darwin Roosevelt Dicaprio Jr.",
            "content": "A new day, a new start, and for our girl in brown, a new name. Given how many people struggled to remember her name on the first day—Cleopatra Eisenhower Da Vinci the Great the Third—you’d think she’d choose something simpler. Well, she did... just not in the way you’d expect. On day two, our owl girl proudly declared herself as [Darwin Roosevelt Dicaprio Jr., or simply Darwin](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=322).\n<br>\n\n\n\nWeird and elaborate names aside, Darwin was ready to dive into her second day in the kingdom. Her first interaction was with Fauna, who was busy constructing her budding business, **FaunaMart**. \n<br>\n\nFauna explained her vision: a convenience store selling local goods and lottery tickets. Darwin was immediately skeptical, especially when Fauna claimed that “10% of ticket revenue goes to the library.” A quick visit to the library, which had a shockingly sparse collection of books, only deepened Darwin’s doubts (see [Darwin-Fauna: Shady Business](#edge:darwin-roosevelt-dicaprio-jr-ceres-fauna-top-1-left-2))\n<br>\n\n\n\nLater, the two made their way to the quest board, where they met Shakira, Cecilia, and Gura. True to form, Fauna began advertising her business again. Darwin, ever the skeptic, tried to warn the group about the potential scams, but her efforts were [in vain](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=2260) as everyone became enamored with FaunaMart. Amid Darwin’s exasperated rants—especially about Fauna exploiting illiterate customers—the group veered off-course for a side quest initiated by Cecilia: learning German.\n<br>\n\n\nDarwin, being a self-proclaimed genius, picked up the language instantly, speaking fluently [in no time](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=3180). Their antics continued with more lighthearted conversations, including a discussion about “satisfying videos for men” and Darwin’s untouched Kindle. \n<br>\n\n[Just hanging out with the gang](#embed:https://www.youtube.com/live/WQRPyJ4zhC0?t=3758)\n<br>\n\n\nWhen it came time to try the hat gacha, Darwin surprised everyone by pulling the long hat (representing the Scarlet Wand guild) on her very first try. Gura, in particular, was left [flabbergasted](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=3931).\n<br>\n\nOne standout moment came when Darwin reunited with her guildmate Shakira. Initially, Shakira accused Darwin of betraying the Amber Coin and joining the Scarlet Wand. But Darwin revealed that her apparent betrayal was part of her role as a spy (see [Darwin-Shakira: Double Agent](#edge:tanakisha-shakaria-darwin-roosevelt-dicaprio-jr-top-2-right-2))\n<br>\n\n\nFinally returning to their main objective, Darwin, along with Gura and Cecilia, tackled the **Ocean Temple Dungeon**. Upon conquering it, they successfully recovered Gawr Gura’s [memories](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=10437). Triumphant, the group returned to the kingdom, with Darwin entertaining everyone along the way with her trademark horse noises. They ended the day by unwinding with some good old-fashioned [gambling](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=11457).\n\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Nanashi-Mumei_list_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#dcc4b2"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "mori-calliope",
          "type": "image",
          "position": {
            "x": 250,
            "y": 400
          },
          "data": {
            "title": "Mori Calliope",
            "content": "Calli’s second day in the kingdom began with a lively group conversation. Among the crowd, she congratulated the newlyweds, Gonathan G and Jyan Watson. As Jyan was her guildmate, Calli made sure to extract a promise from Gonathan to take good care of his [wife](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=704). Soon after, she encountered another newlywed couple—Shiori and Bijou. This pair, however, had a rather peculiar dynamic that left Calli feeling more [concerned](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=970) than celebratory.\n\n<br>\n\n\nSeeing so many couples getting married sparked a sudden idea in Calli’s mind. Why not capitalize on the inevitable fallouts? What if she built a diner specializing in divorce services? Originally planning for a simple diner, she quickly pivoted to the more lucrative and unique angle of offering food alongside divorce consultations. Calli was convinced this genius idea would make her rich. Fueled by excitement, she set out to lay the foundation of her new [venture](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=1775).\n<br>\n\n\nOnce the basic structure of her diner was complete, Calli realized she needed to spread the word. She headed to the tavern to announce her grand business idea. However, to her disappointment, every married couple she approached rejected the concept outright, some with outrage. Undeterred by the backlash, Calli pressed on, coming up with a catchy slogan: [“Save your money, lose your honey”](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=2550)\n\n<br>\n\n[Calli receives backlash as she advertises her business](#embed:https://www.youtube.com/live/oPKmSO7XtoY?t=2360)\n<br>\n\n\nLater in the day, Calli joined a team to tackle the **Ocean Temple Dungeon**. Her group included Nerissa, Jyan, and Ina. Together, they wracked their brains to solve the dungeon’s puzzles and eventually succeeded, recovering the memories of [Gawr Gura](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=5368).\n\n<br>\n\n\nAs they emerged from the dungeon, Calli witnessed yet another impulsive wedding—this time between Ina and the Hot Pink One. While the rest of the group celebrated the union, Calli quietly smirked. She wasn’t cheering for their happiness but for the potential future customers her business might attract. [“They all start off so naive”](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=5828), she mused as the newlyweds declared their eternal love. By now, Calli had a fitting name for her establishment: [“Until Death Do You Part.”](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=5879) \n<br>\n\n\nBack in the kingdom, Calli resumed the diner’s construction. At some point, she received a [prank call](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=8313) from Bijou, likely in retaliation for her constant jabs about Shiori and Bijou’s marriage falling apart. \n<br>\n\nReflecting on her new venture, Calli began to reconsider its premise. The harsh reception from the kingdom’s couples made her realize that her idea might be a little too cruel. As Calli had the revelation, she decided to revise her business model. She'd no longer be selling any kind of divorce services...instead, they'd come free with any meal purchased, [free of charge](https://www.youtube.com/live/oPKmSO7XtoY?feature=shared&t=8229). Oh, Calli.\n<br>\n\nCalli held great hopes for her diner’s future. Love, after all, often ends in heartbreak, and when it did, she knew people would come for the divorces and stay for the food.\n\n\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/calli.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#c90d40"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "ceres-fauna",
          "type": "image",
          "position": {
            "x": 475,
            "y": 800
          },
          "data": {
            "title": "Ceres Fauna",
            "content": "Fauna had a revelation after her first day in the kingdom. Saving the kingdom? Too boring. Adventuring? Meh. What truly sparked joy was something far more practical—*money*. It felt like destiny, she reasoned, considering her green hue was the same color as wealth. And so, on her second day, Fauna made a bold declaration: goodbye main quest, hello NPC life. Thus, [FaunaMart](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=176) was born.\n<br>\n\n\nThe concept of FaunaMart was as ingenious as it was dubious: a convenience store selling daily goods and necessities at a premium price and lower quantities than any reasonable competitor. Totally not a scam. But Fauna didn’t stop there; her real moneymaker was the store’s centerpiece—**lottery tickets**. \n<br>\n\nFor 10 coins apiece, customers could try their luck, with the promise that 10% of the proceeds would fund the construction of a community library, while 30% would go straight into her pockets.\n<br>\n\n[Man I Love Gambling](#embed:https://www.youtube.com/live/eUQWfgVwwpo?t=646)\n<br>\n\nConstruction of the cozy, wooden shop [began](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=3387), and Fauna envisioned a charming establishment that would eventually sit beside the promised library (once the shop was complete, of course). It wasn’t long before Fauna found her first ~~victim~~ customer (see [Darwin-Fauna: Shady Business](#edge:darwin-roosevelt-dicaprio-jr-ceres-fauna-top-1-left-2))\n<br>\n\n\nWith her first sale secured, Fauna spread the word to her guildmate Cecilia, recruiting her to help sell more tickets. Together, they approached Shakira, but the orange lady proved a tough nut to crack. Shakira wasn’t just skeptical; she accused Fauna of exploiting people and declared the lottery an obvious *scam*. She even threatened to report Fauna to the queen, Tam Gandr. But Fauna, unfazed, dismissed the threat as an opportunity for [free advertising](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=11970).\n<br>\n\n\nAfter Shakira stormed off, Fauna and her guildmates resumed their day. They embarked on a brief side quest to learn [German](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=12106), witnessed Darwin winning the coveted long red hat from the gacha (and joining the red hat club via [tip-touching ceremony](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=13042)), and engaged in their usual shenanigans. Fauna also had a hilarious encounter with Calli, who managed to outsmart her during an attempt to sell [more tickets](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=13530).\n\n<br>\n\n\nAs the day progressed, Fauna had to part ways with her guild before the **Ocean Temple Dungeon**. However, not one to miss an opportunity, she turned to telemarketing to promote FaunaMart. Her unconventional approach involved reaching out to potential customers like Bijou, Fuwawa, Mococo, and Elizabeth, the latter being understandably startled when Fauna seemed to speak directly into her mind. \n\n<br>\n\n[Fauna advertising her store through telemarketing](#embed:https://www.youtube.com/live/eUQWfgVwwpo?t=14874)\n<br>\n\nDespite the cheapness of the tactic, it proved effective, bringing in three [new customers](https://www.youtube.com/live/eUQWfgVwwpo?feature=shared&t=15005). Elizabeth and the doggos alone contributed significantly to Fauna’s sales, with Mococo purchasing a whopping 68 tickets. FaunaMart, it seemed, was off to a booming start. \n<br>\n\nBusiness was flourishing, and Fauna’s entrepreneurial spirit showed no signs of slowing down. But as promising as her future appeared, one couldn’t help but wonder: would her questionable business practices eventually lead to lawsuits? Only time would tell.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Ceres-Fauna_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#b4e4c7"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "shiori-nyavella",
          "type": "image",
          "position": {
            "x": 700,
            "y": 800
          },
          "data": {
            "title": "Shiori Nyavella",
            "content": "Shiori, having missed the chance to tackle the first dungeon on her first day, decided to make it her first task on day two. She enlisted the help of Koseki Bijou and Jyan, with the latter also hadn’t ventured into the dungeon yet. \n<br>\n\nWhile waiting for their fourth teammate, a bizarre, chaotic, and utterly Shiori-esque conversation unfolded—somehow the three managed to diverged the conversation topic from simple introductions, to discussions about milking, biting feet, and eating as*. Such peculiar topics had become par for the course when Shiori was around. \n<br>\n\n[Are you milking that for content?](#embed:https://www.youtube.com/live/LTIq_0ykLVA?t=790)\n<br>\n\n\nAnyway, back to the matter at hand. The group successfully conquered the dungeon, and though Shiori was a bit late to the party, she managed to recover memories of [Mori Calliope](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=2480). Following this achievement, she witnessed the marriage ceremony of Gonathan and Jyan Watson (almost derailing it with one of her offhand [comments](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=2936)) and then took a slight detour to the [casino](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=3553).\n<br>\n\n\nLater, Shiori ventured to the entrance of the second dungeon, the **Ocean Temple Dungeon**. She had initially planned to tackle 'the land of the moist world' with Koseki Bijou, but Bijou was already committed to joining her guildmates. Undeterred, Shiori reached out to others for help, but everyone was busy. So, in a moment of boldness (or recklessness), she decided to attempt the dungeon [solo](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=4066).   \n<br>\n\n\nBarely a minute into the dungeon, Shiori began to feel the sting of solitude. Seeking some semblance of company, she called Nerissa via the telekinesis device and filled the silence with random chatter (see [Shiori-Nerissa: Keeping company](#edge:shiori-nyavella-nerissa-ravencroft-bottom-2-top-2)). \n<br>\n\nBut as the dungeon progressed, her initial confidence gave way to mounting frustration. The puzzles proved far more challenging than anticipated, and Shiori’s patience quickly wore thin. \n<br>\n\nShe spent over ten minutes grappling with the second puzzle and another fifteen painstakingly trying to unlock a secret treasure chest, mistakenly believing it was necessary to progress. When she finally realized it was optional, her frustration hit its [peak](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=6303). However, after much struggle, she managed to conquer the dungeon, recovering memories of [Gawr Gura](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=6804). The victory brought a mix of pride and exhaustion. \n<br>\n\n\nAfter the mental ordeal, Shiori returned to the kingdom to unwind. At one of the taverns, she encountered Tam Gandr, engaging in a surprisingly sensual [conversation](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=7805) (they only showed each other their weapons, don't get it twisted). The day ended on an unexpected note when Bijou confessed her feelings to Shiori. To her own surprise, Shiori accepted, and the two consummated their newfound relationship... in front of the cows (see [Bijou-Shiori: Seeds and Eggs](#edge:shiori-nyavella-koseki-bijou-right-2-left-2)).",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Shiori-Novella_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#b8a0cd"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "cecilia-immergreen",
          "type": "image",
          "position": {
            "x": 475,
            "y": 1025
          },
          "data": {
            "title": "Cecilia Immergreen",
            "content": "One of the first things Cecilia did on her first day was having a conversation with Shakira in German, a language only the two of them knew. And, in a similar fashion, one of the first things Cecilia did on the second day was, you guessed it, another conversation with Shakira in [German](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=394). Seems fair—when you're one of only two people fluent in some ancient, mystic language, you make use of it. \n<br>\n\nDuring her morning greetings, Fauna approached Cecilia to introduce her new business venture: **FaunaMart**, a convenience store selling daily necessities and, of course, the star product—lottery tickets. Cecilia was intrigued and decided to support her fellow green compatriot by buying four tickets. \n<br>\n\nSince they were both in the same guild, Scarlet Wand, Cecilia went a step further and helped Fauna sell more tickets. She even tried convincing Shakira to buy some, offering her a special [\"German discount.\"](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=1306). Scam or not, Cecilia felt it was her duty to back up Fauna’s efforts as a fellow entrepreneur.\n<br>\n\n\nNot long after, Cecilia demonstrated to Fauna, Gura, and Darwin how she learned German in three minutes during a self-made [sidequest](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=1401). The quest involved talking to random German-speaking civilians and, somehow, just by listening, gaining the skill like in a video game. The group was skeptical but impressed, especially when Darwin managed to speak [fluently](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=1537) after only a short while. Oddly enough, her voice seemed to change slightly whenever she spoke German, but everyone chalked it up to their imagination.\n\n<br>\n\n\nCecilia then decided it was time to try her luck at obtaining a red hat—an item many of her guildmates already owned. Unfortunately, she had no success, while Darwin, who didn’t even need the hat, got one on her first try. Cecilia was visibly disappointed, but her friends rallied around her to cheer her up, combining their long hats into a [small tipi](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=2471) as a gesture of support.\n<br>\n\n\nThe day continued with Cecilia joining Fauna in trying to sell lottery tickets to Calli, the Grim Reaper herself. However, the tables quickly turned, and the two found themselves on the [receiving end](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=2754) of a scam instead. Business ventures aside, Cecilia’s sharp mind began noticing oddities about the kingdom.  \n<br>\n\n[Cecilia's (crackhead) theory about the king](#embed:https://www.youtube.com/live/a74NeBcixi8?t=3368)\n<br>\n\nShe shared her suspicions with Fauna, Gura, and Darwin, theorizing that the King might be turning the kingdom’s people into the \"stains\" they were sent to fight. What’s more, despite being tasked with clearing dungeons, there were no stains to be found in them. Her suspicions deepened after overhearing and overanalyzing the words (a bug) of a civilian.\n<br>\n\n\nAfter wrapping up their conspiracy discussions, Cecilia, Gura, and Darwin headed to the second dungeon, the **Ocean Temple Dungeon**. After navigating multiple puzzles—and, of course, [overthinking](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=8274) most of them—they successfully completed the dungeon and helped Gawr Gura recover her lost [memories](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=8878). \n\n<br>\n\nExhausted from the mental gymnastics, the group decided to unwind at the casino. Cecilia, just like on the first day, bet all her money on green—and [lost it all](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=9993). Undeterred, she roamed the area looking for someone to lend her money. She eventually found Gonathan, who agreed to trade 9 sticks for 50 coins. With newfound confidence, Cecilia returned to the casino, bet everything on green once more... and [lost it all again](https://www.youtube.com/live/a74NeBcixi8?feature=shared&t=10831).\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Cecilia-Immergreen_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#119a5c"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "nerissa-ravencroft",
          "type": "image",
          "position": {
            "x": 700,
            "y": 1025
          },
          "data": {
            "title": "Nerissa Ravencroft",
            "content": "Nerissa made her debut on day two, joining mid-conversation with her (self-proclaimed) wife , Shiori, who at the time was soloing the second dungeon. Their exchange went as expected for any “married” couple—playful flirting mixed with odd and suggestive banter (see [Shiori-Nerissa: Keeping company](#edge:shiori-nyavella-nerissa-ravencroft-bottom-2-top-2)). \n<br>\n\nNerissa then had her first visit to the casino, and beginner’s luck seemed to be on her side. While the other three faced were losing both their coins and their sanity, Nerissa was winning every single round. By the end, she had amassed a staggering [1,500 coins](https://www.youtube.com/live/nHn2JKHTyzM?feature=shared&t=1644), leaving her two guildmates far behind with only 10 and even 0 coins between them.\n<br>\n\n\nLater, with her newfound wealth, Nerissa went to check out the much-anticipated duel between Elizabeth and the Hot Pink One. Unfamiliar with the context, she simply observed with amusement, smiling as the chaos unfolded. At one point, she tried sparking a conversation with Jyan Watson. However, her natural womanizing aura led Gonathan to mistakenly assume she was flirting with his wife, earning her a [sharp scolding](https://www.youtube.com/live/nHn2JKHTyzM?feature=shared&t=2501).\n<br>\n\n\nNerissa then began construction on a humble [pink house](https://www.youtube.com/live/nHn2JKHTyzM?feature=shared&t=4996) to serve as a communal storage and hangout space for her Scarlet Wand guildmates. She even managed to get her hands on the [coveted long hat](https://www.youtube.com/live/nHn2JKHTyzM?feature=shared&t=6016) she'd been eyeing.\n<br>\n\n\nWhile she paused construction to join other heroes on a journey to the **Ocean Temple Dungeon**, Nerissa found herself in a team with Ina, Calli, and Jyan. Together, they completed the dungeon and recovered memories of [Gawr Gura](https://www.youtube.com/live/nHn2JKHTyzM?feature=shared&t=8401). Afterward, she returned to finish her pink abode, satisfied with the end [result](https://www.youtube.com/live/nHn2JKHTyzM?feature=shared&t=10367).\n<br>\n\n\nAs if it were a custom for these girls, she decided to conclude her day with another trip to the casino. But beginner luck only lasts for so long, and this time around, fortune wasn’t on her side.\n<br>\n\nRound after round, she kept losing. The voices in her head begged her to stop for her own good, but like any true addict, she kept going, muttering, “just one more round.” Despite starting the day as one of the richest heroes with over 1,500 coins, by the end, Nerissa had whittled her fortune down to a mere... 92.\n<br>\n\n[One more game, she said](#embed:https://www.youtube.com/live/nHn2JKHTyzM?t=11250)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Nerissa-Ravencroft_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#2233fb"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "koseki-bijou",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 800
          },
          "data": {
            "title": "Koseki Bijou",
            "content": "After the chaos of the first day, Bijou, feeling a tinge of guilt (not really) for blowing all her money on gambling, decided she'd turn over a new leaf—at least for today. She resolved to be a \"nice person\" and help Shiori conquer the first dungeon, as Shiori hadn’t managed to finish it the day before. Jyan Watson found herself in a similar predicament, so she tagged along as well, enlisting Gonathan’s assistance. \n<br>\n\nNaturally, it wouldn’t be normal for these girls to proceed without some level of absurdity. Before entering the dungeon, a bizarre conversation unfolded—one involving the idea of milking Shiori, biting Bijou’s feet, and the questionable stains on the King’s pants.\n<br>\n\n[Milking and licking feet](#embed:https://www.youtube.com/embed/Y2LV1PUQ0S8?si=yn517X-yzXmBKacT&amp;start=963)\n<br>\n\nAfter completing the dungeon, Bijou had the honor of witnessing Gonathan's [marriage](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=3111) to his wife, Jyan Watson. But, as if on cue, she soon caught the Hot Pink One attempting to flirt with the newlywed bride. Being the good guildmate she was, Bijou promptly alerted Gonathan, who rushed over to reclaim his [beloved](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=4490). \n<br>\n\nHaving done her good deed for the day, Bijou then dragged her companions to the casino to indulge her gambling addiction, intent on finally earning enough money to buy the hat she had been longing for since day one.\n<br>\n\nDespite Bijou’s persistent invitations, Gonathan refused to enter the casino. As a man of principle, he couldn’t bring himself to step into the Amber Coin vicinity—it would be a betrayal of his ideals. Tired of his moral high ground and whining, Bijou hit him where it hurt. \n<br>\n\nRemember her earlier noble act of informing Gonathan about the Hot Pink One’s advances on his wife? Well, forget that. Bijou made a cruel but effective move: she called Gonathan, claiming the Hot Pink One was committing unspeakable acts with his Pearl. Gonathan, panicked and teary-eyed, sprinted to find his wife. It was all just a ruse, but it was as low as it was clever.\n<br>\n\n[Bijou tricking a crying Gonathan](#embed:https://www.youtube.com/live/Y2LV1PUQ0S8?t=5016)\n<br>\n\nHaving gambled her life away once again and educating Gonathan on how hand-holding could lead to [pregnancy](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=5401), the group decided to meet their queen, Tam Gandr. Gonathan explained to Tam about the FaunaMart lottery scam, and, unsurprisingly, the mere mention of \"lottery\" triggered Bijou’s gambling instincts. Like a wild beast, she bolted to the quest board, screaming [\"Gacha! Gacha!\"](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=6431) at the top of her lungs. \n<br>\n\nAt the quest board, the group encountered Elizabeth, who challenged Tam to a duel. Ever the loyal servant, the Hot Pink One stepped up to fight in her queen’s stead and emerged [victorious](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=7239). Riding on her momentum, she challenged Bijou next. As expected of someone who spent most of her time gambling rather than honing her skills, Bijou was promptly defeated, losing not just the duel but also her [dignity](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=7511). \n<br>\n\nLater, the group’s antics continued—Bijou adopted a pet rock, only for the Hot Pink One to, uh, [“fart”](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=7926) on it, which allegedly [killed it](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=7856). Amidst all this, however, something truly significant occurred: mustering all her courage, Bijou confessed her love to Shiori. A small but peculiar ceremony followed, and the two consummated their union (see [Bijou-Shiori: Seeds and Eggs](#edge:shiori-nyavella-koseki-bijou-right-2-left-2)).\n<br>\n\n\nReturning to the task at hand, the team regrouped and prepared to tackle the **Water Temple Dungeon**. Before entering, Ina hosted an auction for her hat. Although Bijou coveted the hat, she decided she wanted to earn her own through her own [efforts](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=11244), so she refrained from bidding. Alongside Tam, Gonathan, and the Hot Pink One, Bijou successfully conquered the dungeon and helped recover memories of [Gawr Gura](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=13002). Yet another marriage took place afterward, this time between the Hot Pink One and Nino Ina.\n<br>\n\n\nAfter the dust settled, Bijou decided to test her luck one last time to win a hat before calling it a day. But alas, fortune was not on her side. She ended her day empty-handed and dejected, her dreams of a hat left unfulfilled.\n<br>\n\nBefore she headed off, wooden shovel.\n<br>\n\n[Wooden shovel](#embed:https://www.youtube.com/live/Y2LV1PUQ0S8?t=10815)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Koseki-Bijou_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#6e5bf4"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "gonathan-g",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 800
          },
          "data": {
            "title": "Gonathan G",
            "content": "The second day began with Gonathan diving straight into action. Tasked with assisting in clearing the Underworld Dungeon alongside Jyon, Bijou, and Shiori, Gonathan found himself in peculiar company. Jyon and Shiori hadn’t managed to conquer the dungeon on the first day, so this was their chance to catch up. \n<br>\n\nHowever, before venturing into the depths, a bizarre conversation unfolded, leaving Gonathan bewildered. The group revisited their shared goal of slaying the King—a plan initially sparked by Jyon’s motives. For Gonathan, the King’s corruption was a reason to free him. For the others? The goal seemed more… recreational.  \n<br>\n\n[What is this conversation](#embed:https://www.youtube.com/live/kB2jUKUsxtE?t=35)\n<br>\n\n\nAfter clearing the dungeon, Gonathan’s day only grew more eventful. A surprising twist came in the form of a small marriage ceremony, binding him and **Jyonathan** in holy—or perhaps chaotic—matrimony (see [Gonathan-Jyonathan: My Pearl!](#edge:gonathan-g-jyanthan-top-2-bottom-2)). \n<br>\n\nThe day wasn’t done with its events. Joined by his guildmates, Gonathan reported recent kingdom happenings to Queen Tam Gandr, including a scam orchestrated by the Scarlet Wand guild involving fraudulent [lottery tickets](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=5324). At the quest board, while seeking more information about the scam from Shakira, the group encountered Elizabeth, sparking immediate tension. Cerulean Cup braced for confrontation. \n<br>\n\nA duel was proposed, and the Hot Pink One volunteered to fight in her Tam's [steed](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=5963). Amidst these antics, Cecilia ~~stole~~ asked Gonathan if he were able to lend her 50 coins, after ~~lying~~ saying she was Jyon's guild mate, to which Gonathan, representing that of empathy, did exactly just that. The loan was never [repaid](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=6001).\n<br>\n\n\nThe duel concluded with a victory for the Hot Pink One, allowing everyone to continue with their day. Gonathan, ever the romantic after his own whirlwind marriage, encouraged Bijou to confess her feelings to Shiori. She did, and the confession culminated in another accepted [marriage](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=7406)—love seemed to be the theme of the day.\n<br>\n\n\nAs the day neared its end, preparations for the **Ocean Temple Dungeon** began. Joined by the Hot Pink One, Bijou, and Tam, Gonathan conquered the dungeon and recovered memories of [Gawr Gura](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=12043). Not long after, another marriage ceremony unfolded, this time uniting the *Hot Pink One and Nino Ina*. What a wonderful occasion this day has been, he thought. He experienced, for the first time, the touch of another’s affection, and watching his guildmates embrace similar happiness only added to the warmth he felt.\n<br>\n\n[What a happy ocassion, huzzah!](https://www.youtube.com/live/kB2jUKUsxtE?t=12550)\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Gigi-Murin_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#fdb440"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "hot-pink-one",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 1025
          },
          "data": {
            "title": "Hot Pink One",
            "content": "The day began with bold intentions from the Hot Pink One, whose first move was to stir up some drama. Targeting Gonathan's newly wedded wife, Jyanathan, at the quest board, the Pink One adopted a flirtatious demeanor, her motives unclear but certainly mischievous. Fortunately, Bijou quickly notified Gonathan, who dashed to the scene and interrupted the Pink One’s antics. His wife was safe, at least for the moment (see [Hot Pink One-Jyanthan: Plan B](#edge:jyanthan-hot-pink-one-left-2-bottom-2)).\n<br>\n\n\nAfter the interruption, Bijou invited the group to the Amber Coin casino to try their luck. Despite being part of the Guild of Empathy, Bijou was surprisingly enthusiastic about gambling. The Hot Pink One, while losing her coins at the tables, couldn't help but express envy towards Gonathan, wishing for someone special in her life. Gonathan offered her encouragement, assuring her that her special someone would come along [eventually](https://www.youtube.com/live/f8W426vzTb8?si=nwACILNXWJZkRlZU&t=1439).  \n<br>\n\n\nLater, the group regrouped with their queen, Tam Gandr, where Gonathan explained the ongoing lottery scam, ran by FaunaMart, plaguing the kingdom. The mere mention of lotteries immediately piqued the Hot Pink One’s interest, prompting her to dash off under the excuse of [“examining the evidence”](https://www.youtube.com/live/f8W426vzTb8?si=aZFVkqHOS5Ib3_sH&t=2531). It wasn't until her queen’s stern intervention was she finally reeled [back in](https://www.youtube.com/live/f8W426vzTb8?si=nZQemPteok063cLW&t=2750).\n\n<br>\n\nAt the quest board, Elizabeth also appeared, and the Hot Pink One couldn’t forget the indignity of having her gums 'hushed' by the Red One. When Elizabeth challenged Tam to a duel, the Hot Pink One boldly volunteered, determined to reclaim her [dignity](https://www.youtube.com/live/f8W426vzTb8?si=WTxfOOnZS6zsf83c&t=3123). Though ker courage [wavered](https://www.youtube.com/live/f8W426vzTb8?si=5r5vNNmzoIjXRPGu&t=3136) briefly upon seeing Elizabeth’s formidable weapon, she pressed on nonetheless.  \n<br>\n\n[The Hot Pink One fights for her dignity](#embed:https://www.youtube.com/live/f8W426vzTb8?t=3316)\n<br>\n\nIn the duel, the Hot Pink One emerged victorious. Elizabeth’s excuses about a “Ping Ghost” didn’t matter—victory was hers. Empowered by her win, she sought another opponent to satiate her newfound hunger for battle. She turned to Bijou and challenged her guildmate to a [duel](https://www.youtube.com/live/f8W426vzTb8?si=A-sxFCAwk8h7m671&t=3638). Another win followed, leaving Bijou defeated and the Hot Pink One now claiming [double](https://www.youtube.com/live/f8W426vzTb8?si=oNpLE1mN_HFpM6Jf&t=3666) the dignity, whatever that meant.\n<br>\n\n\nThe day’s events continued with the Pink One 'accidentally' killing Bijou’s pet [rock](https://www.youtube.com/live/f8W426vzTb8?si=purywjxey_noU_DD&t=3974), partying at the [tavern](https://www.youtube.com/live/f8W426vzTb8?si=0B4-qaOCsa2OupoT&t=6275), and finally preparing for the **Ocean Temple Dungeon**. \n<br>\n\nAt the dungeon’s entrance, the group discussed how their teams should be split, with the Pink One joining Gonathan, Tam, and Bijou. Meanwhile, Nino Ina mentioned auctioning her hat. Initially uninterested, the Pink One’s demeanor shifted entirely when she learned the hat carried Ina’s scent. Fueled by newfound enthusiasm, she purchased the hat for a steep [600 coins](https://www.youtube.com/live/f8W426vzTb8?si=zn5oNkKqFzUfNvDI&t=7400).\n<br>\n\nInside the Ocean Temple Dungeon, the Hot Pink One surprised everyone, including herself, by excelling at puzzles—a rarity given her usual disposition. She credited her newfound intellect to Ina’s hat, which she now considered a source of luck and inspiration. Her team successfully conquered the dungeon, recovering memories of [Gawr Gura](https://www.youtube.com/live/f8W426vzTb8?si=X8em6vc_K7PpG1Mh&t=9178). \n<br>\n\nFeeling emboldened by her achievements and newfound clarity, the Pink One realized her feelings for Nino Ina and proposed (see [Hot Pink One-Ina: Enertal Consort](#edge:hot-pink-one-nino-ina-right-2-left-2))\n\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/IRyS_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#e10e5b"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "nino-ina",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 1025
          },
          "data": {
            "title": "Nino Ina",
            "content": "Ina re-entered the fantasy world for her second day, the chaos of the first still fresh in her mind. Yet, somehow, the absurdity of her guildmates had already become her new normal. The moment she arrived, she found herself dragged into a [lively tavern](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=364), where familiar tunes blared, and her companions, along with other guild members, danced with reckless abandon. Ina didn’t comment much, though; she had grown accustomed to this bizarre kingdom. \n<br>\n\nSoon after, the Hot Pink One approached her, [inviting her](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=816) to join in the conquest of the **Ocean Temple Dungeon**.\n<br>\n\n\nBefore the dungeon crawl began, Ina decided to hold an auction for her [hat](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=1050). The bidding started with mild interest, but things escalated quickly when Ina casually mentioned that the hat carried her scent. That one detail flipped a switch in the Hot Pink One, who had initially shown no interest but suddenly offered a staggering [600 coins](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=1167). With the auction concluded, Ina assembled her team, which included Nerissa, Calli, and Jyan, and together they tackled the dungeon. \n<br>\n\nThe team emerged victorious, recovering memories of [Gawr Gura](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=3134) along the way.\n<br>\n\n\nAfter leaving the dungeon and taking a moment to mine for materials, Ina was pulled aside by the Hot Pink One. What followed was an unexpected and heartfelt proposal. The pink lady attributed their success to Ina’s hat and confessed that Ina was her one and only. Touched by the gesture, Ina accepted and vowed to be her eternal consort, sealing their unconventional union (see [Hot Pink One-Ina: Eternal Consort](#edge:hot-pink-one-nino-ina-right-2-left-2)).\n<br>\n\n\nIna’s day continued in her signature serene fashion. Unlike most, she avoided the kingdom’s typical madness. She took on quests, explored the land, and engaged in calm conversations—an unusual rarity in a realm dominated by chaos. Even during her interactions with her guildmates, she maintained a steady demeanor, though her wife’s overly [questionable comments](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=4239) often drew a subtle smile.\n<br>\n\n\nThere were some quirky moments amidst her otherwise tranquil day. Ina, in a rare slip, attempted to flirt with Tam, an incident she quickly brushed off as a result of her infamous [\"Oya Oya\" charm](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=6629). She then spent time observing Calli’s \"dad-like\" [tendencies](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=7411), which drew genuine laughter from Ina. She also encountered Nerissa and smugly flaunted her diamond sword. These one-off interactions offered a refreshing change and gave her a chance to better understand the kingdom’s many personalities.\n\n<br>\n\n[Ina showing off her diamond sword](#embed:https://www.youtube.com/embed/z4R10dPeuwY?si=GDfvf9GNu8D0JHOx&amp;start=7120)\n<br>\n\nAs night fell, Ina made an unusual decision: she chose to tackle the Ocean Temple Dungeon solo for a [second time](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=9950). Perhaps she was drawn to the thrill of \"solo leveling,\" relishing the challenge it offered.\n\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/ina.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#4c3f5a"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "king-of-libestal",
          "type": "image",
          "position": {
            "x": 850,
            "y": 75
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "tam-gandr",
          "type": "image",
          "position": {
            "x": 1450,
            "y": 925
          },
          "data": {
            "title": "Tam Gandr",
            "content": "\nThe new (self-proclaimed) **queen of Libestal** awoke for the second day, and it seemed action was the theme of the day. As soon as Tam joined the kingdom, Bijou summoned her for [immediate assistance](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=307) while informing her that Gonathan had been wedded. At the same time, Tam received a secret message from Shakira about an evil force—FaunaMart—scamming people through lottery tickets. Intrigued, the queen wasted no time and hurried to join her guild mates.\n<br>\n\n\nWhen she arrived, the first thing everyone pointed out was her \"Xbox-like\" [voice](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=561). Tam, being self-conscious about it, tried to brush it off but couldn’t help feeling embarrassed. Regardless, there were more pressing matters. Gonathan explained the lottery scam situation, but at the mention of \"lottery\", both Bijou and the Hot Pink One, notorious gambling addicts, dashed to the quest board. Tam's desperate attempts to stop them were futile, and with no other choice, she followed her [reckless guild mates](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=837).\n\n<br>\n\n[The Queen and her gambling-addicted guild mates](#embed:https://www.youtube.com/live/fIGfh8GmKY8?t=816)\n<br>\n\nAt the quest board, Shakira shared more about the scams. Midway during this, Elizabeth appeared, reigniting the rivalry between her and Tam. Liz, unaware of Tam's name, referred to her as \"Tim\", much to Tam's irritation. Insults flew—Tam calling Liz a \"red thing\" and a harlot, sentencing her to death, while Liz retaliated with equal fervor. The heated exchange reached its peak when Liz challenged Tam to a duel ([see Elizabeth-Tam: Some queen, eh?](#edge:elizabeth-rose-bloodflame-tam-gandr-top-3-top-2)) \n<br>\n\n\nAs a queen, Tam declared it beneath her, not because she was afraid, not at all, but she claimed as the Queen, violence was not a suited act. She instead asked a subordinate to step in. The Hot Pink One volunteered, eager to settle her score with Liz. After an intense battle, the pink one emerged victorious, to Tam's delight.  \n<br>\n\n\nTam's day carried on with the usual shenanigans: completing quests, sharing a [sensual moment](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=2332) with Shiori, being called \"queen dum dum\" by [Calli](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=2921), and much more. \n\n<br>\n\n\nEventually, the group prepared for the **Ocean Temple Dungeon**. After clearing its challenges and recovering Gawr Gura’s [memories](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=7458), Tam witnessed another guild mate's marriage. This time, the [Hot Pink One](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=8043). This time, it kinda stung. \n<br>\n\nTam later admitted she had feelings for the pink one, making this yet another reminder of her loneliness. Though accustomed to being alone, the sight of her wedded guild mates left her longing for someone special. Nevertheless, Tam continued her day, she was Queen after all, and queens never cry (see [Tam-Hot Pink One: Unrequited Love](#edge:hot-pink-one-tam-gandr-top-3-left-3)).\n<br>\n\nTam thought that at the very least, she could provide shelter for her followers. Despite her envy, she still treasured them deeply. With this resolve, Tam set out to build the [guild base](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=11310). \n<br>\n\nWith occasional help from Gonathan and Ina, and after overcoming moments of [frustration](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=17819), the foundation slowly began to take shape. She hoped to finish it soon, as her departure for important business loomed closer, she feared that she would not be able to spend more time with her silly friends soon. Tam wished that by the time she left, her guild mates would have a place they could call home.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Ouro-Kronii_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#6879c7"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "gawr-gura",
          "type": "image",
          "position": {
            "x": 250,
            "y": 925
          },
          "data": {
            "title": "Gawr Gura",
            "content": "Gura entered the fantasy world for her second day, her excitement evident as she proudly wore the [long red hat](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=482). This hat was no ordinary accessory; it symbolized intelligence and status, qualities Gura was quick to claim as her own. \n<br>\n\nShe began her day at the quest board, where Fauna, Cecilia, Darwin Roosevelt DiCaprio Jr., and Shakira were deep in discussion about the FaunaMart lottery tickets. Darwin attempted to sell Gura a ticket, but she was already ahead of the game. According to Gura, those who wore the red hat shared a single brain. \n<br>\n\nShe proved her point by revealing that, despite not being present, she already knew about the lottery tickets thanks to a prior conversation between Fauna, who was also donning the red hat, and Darwin. To solidify her claim, she tested Fauna by asking what she was thinking, and Fauna’s correct answer affirmed the power of the red hat.\n<br>\n\n[The Appointed Point's demostration of power](#embed:https://www.youtube.com/live/bOIlLaFiiE4?t=648)\n<br>\n\nThe group then investigated the source of the day’s buzz: the under-construction **FaunaMart** convenience store. Fauna enthusiastically explained her lottery system and how it could benefit the kingdom, though Shakira remained skeptical. Cecilia stepped in, offering the allure of a [“German discount”](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=1123), a mysterious incentive that segued into a side quest where the group attempted to learn [German](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=1210).\n<br>\n\n\nAfter fully mastering German in just 5 minutes, their antics resumed as Fauna forced Gura to buy a lottery ticket, sprinkled with discussions about [\"ice-breaking\" videos](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=1785) and Darwin’s unused [\"kindle\"](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=1937). \n<br>\n\nThey then turned their attention to gacha boxes, with Cecilia determined to win the long red hat and join the exclusive club. Her attempts ended in disappointment, but Darwin, in a twist of fate, won the hat on her first try. This unexpected outcome startled Gura, greatly.\n<br>\n\n[Gura watches as Darwin obtains the red hat](#embed:https://www.youtube.com/live/bOIlLaFiiE4?t=2111)\n<br>\n\n\nShe warned Darwin of the immense responsibility and stress tied to being part of the Appointed Points. Darwin solemnly accepted the role, sealing the pact with a ceremonial touching of tips.\n<br>\n\n\nWith their new (unofficial) member in tow, the group attempted to scam Calli into buying [lottery tickets](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=2658) before bidding Fauna farewell and preparing for the **Ocean Temple Dungeon**.\n<br>\n\n\nAs the conquest began, Gura felt a strange sense of familiarity. The oceanic decor, ~~aircrafts~~ [dolphin statues](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=5735), and subtle hints of lore stirred memories of a life long forgotten. It felt personal, as if this dungeon was somehow tied to her. Determined to uncover the truth, the group pushed forward through puzzles. \n<br>\n\nThe challenges ranged from baby block-like mechanisms (which inexplicably [offended](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=5870) Gura) to intricate switches and a final contraption requiring them to [guide a dummy](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=6604) to its goal. Despite the difficulty, the team persevered, uncovering a hidden treasure: a music disc labeled “Reflect”, or as Gura declared, her [mixtape](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=8434).\n<Br>\n\n\nAnd with the dungeon cleared, the truth was revealed. \n<br>\n\n[Gawr Gura, ~~Thief~~ Princess of Atlantis](#embed:https://www.youtube.com/live/bOIlLaFiiE4?t=8698)\n<br>\n\nGura wasn’t just any adventurer; she was The Gawr Gura, a shark girl who once called this underwater kingdom home. Bored with her life beneath the waves, she had fled to start anew on land. \n<br>\n\nYet, her story of rebellion didn’t inspire admiration as [she had hoped](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=8786). Darwin, expecting royal lineage, was disillusioned to learn Gura was a commoner. Cecilia, anticipating a tragic tale, was taken aback to discover Gura’s departure had plunged the kingdom into chaos after she took away its primary defense, the trident. \n<br>\n\nTheir adventure continued at the tavern, where they celebrated with Gura’s newly acquired [music disc](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=9204), and the day once again closed of with some good ol' bits [gambling](https://www.youtube.com/live/bOIlLaFiiE4?feature=shared&t=9761).\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Gawr-Gura_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 1,
            "bgCardColor": "#5d81c7"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        }
      ],
      "edges": [
        {
          "id": "gonathan-g-jyanthan-top-2-bottom-2",
          "source": "gonathan-g",
          "target": "jyanthan",
          "sourceHandle": "top-2",
          "targetHandle": "bottom-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "relationshipId": "marriage",
            "title": "My Pearl!",
            "content": "An unexpected development unfolded on this day, one that Gonathan could never have anticipated. From the moment he arrived, Gonathan had sworn unwavering loyalty to his Queen, Tam Gandr. His sole purpose as a knight was to serve her, with no distractions to deter him from his path. Naturally, he never imagined he would feel the touch of another's love.\n<br>\n\n\nAfter assisting the other heroes, including Jyonathan, in their perilous journey to the Underworld Dungeon, Gonathan gifted the blonde maiden 10 diamonds as a gesture of gratitude and empathy. To his surprise, Jyonathan responded with a playful question: \"Does this mean we’re married, then?\" Though initially taken aback, the idea of having a close companion by his side was appealing. Hesitant but intrigued, Gonathan agreed.\n\n<br>\n\n[Gonathan proposes with impeccable rizz](#embed:https://www.youtube.com/live/kB2jUKUsxtE?t=2046)\n<br>\n\nTheir union didn’t happen immediately, however. Bijou, in her usual mischief, momentarily derailed the situation. But eventually, Gonathan and Jyonathan became the first married couple of the day. Jyonathan affectionately told Gonathan he could call her his “Pearl,” a term of endearment that left the knight elated.\n<br>\n\n\nHaving a wife for the first time in his life awakened a deeply protective instinct in Gonathan. Throughout the day, he found himself frequently stressed over his beloved’s well-being, particularly whenever someone dared to hit on her. And more often than not, the culprit was the Hot Pink One.\n<br>\n\n\nWhether it was overhearing the Hot Pink One [hitting on](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=3460) his wife, whispering sweet nothings into her ear, or engaging in outright questionable behavior at the casino, Gonathan was always quick to intervene. His dedication even led him to abandon his own tasks, confront situations he normally would have avoided—like entering the Amber Coin Guild's domain—and defy his personal code, all in the name of protecting his Pearl.\n<br>\n\n[Gonathan, face full of tears, rushing to his wife](#embed:https://www.youtube.com/live/kB2jUKUsxtE?t=3980)\n<br>\n\nHis loyalty extended beyond mere physical [protection](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=6395). Gonathan even went as far as rejecting the Queen’s orders when they conflicted with Jyonathan’s desires. During preparations for the Ocean Temple Dungeon, when he was told he would have to separate from his wife, Gonathan objected [furiously](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=10437). Tears streaming down his face, he begged to stay by her side. Despite the others’ insistence, he whispered a heartfelt plea for her to stay safe before they parted.\n\n\n<br>\n\n\nGonathan's love for Jyonathan was undeniable. She had become his second guiding light, a purpose as important as his Queen. He respected her wishes, catered to her requests, and vowed to remain loyal to their bond until the very end.\n<br>\n\nAs for Jyonathan, the depth of her feelings for Gonathan was up for debate. Though she accepted his devotion, her occasional teasing remarks—like suggesting he might be an [overbearing](https://www.youtube.com/live/kB2jUKUsxtE?feature=shared&t=9740) husband—hinted that perhaps her affection wasn’t as intense as his (see [Hot Pink One-Jyonathan: Plan B](#edge:jyan-watson-hot-pink-one-left-2-bottom-2)). Or maybe she simply enjoyed watching her knight squirm.\n\n",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "elizabeth-rose-bloodflame-tam-gandr-top-3-top-2",
          "source": "elizabeth-rose-bloodflame",
          "target": "tam-gandr",
          "sourceHandle": "top-3",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "Some queen, eh?",
            "content": "Carrying on from the first day, the bickering between the maiden in blue and the knight clad in red was only growing fiercer.\n<br>\n\nWhile wandering through the kingdom, Elizabeth caught sight of Tam, and immediately, the so-called Queen caused a scene. She insulted Elizabeth outright, refusing to address the knight by name and instead calling her things like \"red thing\" or \"harlot\" for supposedly harassing her guildmate—the infamous Hot Pink One—the day prior.\n<br>\n\n[Ah, so you are the Tim!](#embed:https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=7039)\n<br>\n\nElizabeth, however, was unfazed. She wanted to set matters straight and challenged Tam to a duel. But Tam, unwilling to get her own hands dirty, declined and instead called upon her subordinate, the Hot Pink One, to fight in her place. Confident in her superior weaponry and skill, Elizabeth saw this as an easy victory. After all, her opponent’s \"special ability\" was just… farting. How hard could it possibly be?\n<br>\n\n[Elizebeth battles the Hot Pink One](#embed:https://www.youtube.com/live/M3cuDNZrIKM?t=7494)\n<br>\n\nAnd yet, to her absolute horror—Elizabeth lost.\n<br>\n\nBlaming the defeat on the \"ping ghost\" (a completely valid excuse in her eyes), she tried to save face, but the humiliation was [unavoidable](https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=7553). Tam wasted no time rubbing salt in the wound, taunting Elizabeth and further souring the knight’s already bitter opinion of the so-called Queen.\n<br>\n\nBut that wasn’t the end of it.\n<br>\n\nLater that day, the two clashed again, and—unsurprisingly—Tam was the instigator once more. What started as a verbal spar quickly escalated when the topic of Shakira was brought into the fray.\n<br>\n\n[You are a mighty phoenix!](#embed:https://www.youtube.com/live/M3cuDNZrIKM?feature=shared&t=7788)\n<br>\n\nElizabeth was appalled at what she saw—Shakira, kneeling before Tam, acting as nothing more than a servant to this self-proclaimed Queen. To Elizabeth, it was disgraceful. She had always seen Shakira as a mighty phoenix, a force to be reckoned with—not someone who should be groveling before this foul-mouthed, ill-mannered woman, spewing toxic waste for words.\n<br>\n\nElizabeth saw nothing in Tam that resembled royalty—no honor, no chivalry, no sense of grace. In her eyes, this woman was not worthy of being a Queen. And as much as she wanted to never deal with Tam again, she hoped others would eventually see the light as well.\n",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria-raora-panthera-bottom-2-top-2",
          "source": "tanakisha-shakaria",
          "target": "raora-panthera",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#c65cff"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "tam-gandr-king-of-libestal-top-3-right-2",
          "source": "tam-gandr",
          "target": "king-of-libestal",
          "sourceHandle": "top-3",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "mococo-abyssguard-elizabeth-rose-bloodflame-left-3-right-2",
          "source": "mococo-abyssguard",
          "target": "elizabeth-rose-bloodflame",
          "sourceHandle": "left-3",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#77e03e"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "gonathan-g-tam-gandr-bottom-2-left-2",
          "source": "gonathan-g",
          "target": "tam-gandr",
          "sourceHandle": "bottom-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#77e03e"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "peasant-da-bae-darwin-roosevelt-dicaprio-jr-bottom-2-top-2",
          "source": "peasant-da-bae",
          "target": "darwin-roosevelt-dicaprio-jr",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#ffd885"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "raora-panthera-tam-gandr-right-2-top-1",
          "source": "raora-panthera",
          "target": "tam-gandr",
          "sourceHandle": "right-2",
          "targetHandle": "top-1",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "Fake Queen",
            "content": "The pink cat was really starting to get on Tam’s nerves. Just the day before, Tam had already endured an exhausting session trying to get Raora to pronounce her name correctly. Yet, here they were again—another day, another mispronunciation, followed by Raora’s laughter. Tam was already drained from a verbal clash with Elizabeth, and Raora coulnd't miss that chance to mess with her temper.\n<br>\n\n[Listen here, Tim Bembers](#embed:https://www.youtube.com/live/qDhyA4-79ko?t=7612)\n<br>\n\nShe wanted to share her thoughts with Tam, especially since she took this whole “queen” business seriously. Raora mockingly pointed out that Tam was a queen without a castle—a jab made even sharper by the fact that Raora herself was in the process of building one. But Tam, visibly unbothered, walked away mid-conversation, leaving Raora to shout after her, calling her a \"koward\" (coward).\n<br>\n\nLater, in what seemed like a change of heart, Raora pulled Tam aside for a more formal discussion. \n<br>\n\n[Raora tells Tam her secret ambitions](#embed:https://www.youtube.com/live/qDhyA4-79ko?feature=shared&t=10315)\n<br>\n\nShe proposed an alliance of sorts, suggesting that the two of them could both be queens—neither true nor fake—and rule the kingdom together. While Tam found the idea amusing, she still believed herself to be the worthier queen of the two. Their conversation was cut short when an eavesdropper interrupted, but Raora assured Tam that they’d continue the discussion later (they didn't).",
            "pathType": "custom",
            "day": 1,
            "offsets": {
              "HL": 0,
              "VL": 18.379173679952537,
              "HC": 0,
              "VR": 0,
              "HR": 0
            }
          },
          "selected": false
        },
        {
          "id": "fuwawa-abyssguard-mococo-abyssguard-right-2-left-2",
          "source": "fuwawa-abyssguard",
          "target": "mococo-abyssguard",
          "sourceHandle": "right-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#709b9e"
          },
          "data": {
            "relationshipId": "related",
            "title": "Same but different",
            "content": "Fuwawa and Mococo not only shared the same guild but also bore an uncanny resemblance to each other. Their striking similarity often led others to question if they were [related](https://www.youtube.com/live/0rhoyO69kAQ?feature=shared&t=2214). Despite the frequent speculation, both Fuwawa and Mococo adamantly denied being related. Yet, their near-constant companionship—spending virtually every waking moment together—only fueled the rumors further.\n<br>\n\n\nAdding to the mystery was the dynamic they shared, which closely resembled that of siblings. Fuwawa often assumed the role of the older, more responsible figure, while Mococo embodied the mischievous little sister, frequently stirring up trouble. This was evident when Fuwawa began expressing concern over Mococo's sudden obsession with purchasing an absurd number of lottery tickets from FaunaMart.\n<br>\n\n[Fuwawa watches as the fuzzy one purchases 68 lottery tickets](#embed:https://www.youtube.com/live/jjCVWFJl-_o?t=964)\n\n\n<br>\n\nWhether or not they were truly related, one thing was undeniable: the bond between them ran deep. Their closeness was both a blessing and a challenge. On one hand, it meant they looked out for one another with unwavering care. On the other hand, it left Fuwawa with her hands full, trying to rein in Mococo’s endless antics.",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "hot-pink-one-nino-ina-right-2-left-2",
          "source": "hot-pink-one",
          "target": "nino-ina",
          "sourceHandle": "right-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "relationshipId": "marriage",
            "title": "Eternal Consort",
            "content": "The Hot Pink One had been battling jealousy all day long. Gonathan’s wife, or as he called her, his Pearl, Jyonathan, was a beautiful blonde maiden—exactly the kind of person the pink lady dreamed of having by her side. Yet, this flower was already firmly planted in her pot. While the Hot Pink One kept whispering wishes under her breath for the bond between Gonathan and Jyonathan to falter, she couldn’t help but yearn for someone to call her own.\n<br>\n\n\nMiraculously, that wish would come true later in the day. \n<br>\n\n\nInside the Ocean Temple Dungeon, the Hot Pink One surprised everyone with her sudden knack for solving puzzles. It was an unexpected display of brilliance for someone usually lost in her chaotic antics. She credited her newfound intelligence and luck entirely to Ina’s hat, which she now considered a talisman of inspiration. Emboldened by this revelation, the pink lady realized her growing feelings for Nino Ina and—without hesitation—proposed.\n<br>\n\n[Will you be my eternal consort?](#embed:https://www.youtube.com/live/f8W426vzTb8?t=9715)\n<br>\n\n\nHuzzah! Ina accepted, declaring herself the Hot Pink One’s “eternal consort.” The pair spent the rest of the day enjoying each other’s company, though it didn’t take long for cracks of skepticism to appear. The Hot Pink One’s odd habit of referring to her beloved as her [“bank account”](https://www.youtube.com/live/z4R10dPeuwY?feature=shared&t=3773) raised eyebrows, with even [Calli](https://www.youtube.com/live/f8W426vzTb8?feature=shared&t=12783) questioning her ability to remain loyal. \n<br>\n\nThe pink lady dismissed all doubts with characteristic flair. To nurture this new bond, she resolved to scale back her antics and wild mingling. \n<br>\n\n[The newlyweds doing newlywedded things together](#embed:https://www.youtube.com/live/z4R10dPeuwY?t=8693)\n<br>\n\nYet, her commitment seemed dubious when considering her earlier remarks about Gonathan’s wife, Jyonathan. The Hot Pink One had often joked that Jyonathan could be her “backup plan” should the marriage falter. While she swore these were harmless jokes, the line between jest and truth had always been blurry with her. Surely, the pink lady wouldn’t stoop so low as to pursue her guildmate’s beloved…right?",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "shiori-nyavella-koseki-bijou-right-2-left-2",
          "source": "shiori-nyavella",
          "target": "koseki-bijou",
          "sourceHandle": "right-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "relationshipId": "marriage",
            "title": "Seeds and Eggs",
            "content": "Bijou and Shiori had always shared peculiar conversations whenever they crossed paths. Their topics ranged from milking to eating shoes, as though the two operated on the same bizarre wavelength. At first, it seemed like harmless, friendly banter, but over time, Bijou found herself drawn to the Oreo lady in a way that felt deeper than just camaraderie. Something about Shiori's unique oddness [resonated](https://www.youtube.com/live/Y2LV1PUQ0S8?feature=shared&t=4011) with her own.\n<br>\n\nInspired by the blossoming relationship between Gonathan and Jyonathan, Bijou mustered the courage to confess her feelings and propose to Shiori.\n<br>\n\n[Rock girl proposes to Oreo lady](#embed:https://www.youtube.com/live/Y2LV1PUQ0S8?t=8385)\n<br>\n\nTheir marriage ceremony was far from traditional. In the middle of an open field, with Stains attacking from all directions and wildlife as their only witnesses, they exchanged their \"eggs\" and \"seeds.\" It was unconventional, chaotic, and perfectly fitting for two individuals whose weirdness seemed to define them.\n<br>\n\nEven the Grim Reaper herself, Calli, was [unsettled](https://www.youtube.com/live/LTIq_0ykLVA?feature=shared&t=8760) by their union, backing away cautiously after their peculiar introduction. But love isn’t about conformity; it’s about finding someone who matches your rhythm, no matter how offbeat it might seem to others.\n\n<br>\nBy the end of the day, love had undeniably bloomed. The two even shared a tender kiss to bid each other goodnight before retiring to their beds.",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "jyanthan-hot-pink-one-left-2-bottom-2",
          "source": "jyanthan",
          "target": "hot-pink-one",
          "sourceHandle": "left-2",
          "targetHandle": "bottom-2",
          "type": "fixed",
          "style": {
            "stroke": "#5f0066"
          },
          "data": {
            "relationshipId": "backup-plan",
            "title": "Plan B",
            "content": "You know you’ve got a jealousy issue when you hit on another person’s spouse not once, not twice, but so many times in a single day that even keeping count feels futile. And that’s exactly what the Hot Pink One did on her second day in this enigmatic journey. \n<br>\n\nUpon learning that Gonathan had tied the knot with Jyonathan, she initially expressed surprise but offered her congratulations nonetheless. However, meeting Jyonathan in person sparked something deeper—and much more mischievous.\n<br>\n\nThe Hot Pink One couldn’t resist engaging in a bit of [“sweet talking”](https://www.youtube.com/live/f8W426vzTb8?feature=shared&t=623) with the cute blonde maiden, often hinting at desires that veered well beyond mere platonic admiration. Though she dismissed her flirtations as harmless jokes, her “lessons” for the newlyweds—focused on topics like divorce and the practicalities of splitting assets—carried an undercurrent of ulterior motives. \n<br>\n\n[Pink lady \"teaching\" the newlyweds about marriage](#embed:https://www.youtube.com/live/f8W426vzTb8?t=1774)\n<br>\n\nIt was clear, at least to those paying attention, that she harbored a not-so-secret hope that such a scenario might unfold, one where she could swoop in and claim the maiden for herself. She even went as far as to offer to pay the [divorce fees](https://www.youtube.com/live/f8W426vzTb8?feature=shared&t=6469) herself, should the situation ever arise.\n<br>\n\nAmusingly, the title of [“backup plan”](https://www.youtube.com/live/f8W426vzTb8?feature=shared&t=3231) wasn’t something the Hot Pink One claimed for herself—it was Jyonathan who coined it, raising more than a few eyebrows. Was Jyonathan truly satisfied with her current husband, or was there a spark of something else buried beneath the surface?\n<br>\n\nBy the end of the day, the Hot Pink One did manage to gain a consort of her own, somewhat easing her yearning for companionship. Yet the fact remained: she still carried the title of Jyonathan’s “backup plan.” Whether this playful flirtation would lead to future drama, or perhaps something even more profound, remains to be seen.\n",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "darwin-roosevelt-dicaprio-jr-ceres-fauna-top-1-left-2",
          "source": "darwin-roosevelt-dicaprio-jr",
          "target": "ceres-fauna",
          "sourceHandle": "top-1",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#79b3c8"
          },
          "data": {
            "relationshipId": "business",
            "title": "Shady Business",
            "content": "Darwin stumbled upon an under-construction FaunaMart, lured by the promise of cookies, treats, and candies—something akin to a family-friendly convenience store. To her dismay, however, she was instead greeted with advertisements for [lotteries and gambling](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=715). The brown maiden couldn't have been more disappointed, while Fauna, in stark contrast, was overjoyed to welcome her first customer.\n<br>\n\nSkeptical of the entire setup, Darwin raised an eyebrow at just about every aspect of Fauna’s operation. Fauna enthusiastically touted the \"big jackpot,\" but conspicuously avoided specifying how big it actually was. She imposed [odd rules](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=855), like banning repeated numbers on the lottery tickets, and even claimed the proceeds would go toward a local library. However, when pressed, the \"library\" Fauna showcased barely had any books at all. \n\n<br>\n\nDarwin made her frustrations clear, documenting everything on her \"vlog\" with the intention of exposing FaunaMart's sketchy practices.\n<br>\n\n[Okay gang, watch me singlehandly take down FaunaMart](#embed:https://www.youtube.com/live/WQRPyJ4zhC0?t=1383)\n<br>\n\nAs the day went on and more adventurers joined the scene, Darwin worked tirelessly to warn them about the shady business. She managed to convince [Shakira](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=2300) to avoid the lottery, but to her dismay, FaunaMart began gathering a growing crowd of supporters. Even as Darwin pointed out the [fine print](https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=2732) on the lottery tickets—text that was so tiny it was clearly meant to deceive—Fauna stood her ground, buoyed by her newfound allies.\n<br>\n\nThough Darwin lost this particular battle, she wasn’t ready to give up. Determined to expose the truth about FaunaMart, she resolved to gather more evidence and take action at some point in the future.\n",
            "pathType": "custom",
            "day": 1,
            "offsets": {
              "HL": 0,
              "VL": 0,
              "HC": 225.53672517347437,
              "VR": -47.54557990143514,
              "HR": 0
            }
          },
          "selected": false
        },
        {
          "id": "shiori-nyavella-nerissa-ravencroft-bottom-2-top-2",
          "source": "shiori-nyavella",
          "target": "nerissa-ravencroft",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "relationshipId": "marriage",
            "title": "Keeping company",
            "content": "Although no formal ceremony took place, Nerissa and Shiori might have been the first to establish what could be considered a married relationship. Technically, it began as a declaration from Nerissa (from day one), which Shiori simply went along with. However, their dynamic felt far more natural and genuine compared to the peculiar and often chaotic marriages that occurred throughout the day.\n<br>\n\n\nDespite their easygoing rapport, their conversations often veered into eyebrow-raising territory. While navigating the Ocean Temple Dungeon alone, Shiori began to feel lonely and decided to call Nerissa for company. One of her first requests? For Nerissa to leave her \"mic\" on during an \"idol meeting.\"\n<br>\n\n[Shiori calls Nerissa during her dungeon conquest](#embed:https://www.youtube.com/live/LTIq_0ykLVA?t=4323)\n<br>\n\nNonetheless, the two kept each other entertained throughout Shiori's dungeon crawl. Nerissa served as a steady emotional anchor while Shiori, struggling with the complex puzzles, teetered on the brink of losing her sanity. Their banter flowed effortlessly, almost as though they had known each other for a long time.",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria-darwin-roosevelt-dicaprio-jr-top-2-right-2",
          "source": "tanakisha-shakaria",
          "target": "darwin-roosevelt-dicaprio-jr",
          "sourceHandle": "top-2",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#ffd885"
          },
          "data": {
            "relationshipId": "alliance",
            "title": "Double Agent",
            "content": "As Shakira was minding her own business, she stumbled upon a sight that she maybe shouldn’t have seen. Her guildmate, Darwin—one of the few she had left—was mingling with another guild.\n<br>\n\n\n[She really left us like that](#embed:https://www.youtube.com/live/qKlzaYirN88?t=2430)\n<br>\n\nWatching from a distance, Shakira saw Darwin among the Scarlet Wand members, donning a red hat and participating in their secretive rituals. A pang of betrayal struck her chest. The Amber Coin guild was already dwindling, especially after Peasant Da Bae’s disappearance, and now it seemed on the verge of losing yet another member. If Darwin had truly defected, that would leave only her and her ever-reliable pink cat. The thought weighed heavily on her heart.\n<br>\n\nLater, however, Darwin approached Shakira in private. In a hushed tone, she revealed the truth—her apparent defection was all part of a larger plan. She had infiltrated the Scarlet Wand as a spy to gather information, and the red hat was merely a disguise. She even went as far as faking a reaction to gain pity from others.\n<br>\n\n[It's all part of a plan](#embed:https://www.youtube.com/live/WQRPyJ4zhC0?feature=shared&t=4747)\n<br>\n\nHearing this, Shakira sighed in relief and decided to let Darwin in on her own secret. As it turned out, she was also playing the role of a double agent, trying to gain the trust of the Cerulean Cup members in order to erase the bad reputation that Amber Coin had mysteriously garnered.\n<br>\n\nSo, when looking at the bigger picture, it turned out that everyone had abandoned their guild for a mission of their own… meaning the only one truly left behind in Amber Coin was Raora.",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        },
        {
          "id": "hot-pink-one-tam-gandr-top-3-left-3",
          "source": "hot-pink-one",
          "target": "tam-gandr",
          "sourceHandle": "top-3",
          "targetHandle": "left-3",
          "type": "fixed",
          "style": {
            "stroke": "#2b65ee"
          },
          "data": {
            "relationshipId": "unrequited-love",
            "title": "Unrequited Love",
            "content": "Tam liking the Pink Thing? That was unexpected. Considering how much of a clutz she saw the Hot Pink One as, the blue maiden never would have imagined herself feeling attracted to such silliness. Yet, after witnessing marriages happening left and right, a thought crept into her mind—Could her chance come as well?\n<br>\n\nBut… she was a step too late.\n<br>\n\n\nTam had hidden her feelings for too long, and before she could act, the pink woman had already fallen into another’s arms. Tam tried to play it off, [jabbing](https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=7998) at the newlyweds with her usual sharp tongue, masking her emotions behind her signature haughtiness. But deep down, the sting of regret lingered.\n<br>\n\n[Our paths were different...](#embed:https://www.youtube.com/live/fIGfh8GmKY8?feature=shared&t=8234)\n<br>\n\nBy the time the dust settled, everyone in the Cerulean Cup had found themselves in matrimony.\n<br>\n\nExcept for Tam.",
            "pathType": "smoothstep",
            "day": 1
          },
          "selected": false
        }
      ]
    },
    {
      "dayRecap": "## Day 3: Getting to building\n\nIf marriages weren’t enough to tangle the kingdom’s relationship chart into a convoluted web, adoption has now entered the mix. \n<br>\n\nDay three proved to be an eventful one for Bijou—first, she was adopted by Elizabath as her daughter, adding yet another layer to her ever-complicated existence. As if that weren’t enough, she also caught her wife in the midst of an affair with another woman, leading to a whirlwind of confusion, confrontation, and attempts at resolution. And amidst all this chaos, Bijou remained steadfast in her pursuit of something truly important: a hat.\n<br>\n\nMeanwhile, the ongoing rivalry between the self-proclaimed queens, Tam Gandr and Raora, continued to escalate—though at this point, it seemed to be more about Raora getting under Tam’s skin for her own amusement. This was also Tam's last day in the kingdom. \n<br>\n\nOn a broader scale, the kingdom saw a shift as more heroes set aside their usual adventuring to focus on something more permanent—building. With foundations being laid and walls rising, new homes and businesses began to take shape. Among them, Shiori constructed a quaint pink abode to call her own, Raora erected a grand castle fitting for her self-proclaimed queenly status, Tam established a guild base for her guildmates, and Bijou with her rocky masterpiece. \n<br>\n\n[Bijou's lucky Moai statue](#image:https://cdn.holoen.fans/hefw/media/moai.png)\n<br>\n\nPerhaps the most notable addition, however, was the grand opening of Mori’s Tavern, fittingly named **Death Do Us Part**. Beyond serving food and drinks to weary travelers, this establishment came with a unique selling point—*divorce services*. With relationships forming (and hopefully crumbling) at an alarming rate, Mori saw an opportunity and seized it, offering an easy way out for those entangled in the kingdom’s ever-expanding web of bonds.\n\n<br>\n\nFinally, returning to the main task of the day—the dungeon challenge. This time, our adventurers were sent into the ominous depths of the [**Eldritch Horror Dungeon**](#out:https://x.com/hololive_En/status/1830787800968638636), a place shrouded in eerie whispers and creeping dread. The challenge? To complete a series of designated tasks within a reasonable timeframe before their sanity levels plummeted beyond salvation. Upon completetion, the heroes were granted the recovered memories of [**Ninomae Ina’nis**](#out:https://www.youtube.com/watch?v=QE5Ow4L1Zt8).\n<br>\n\n[Inside the Eldritch Horror Dungeon](#image:https://cdn.holoen.fans/hefw/media/ina-dungeon.png)\n",
      "title": "",
      "nodes": [
        {
          "id": "fuwawa-abyssguard",
          "type": "image",
          "position": {
            "x": 475,
            "y": 300
          },
          "data": {
            "title": "Fuwawa Abyssguard",
            "content": "The fluffy one began her fourth day with a calm start, engaging in a small [chat](https://www.youtube.com/live/BehFIHehD_Y?feature=shared&t=439) with Nerissa about hats and various topics. True to her nature, Fuwawa's perspective remained serene and, well, fluffy. In stark contrast, her counterpart, the ever-fuzzy Mococo, was rushing by her side to FaunaMart to claim her lottery winnings. Fuwawa was surprised to learn that Mococo had won, but her surprise quickly turned to concern as she watched her not-sister buy 71 more tickets, transforming into a [money-hungry](https://www.youtube.com/live/BehFIHehD_Y?feature=shared&t=508) adventurer.\n<br>\n\n\nFuwawa then visited the newly established diner built by Calli. She had her eyes set on an Ultimate Fruit Milkshake, but lacking the funds, she resolved to work harder and save up to buy one [someday](https://www.youtube.com/live/BehFIHehD_Y?feature=shared&t=639) (unlike a certain someone who had recklessly spent all her savings on lottery tickets).\n<br>\n\nVenturing further, Fuwawa completed quests and crossed paths with Elizabeth, who became her [breadlady](https://www.youtube.com/live/BehFIHehD_Y?feature=shared&t=1194), like, in a literal sense. Finally, it was time to prepare for the **Eldritch Horror Dungeon**. Joining her were Elizabeth, Mococo, Raora, and Calli. Together, they bravely conquered the dungeon and recovered the [memories](https://www.youtube.com/live/BehFIHehD_Y?feature=shared&t=4357) of **Ninomae Ina'nis**.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Fuwawa-Abyssgard_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#67b2ff"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "mococo-abyssguard",
          "type": "image",
          "position": {
            "x": 700,
            "y": 300
          },
          "data": {
            "title": "Mococo Abyssguard",
            "content": "*\"I won... I won!\"* the doggo excitedly whispered to herself as she began her fourth day in the kingdom. The day had only just started, but Mococo's mind was fixated on one thing: winning the lottery. She was ecstatic—the most excited she had been since beginning this journey—so she wasted no time rushing to FaunaMart to claim her prize.\n\n<br>\n\n[Mococo excitedly goes to collect her winnings](#embed:https://www.youtube.com/live/zh0satM3cEs?t=476)\n<br>\n\nUpon arriving at FaunaMart, Fauna herself was surprised that someone had actually won. She congratulated Mococo and handed over her prize money. Mococo had won a total of **710 coins**, which seemed like a lot... until you considered that she had spent 680 coins the day before buying all the tickets. In the end, she made a grand profit of **30 coins**—not much, but what mattered to her was the thrill of winning. \n<br>\n\nNaturally, being the responsible adult she was, she decided to reinvest all her money back into the lottery. She purchased a total of [71 tickets](https://www.youtube.com/live/zh0satM3cEs?feature=shared&t=515), despite warnings from others that this might not be the smartest idea.\n<br>\n\n\nAs she went about her day, she proudly boasted about her win to everyone she met, including Elizabeth and Nerissa. While they congratulated her, their concern grew upon learning that she had spent all her money on lottery tickets [again](https://www.youtube.com/live/zh0satM3cEs?feature=shared&t=1395).\n<br>\n\n\nLater, Mococo joined Raora, Fuwawa, Elizabeth, and Calli to tackle the **Eldritch Horror Dungeon**. True to her easily frightened nature, there were countless moments where she got startled, much like a small puppy encountering something unexpected. Despite her fears, the group succeeded in their mission and recovered the [memories](https://www.youtube.com/live/zh0satM3cEs?feature=shared&t=3965) of **Ninomae Ina'nis**. \n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Mococo-Abyssgard_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#f7a6ca"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "elizabeth-rose-bloodflame",
          "type": "image",
          "position": {
            "x": 475,
            "y": 500
          },
          "data": {
            "title": "Elizabeth Rose Bloodflame",
            "content": "More flashes of memories surfaced as Elizabeth awoke for the day. This time, she recalled her interaction with Shakira the day before.\n<br>\n[Shame](#embed:https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=141)\n<br>\n\nMemories, eh. Upon joining the kingdom, Elizabeth reflected on her journey thus far. \n<br>\n\nThrown into this journey, devoid of memories, she had made new comrades and formed new connections. Over the first two days, she had managed to recover the memories of Mori Calliope and Gawr Gura. Yet, she couldn’t help but wonder: when would she regain her own memories? She felt as though a part of her was missing—something near and dear, or perhaps, someone. \n<br>\n\n[3am thoughts](#embed:https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=612)\n<br>\n\nThis inner thought lingered for a moment, but Elizabeth quickly shook it off, pumping herself up for the fourth day of her adventure.\n<br>\n\n\nElizabeth made her way to the quest board to take on more tasks. There, she was greeted by Nerissa, and to her dismay, she became a complete mess in front of the raven-haired lady. Elizabeth had been feeling \"weird\" whenever she was around Nerissa, but she couldn’t quite figure out what the feeling was (see [Elizabeth-Nerissa: Beautiful Maiden](#edge:elizabeth-rose-bloodflame-nerissa-ravencroft-right-3-left-2)).\n<br>\n\nMoving on, Elizabeth wandered around and met Cecilia and Bijou, who were engrossed in a conversation about various, yet questionable, topics. Liz was left dumbfounded throughout the exchange. To her surprise, Bijou suddenly asked Liz to be her mother. Though confused, Liz accepted. Her bewilderment only deepened when she learned that her newly adopted daughter was already married (see [Elizabeth-Bijou: Impromptu Adoption](#edge:elizabeth-rose-bloodflame-koseki-bijou-bottom-3-top-1))\n<br>\n\nLater in the day, she was invited by Raora to tackle the dungeon of the day: the **Eldritch Horror Dungeon**. Joining them were Calli and the two doggos. During the conquest, while trying to help Mococo, who accidentally found herself stuck in a ditch, Elizabeth clumsily fell and shared the same situation as the fuzzy one. \n\n[Taking the promise too literally](#embed:https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=9220)\n<br>\n\nNonetheless, they managed to free themselves. Together, they conquered the dungeon and successfully recovered the memories of [Ninomae Ina'nis](https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=7815). \n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Elizabeth-Rose-Bloodflame_list_thumb.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#d46759"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false
        },
        {
          "id": "jyanthan",
          "type": "image",
          "position": {
            "x": 700,
            "y": 500
          },
          "data": {
            "day": 1
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 300
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "peasant-da-bae",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 300
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "raora-panthera",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 500
          },
          "data": {
            "title": "Raora Panthera",
            "content": "Raora began her third day with a clear goal of completing her castle. It was more than just a structure—it was a statement of her status as queen, a towering emblem of her dominance. Wasting no time, she set out to gather the materials needed to bring her vision to life.\n<br>\n\n\nAs she worked through her quests for money to buy materials, she encountered various people along the way. She greeted Fauna, taking a moment to buy a [lottery ticket](https://www.youtube.com/live/6VtHPTU1FB8?feature=shared&t=988), then paid a visit to Calli’s newly constructed tavern for a [tour](https://www.youtube.com/live/6VtHPTU1FB8?feature=shared&t=1480). \n<br>\n\nWhile wandering, she stumbled upon Gonathan, or [\"Jordan\"](https://www.youtube.com/live/6VtHPTU1FB8?feature=shared&t=2504), as she liked to call him, her mischievous streak taking hold. Teasing him relentlessly, she manipulated him into kneeling, gaslighting him into believing it was for some grand purpose. Not content with just that, she followed him wherever he went, much to his frustration. Whether or not her antics were productive, one thing was certain—she had firmly gotten on Gonathan’s nerves.\n<br>\n\n[The pink cat stalks](#embed:https://www.youtube.com/live/6VtHPTU1FB8?t=3229)\n<br>\n\nEventually, Raora returned her focus to the larger tasks at hand. Joining forces with Elizabeth, Calli, and the two doggos, she ventured into the dreaded **Eldritch Horror dungeon**. Together, they overcame its many challenges and successfully recovered fragments of Ninomae Ina'nis’ [memories](https://www.youtube.com/live/6VtHPTU1FB8?feature=shared&t=7780).\n<br>\n\n\nWith the dungeon conquered, Raora returned to her primary objective: building her castle. By this point, Tam was working on her own guild base nearby. Never one to pass up an opportunity for mischief, Raora couldn’t resist poking fun at Tam as well (see [Raora-Tam: Annoying Cat](#edge:raora-panthera-tam-gandr-right-2-top-1)).\n<br>\n\nYet, her playful and chaotic nature gave way to a strikingly different side when she immersed herself in construction. Her focus was unmatched—every piece was carefully placed, every detail thoughtfully planned. The meticulous craftsmanship made it clear she took her role seriously, using her dedication as proof of her worthiness for the throne.\n\n<br>\n\n\nLate into the night, Raora continued [building](https://www.youtube.com/live/6VtHPTU1FB8?feature=shared&t=25997). Beside her, the other blue queen worked tirelessly on her own structure. Together, their efforts became a testament to their shared determination, each striving to leave a mark of their reign\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Raora-Panthera_list_thumb.png",
            "teamId": "amber-coin",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#f087a9"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "darwin-roosevelt-dicaprio-jr",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 500
          },
          "data": {
            "day": 1
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "mori-calliope",
          "type": "image",
          "position": {
            "x": 250,
            "y": 400
          },
          "data": {
            "title": "Mori Calliope",
            "content": "Calli was thrilled for day three, not because of any grand adventure or remarkable event, but because her long-awaited tavern was finally complete. Her business, named ***\"Death Do Us Part,\"*** was officially open for business. A diner that not only served delicious food but also offered free divorce services alongside every meal. She was immensely proud and couldn’t wait to see her first customers. \n\n<br>\n\n[Welcome to \"Death Do Us Part\"!](#embed:https://www.youtube.com/live/efqkfe_5O0s?t=368)\n<br>\n\n\nCalli gave a quick tour of the tavern. Painted in shades of green to match her guild, the building was accented with white quartz for a bright and inviting diner-like vibe. The establishment had two floors. The first floor housed the main dining area. Upon entering, customers were greeted by a wall-mounted menu that listed a variety of dishes, including the prized **\"Ultimate Fruit Milkshake\"**. \n<br>\n\nNext to the menu was the divorce board, where all divorces—offered free with a meal—would be recorded on a sign and displayed. The corner of the room held the kitchen, bustling with activity. Upstairs, the second floor was a \"special room\" designed for adventuring pairs or couples to rent for private moments. While the window view was meant to showcase the coliseum across the street, it was unfortunately blocked by the towering [FaunaMart](https://www.youtube.com/live/efqkfe_5O0s?feature=shared&t=753). Still, the promise of excellent eats was what truly mattered.\n<br>\n\n\nExcited, Calli ventured into the kingdom to announce her grand opening. She encountered Gonathan and collected his daily dowry of [500 coins](https://www.youtube.com/live/efqkfe_5O0s?feature=shared&t=2608), then crossed paths with Cecilia, who was desperate to obtain a Scarlet Wand hat. The green maiden saw Calli donning the coveted hat, and so they struck a deal: Cecilia would buy food from the tavern, and play Calli a speical song in exchange for the hat. \n<br>\n\nHowever, Cecilia was flat broke and had made the promise out of desperation. Calli, pitying her, decided to gift her the hat anyway, marking her first unofficial customer.\n<br>\n\n[Calli giving out her hat to a broke Cecilia](#embed:https://www.youtube.com/live/efqkfe_5O0s?t=2917)\n<br>\n\nLater, Fuwawa expressed interest in visiting the diner. Calli enthusiastically showed her around and tried to sell her the Ultimate Fruit Milkshake, but, like Cecilia, Fuwawa had [no money](https://www.youtube.com/live/efqkfe_5O0s?feature=shared&t=3995). Disheartened, Calli had no choice but to kick her out. It seemed the kingdom’s citizens were not as financially stable as she had hoped.\n<br>\n\n\nDespite the setbacks, Calli prepared for the main event of the day: tackling the **Eldritch Horror Dungeon**. Her new kitchen allowed her to cook meals for herself and her teammates. Joining her on the quest were Fuwawa, Mococo, Raora, and Elizabeth. Together, they successfully conquered the dungeon and recovered the memories of [Ninomae Ina’nis](https://www.youtube.com/live/efqkfe_5O0s?feature=shared&t=7707).  \n<br>\n\n\nOn her way back to the tavern, Calli ran into Tam Gandr. Calli eagerly invited her to dine at the tavern, and to her delight, Tam agreed, bringing along Gonathan, Bijou, and Shiori as additional customers. Calli was ecstatic—this was her chance to finally make some profit! Tam, as the self-proclaimed queen, surely had plenty of wealth to cover the meals. \n<br>\n\nEveryone placed their orders, and Tam volunteered (or was forced) to pay. However, after Calli prepared and served the food, she discovered that Tam was even more broke than her previous customers. Reluctantly, and not wanting to embarrass the queen in front of her followers, Calli gave the food in what she considered an unfair trade. \n<br>\n\n[Blud is broke](#embed:https://www.youtube.com/live/efqkfe_5O0s?feature=shared&t=10791)\n<br>\n\n\nBy the end of the day, Calli realized her business had made zero profit—worse, she had gone into the negatives. Nevertheless, she remained optimistic. While the food might not have been the highlight of her tavern, the divorces surely would be, and she was confident her unique service would gain traction soon enough.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/calli.png",
            "teamId": "jade-sword",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#c90d40"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "ceres-fauna",
          "type": "image",
          "position": {
            "x": 475,
            "y": 800
          },
          "data": {
            "title": "Ceres Fauna",
            "content": "FaunaMart was already under fire—despite being open for just one day, rumors swirled accusing the business of being a scam. Fauna couldn’t pinpoint the origin of these claims, but one thing was clear: she needed to save her company’s reputation. Thus, the green **CEO** devised a bold PR campaign to turn things [around](https://www.youtube.com/watch?v=menSag1VKTc&t=178s).\n<br>\n\n\nHer plan was straightforward yet effective: she would boost the jackpot prize with her own funds, start selling hats and other sought-after items, and recruit her Scarlet Wand guildmates to help manage sales in her absence. Fauna assured everyone that her lottery wasn’t gambling—because, according to her, it didn’t count, or if it did, it was the only form of that should be [endorsed](https://www.youtube.com/watch?v=menSag1VKTc&t=571s).\n\n<br>\n\n\nFauna’s first order of business was to gather materials. Along the way, she quickly conquered the **Ocean Temple** [dungeon](https://www.youtube.com/live/menSag1VKTc?feature=shared&t=5846), which she hadn’t had the chance to tackle the previous day. With plenty of resources in hand, Fauna returned to her shop, setting prices just exorbitant enough to not discourage sales and still make her plenty of profit.\n<br>\n\n\nLater, it was time to announce the day’s lottery winner. The winning number was 734, and much to Fauna’s shock, Mococo won the jackpot of 707 coins—unsurprising, given the doggo had purchased 68 tickets.\n\n<br>\n\n[The first lottery drawing](#embed:https://www.youtube.com/live/menSag1VKTc?t=7156)\n<br>\n\nThe rumors about FaunaMart’s legitimacy persisted, however. Gonathan confronted Fauna, asking if her business was indeed a [scam](https://www.youtube.com/live/menSag1VKTc?feature=shared&t=9225). With her smooth-talking charm, Fauna reassured him of her noble intentions to serve the community. Whether genuine or not, her words [worked](https://www.youtube.com/watch?v=menSag1VKTc&t=9680s). Gonathan bought 130 tickets—30 of which were for Nerissa. The customers kept rolling in, with Bijou purchasing 10 tickets and even her former accuser, Raora, begrudgingly buying one as well.\n\n<br>\n\n\nAs business boomed, Nerissa approached Fauna to share an alarming discovery: a \"glitch\" that allowed infinite money generation. While Nerissa’s intentions were pure, Fauna saw the devastating impact this could have on her business. Without hesitation, she reported it to the Gods, who patched it immediately.\n\n<br>\n\n[Fauna worries about Nerissa breaking the economy](#embed:https://www.youtube.com/live/menSag1VKTc?t=12540)\n<br>\n\nTrue to her expansion goals, Fauna focused on selling high-demand goods. When she found Bijou struggling to acquire Stain Bones for a quest, Fauna seized the opportunity to [advertise](https://www.youtube.com/watch?v=menSag1VKTc&t=13038s) her wares. Relentlessly, she pitched her products until the rock maiden caved and made a [purchase](https://www.youtube.com/watch?v=menSag1VKTc&t=14030s).\n<br>\n\n\nDespite her entrepreneurial ambitions, Fauna still had duties to fulfill. She joined Nerissa and Cecilia to take on the **Eldritch Horror dungeon**. Together, they triumphed, recovering fragments of **Ninomae Ina'nis’** [memories](https://www.youtube.com/watch?v=menSag1VKTc&t=17971s).\n\n<br>\n\n\nReturning to her store, Fauna was greeted by Mococo, who came to collect her lottery winnings—only to spend it all immediately on 71 more [tickets](https://www.youtube.com/watch?v=menSag1VKTc&t=14536s). Business was booming like never before. From lottery sales to rare goods and even her healing services, the capitalist queen in green had solidified her path to wealth.\n<br>\n| Name      | Tickets Bought | Coins Spent |\n|-----------|---------------|-------------|\n| Gonathon  | 160           | 1600        |\n| Nerissa   | 30            | 300         |\n| Bijou     | 10            | 100         |\n| Raora     | 1             | 10          |\n| Calli     | 1             | 10          |\n| Mococo    | 71            | 710         |\n| Cecilia   | 3             | 30          |\n\n<br>\n\nGave away 54 for free, total coins earned: **2220**",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Ceres-Fauna_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#b4e4c7"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "shiori-nyavella",
          "type": "image",
          "position": {
            "x": 700,
            "y": 800
          },
          "data": {
            "title": "Shiori Nyavella",
            "content": "Shiori began her fourth day with a greeting from Bijou, her so-called wife. Not really sure if it's usual to say \"Hello there, my other wife\" to your beloved when you greet them, but the statement by Shiori left Bijou visibly puzzled, and it set the tone for the day—a mix of confusion and drama (see [Shiori-Bijou: Soap Opera](#edge:shiori-nyavella-koseki-bijou-right-2-left-2)).\n<br>\n\n\nLater, Shiori ran into Nerissa, her alleged bird wife. Nerissa invited Shiori to assist her with the second dungeon, a task Nerissa had been unable to complete previously. Shiori declined the invitation outright, leaving Nerissa disappointed. To twist the knife, Shiori made a snarky comment about Nerissa’s hat before sending her on her [way](https://www.youtube.com/live/BnpLALzUzD4?feature=shared&t=454).\n\n<br>\n\n\nThe refusals didn’t end there. Cecilia later invited Shiori to join her in tackling the Eldritch Horror dungeon. Once again, Shiori declined, citing plans with her wife (her rock wife, to be more specific).\n<br>\n\n[Hoes before bros](#embed:https://www.youtube.com/live/BnpLALzUzD4?t=736)\n<br>\n\nDespite her intentions to keep a low profile, Shiori couldn’t escape relationship drama. During one of her quests, a conversation with Cecilia about her multi-marriage situation was overheard by Bijou. Misunderstanding the context, Bijou was heartbroken and fled in [tears](https://www.youtube.com/live/BnpLALzUzD4?feature=shared&t=2189). Fortunately, the misunderstanding was somehow resolved—though the details were as inexplicable as the situation [itself](https://www.youtube.com/live/BnpLALzUzD4?feature=shared&t=2457).\n\n<br>\n\n\nAfter navigating the day’s chaos, Shiori finally found some time to focus on herself. She completed her quests, gathered funds, and continued building her humble abode. She also took a break to visit the \"Death Do Us Part\" tavern for a [meal](https://www.youtube.com/live/BnpLALzUzD4?feature=shared&t=6718).\n<br>\n\n\nAs the day drew to a close, Shiori teamed up with Bijou, Gonathan, and Tam Gandr to conquer the **Eldritch Horror dungeon**. Together, they successfully recovered fragments of **Ninomae Ina'nis’** [memories](https://www.youtube.com/live/BnpLALzUzD4?feature=shared&t=8370).\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Shiori-Novella_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#b8a0cd"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "cecilia-immergreen",
          "type": "image",
          "position": {
            "x": 475,
            "y": 1025
          },
          "data": {
            "title": "Cecilia Immergreen",
            "content": "Cecilia woke up on her third day feeling dizzy, as if she had hit her head. Her memories were hazy—something felt missing. Did something happen the day before? She couldn’t say for sure. \n<br>\n\nTo make things stranger, she discovered a piece of paper tucked inside her shoe. Written in elegant green cursive were the words: \"find it...!\" How did it get there? Who wrote it? And what did it mean? Confused but intrigued, Cecilia resolved to uncover the mystery.  \n<br>\n\n[Cecilia finds a message left in her shoe](#embed:https://www.youtube.com/live/-QKg8Fau9GM?t=370)\n<br>\n\nHowever, before she could dive into this enigma, the usual chaos of her daily adventures unfolded.\n<br>\n\n\nAt the start of the day, she ran into Bijou. The two shared their Revelations and somehow ended up having a bizarre conversation about detaching and reattaching Cecilia’s [limbs](https://www.youtube.com/live/-QKg8Fau9GM?feature=shared&t=1764). Cecilia, casually claiming she was an automaton—a living doll—assured Bijou it was perfectly normal. The encounter didn’t stop there. Cecilia found herself unofficially officiating Bijou’s adoption as Elizabeth’s daughter, claiming she was a certified [contractor](https://www.youtube.com/live/-QKg8Fau9GM?feature=shared&t=1910).\n<br>\n\n\nLater, at the quest board, Cecilia encountered Calli wearing the Scarlet Wand hat she had been coveting for days. Overcome with desire, she begged to trade for it. They struck a deal: Cecilia could have the hat if she purchased food from Calli’s tavern. But being broke, Cecilia had to scrounge together whatever useless trinkets she had to barter with. Somehow, it [worked](https://www.youtube.com/live/-QKg8Fau9GM?feature=shared&t=3020). \n<br>\n\nAlong with the trade, Cecilia sang a song as part of her \"payment,\" earning the hat she’d been dreaming of. Elated, she paraded it around to show off her prize to anyone willing to look.\n<br>\n\n[Cecilia excitedly shows her hat off to Fauna](#embed:https://www.youtube.com/embed/-QKg8Fau9GM?si=7nMEbH-xj6IwR06k&amp;start=3350)\n<br>\n\n\nContinuing her day, Cecilia bumped into Gonathan. Their conversation spiraled into her spouting wild conspiracy theories about the kingdom and its citizens. Gonathan listened with a mix of confusion and disbelief, silently wondering if she was entirely sane.\n<br>\n\n[What is she yapping about](#embed:https://www.youtube.com/live/-QKg8Fau9GM?feature=shared&t=3869)\n<br>\n\nAmused or perhaps out of pity, he offered her 500 coins and declared her an honorary member of the Cerulean Cup.\n<br>\n\n\nDuring one of her quests, Cecilia found herself caught in the middle of a scandal. She had run into Shiori, only to discover she was embroiled in a marriage drama with Bijou. Cecilia couldn’t resist watching the chaos unfold, as Bijou caught Shiori red-handed in a compromising situation. Cecilia was left [marveling](https://www.youtube.com/live/-QKg8Fau9GM?feature=shared&t=5886) at the drama, entertained by the tension between the wedded pair.\n<br>\n\nEventually, it was time for Cecilia to face the **Eldritch Horror Dungeon**. Joining her on this journey were Nerissa and Fauna. Together, they navigated the dungeon’s dark corridors, defeating its challenges and recovering fragments of Ninomae Ina'nis’ [memories](https://www.youtube.com/live/-QKg8Fau9GM?feature=shared&t=7361).\n<br>\n\n\nAs with her previous days, Cecilia chose to wind down with some gambling. The day’s events had completely distracted her from the mysterious note she found that morning. But as she started to lose money again—her usual outcome—something strange happened. Red, ominous text flashed in her mind, reading:\n\"Come find me.\"\n\"You mustn’t forget.\"\n\n<br>\n\n[Cryptic messages appear as Cecilia is gambling](#embed:https://www.youtube.com/live/-QKg8Fau9GM?t=8195)\n<br>\n\nAt first, Cecilia brushed it off, too engrossed in her gambling to give it much thought. But after emptying her pockets once again, the urgency of the messages finally sunk in. She began asking others if they had experienced anything similar. With the strange paper in the morning and now these eerie messages, it was clear something—or someone—was calling to her.\n<br>\n\nBefore she could investigate further, the key on her head abruptly stopped spinning. Her vision darkened, and the world around her faded into black.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Cecilia-Immergreen_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#119a5c"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "nerissa-ravencroft",
          "type": "image",
          "position": {
            "x": 700,
            "y": 1025
          },
          "data": {
            "title": "Nerissa Ravencroft",
            "content": "Day three marked a turning point for Nerissa, as she discovered a new passion: the relentless pursuit of wealth. Unlike Fauna, who needed money to fuel her thriving business, or Gonathan, who used it to help others, Nerissa's goal was simple—she just liked being rich.\n\n<br>\n\n\nHer day began with a brief chat with Fauna, during which Nerissa declared her mission to amass as much money as [possible](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=313). Wasting no time, she dived into quests to build her fortune. It was during these quests that she stumbled upon a game-changing revelation: a \"glitch\" in the kingdom's system that allowed her to infinitely exploit a particular quest for its rewards.\n\n<br>\n\n[Nerissa discovered a glitch in the system](#embed:https://www.youtube.com/live/LH_8d-8gZow?t=5125)\n<br>\n\n\nFor over thirty minutes, Nerissa abused this loophole, amassing thousands of coins in record time. The sheer speed and scale of her earnings left her feeling invincible. She shared her discovery only with those she trusted—namely, Bijou and Fauna—and explicitly warned the voices in her head to keep the glitch [a secret](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=5386). \n\n<br>\n\nUnfortunately for Nerissa, the voices [betrayed](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=7603) her. Word of the glitch spread quickly, prompting the kingdom’s gods to patch it. But not before Nerissa secured over 5,000 coins, cementing her status as one of the kingdom’s wealthiest individuals.\n<br>\n\n\nThe rest of her day was less financially groundbreaking but still eventful. After [failing](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=7986) to recruit Shiori to accompany her to the second dungeon and inadvertently stirring up relationship [drama](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=9661) between Shiori and Bijou (see [Bijou-Shiori: Soap Opera](#edge:shiori-nyavella-koseki-bijou-right-2-left-2)), Nerissa joined Fauna and Cecilia for the **Eldritch Horror Dungeon**. The team emerged victorious, recovering fragments of **Ninomae Ina'nis’** [memories](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=11348).\n<br>\n\nAfter some lighthearted banter with Bijou, who was making fun of the bird woman's [fake chest](https://www.youtube.com/live/LH_8d-8gZow?feature=shared&t=12326), Nerissa decided to end her day on a high note, satisfied with her newfound riches and ready for whatever the next day might bring.",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Nerissa-Ravencroft_list_thumb.png",
            "teamId": "scarlet-wand",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#2233fb"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "koseki-bijou",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 800
          },
          "data": {
            "title": "Koseki Bijou",
            "content": "Bijou's objective for the third day was simple: make lots of money. But unlike Gonathan, who was making money to pay his dowry, help the community and his queen, or Nerissa who was supporting her guildmate with their business, Bijou's goal for riches was much grander. It was for... **a hat**. \n<br>\n\nShe had been yearning for one ever since she stepped foot in this kingdom. Every day up until now, she had lived in shame, watching others with their long red hats, blue square hats, and green L-shaped hats, while she possessed no hat of her own. This was going to change today. But, of course, like always, there were plenty of shenanigans along the way.\n<br>\n\n[Bijou resenting Nerissa for her hat](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=141)\n<br>\n\nAt the start of her day, Bijou decided to check out FaunaMart. She was surprised to learn that, despite hearing rumors about the business being a scam, someone had actually won the lottery—and it was Mococo, no less. Hearing about the massive prize pool, Bijou wasted no time buying some tickets of [her own](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=616). \n<br>\n\n\nKnowing that Bijou needed *Stain Bones* for her quest, Fauna advertised that she was selling them—though at very high prices. Bijou declined, confident she could get them herself. \n<br>\n\nHowever, while struggling to slay the Stains for the bones, Bijou received an [ad call](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=2340) from Fauna, reminding her that she could purchase the bones at her store instead. She continued struggling and received yet another [ad call](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=2565). Eventually, having great difficulty acquiring the bones on her own, she yielded and returned to FaunaMart to [buy them](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=3325).\n<br>\n\nContinuing her day, Bijou noticed that her wife, Shiori, was awake and went to greet her. However, during their conversation, she couldn’t help but notice Shiori referring to her as *\"my other wife\"*, hinting at a relationship with another woman (see [Bijou-Shiori: Soap Opera](#edge:shiori-nyavella-koseki-bijou-right-2-left-2)).\n<br>\n\n\nAfter this, they turned their attention to one of the primary tasks for the day: tackling the **Eldritch Horror Dungeon**. Joining Bijou were Shiori, Tam, and Gonathan. Together, they conquered the dungeon and recovered [memories](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=12019) of **Ninomae Ina'nis**.\n<br>\n\n\nWith all the \"unimportant stuff\" out of the way, it was finally time for Bijou to focus on her ultimate goal: getting her much coveted a hat. \n<br>\n\nDesperate for this hat, she spent every last coin trying to obtain it. She completed quests to earn money, but failed to get a hat. She gambled for more money, but failed to get a hat. She asked others for money but still failed. Even when she found an exploit to earn a ridiculous amount of money, it didn’t work out. As others were getting hats left and right, Bijou could only hold in her jealousy for so long.\n<br>\n\n[Bijou malds at others' hats](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=9316)\n<br>\n\nFailure after failure, Bijou was starting to lose hope. Perhaps it wasn’t meant to be, for her to don a hat of her own. \n<br>\n\nBut just when despair was setting in, it finally happened. After many, many gacha pulls, she finally got a hat. And it wasn’t just any hat—it was a hat in the shape of a Stain, which she thought was very cool. It only took her **forty-two** tries and cost her **12,600 coins**. Not exactly the most efficient way to spend money, but it was worth it nonetheless.\n<br>\n\n[Bijou finally obtains a hat, a *Stain Hat*](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=22515)\n<br>\n\nBijou could now go to sleep happily, donning the hat she had yearned for so long. At last, her journey could truly s̴̶͙͙̺̜̪͔ͬ̒̍̒̌̄̍ͪͣ̀͞͡_͍̯̗̩̦͚̹͕̗̓̔ͥ͌̍͒͛ͪ͑́͜͞p̨͈̻͎̻͚̹͕̬̮̰͓̮͂͂̓͆ͮ̿̿͋̓ͤ̉̀̽̒̇ͬͦ̋͟͝a̸̔̂̚͜͟ŗ̷̠͉̱͕̠̩̟̖͇̗̤̬͕ͩ͛̒͗̈ͦ̀͗͜͝͡k͈͉_̸̤̤̰̟͖̬͕͙̜͉ͭ̈̀ͤ́̍̆ͦ̌̋̉͢͝l̴̵̵̢̧̛̛̰̥͕͓̟͚̩̰̮̑ͭ́ͣ̐̐̿̽̐̐́̈̊́ͥͦ͐̕͞e̛̬̗̒̑̒̓.\n",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Koseki-Bijou_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#6e5bf4"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "gonathan-g",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 800
          },
          "data": {
            "title": "Gonathan G",
            "content": "Gonathan's third day's objective was simple: make lots of money. The reason was twofold: first, he needed to pay Calli 500 coins a day as promised on day two, when Calli demanded a daily dowry for Gonathan to maintain his marriage to Jyan Watson. Second, he wanted to purchase as much building material as possible for his queen, Tam Gandr, to assist her in constructing the Cerulean Cup guild base. \n<br>\n\nThough his goal was as clear as day, the journey was anything but smooth.\n<br>\nAt the very start of his day, Gonathan found himself ambushed—not by monsters, but by Raora. The mischievous big pink cat wasted no time [teasing](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=1395) him relentlessly. Knowing that Gonathan's unwavering loyalty was to Tam, Raora used her charms and beauty to exploit his one weakness. \n<br>\n\nYet, her antics didn’t stop there. Throughout the day, she seemed to [stalk](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=2165) him, appearing around every corner, much to Gonathan's growing frustration. To vent it out, she hit Elizabeth with his horse.\n<br>\n\n[Gonathan hitting Elizabeth with his horse](#embed:https://www.youtube.com/live/6exWVCmzA9I?t=1799)\n<br>\n\n\nDespite being distracted by the ever-persistent Raora, Gonathan stayed focused on his objective. He worked diligently and effectively, earning more money than he had anticipated. Being the humble and loyal knight that he was, he didn’t hoard his wealth but instead used it to help others. \n<br>\n\nWhen his guildmate Bijou ran out of money after spending everything trying to obtain a hat, Gonathan gave her a portion of his [earnings](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=1567). He also offered Cecilia some coin—not to aid her in any noble endeavor, but simply to stop her from incessantly pestering him about her latest conspiracy theory involving the [king](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=2891). Even FaunaMart benefited from his [generosity](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=3346), as he donated a substantial amount toward their library-building project, though it wasn't entirely sure the library was a legitimate venture.\n<br>\n\n\nLater, Gonathan was invited by Calli to visit her newly opened **diner**, which boasted a unique menu of diverse meals paired with free divorce services. Coincidentally, he crossed paths with his queen, Tam, at the diner. Eager to report his progress, Gonathan proudly told her about all the building materials he had been gathering for her. Tam, surprised and overjoyed, rewarded everyone by treating them to a meal using her [“eight thousand coins”](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=9637) that she claimed to possess. Nevertheless, the gesture was appreciated by all.\n\n<br>\n\n\nAfter a fulfilling meal, Gonathan moved on to the next major task of the day: conquering the **Eldritch Horror Dungeon**. His party included Tam, Shiori, and Bijou. While his bravery and energy were well-known in the kingdom, his fear of horror was a closely guarded secret. \n<br>\nHowever, in the dark and eerie depths of the dungeon, that fear was [laid bare](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=10587). He flinched at sudden noises, froze when left alone in the dark, and struggled to keep his composure throughout the journey. It was a stark contrast to his usual persona, but despite his trepidation, Gonathan pressed on.\n<br>\n\n\nThrough teamwork and perseverance, the group emerged victorious, recovering the [memories](https://www.youtube.com/live/6exWVCmzA9I?feature=shared&t=10803) of **Ninomae Ina’nis**. With their mission complete, Gonathan returned to the kingdom to assist Tam in building the guild base. He poured the remainder of his energy into the task, dedicating himself entirely to helping her realize her vision (see [Gonathan-Tam: Knight and Queen](#edge:gonathan-g-tam-gandr-bottom-2-left-2)).",
            "imageSrc": "https://cdn.holoen.fans/hefw/media/Gigi-Murin_list_thumb.png",
            "teamId": "cerulean-cup",
            "status": "Alive",
            "day": 2,
            "bgCardColor": "#fdb440"
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "hot-pink-one",
          "type": "image",
          "position": {
            "x": 1000,
            "y": 1025
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "nino-ina",
          "type": "image",
          "position": {
            "x": 1225,
            "y": 1025
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "king-of-libestal",
          "type": "image",
          "position": {
            "x": 850,
            "y": 75
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "tam-gandr",
          "type": "image",
          "position": {
            "x": 1450,
            "y": 925
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        },
        {
          "id": "gawr-gura",
          "type": "image",
          "position": {
            "x": 250,
            "y": 925
          },
          "data": {
            "day": 0
          },
          "measured": {
            "width": 100,
            "height": 100
          },
          "selected": false,
          "dragging": false
        }
      ],
      "edges": [
        {
          "id": "gonathan-g-jyanthan-top-2-bottom-2",
          "source": "gonathan-g",
          "target": "jyanthan",
          "sourceHandle": "top-2",
          "targetHandle": "bottom-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "elizabeth-rose-bloodflame-tam-gandr-top-3-top-2",
          "source": "elizabeth-rose-bloodflame",
          "target": "tam-gandr",
          "sourceHandle": "top-3",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria-raora-panthera-bottom-2-top-2",
          "source": "tanakisha-shakaria",
          "target": "raora-panthera",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#c65cff"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "tam-gandr-king-of-libestal-top-3-right-2",
          "source": "tam-gandr",
          "target": "king-of-libestal",
          "sourceHandle": "top-3",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "mococo-abyssguard-elizabeth-rose-bloodflame-left-3-right-2",
          "source": "mococo-abyssguard",
          "target": "elizabeth-rose-bloodflame",
          "sourceHandle": "left-3",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#77e03e"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "gonathan-g-tam-gandr-bottom-2-left-2",
          "source": "gonathan-g",
          "target": "tam-gandr",
          "sourceHandle": "bottom-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#77e03e"
          },
          "data": {
            "relationshipId": "protector",
            "title": "Knight and Queen",
            "content": "Out of all the so-called \"followers\" Queen Tam Gandr had gathered, Gonathan was probably the most normal and level-headed of them all—and, surprisingly, one of the few who was actually loyal to her. He diligently reported on matters in the kingdom, had her back whenever she was puzzled or in need of assistance, and remained composed even when the rest of their guildmates were far less [cooperative](https://www.youtube.com/live/JcRcTRedS_8?feature=shared&t=6523).\n<br>\n\nBut more than just her reliable right-hand man, Tam found that her relationship with Gonathan was solid. She could trust him. Sure, he had his silly moments, but he had never turned his back on her. Whenever she called, he would appear immediately—like the time when Raora was annoying her again, and without hesitation, Gonathan stepped in to [shield](https://www.youtube.com/live/JcRcTRedS_8?feature=shared&t=6151) his Queen from the pink cat’s antics.\n<br>\n\nAnd despite the many ways he could have looked down on her—being richer, knowing more about the kingdom, and generally having more while Tam had less—Gonathan never once overstepped his bounds. He knew his place and stayed loyal through everything.\n<br>\n\nA knight for his Queen, through and through. And Tam? She appreciated it.\n<br>\n\n[Anything for the Queen](#embed:https://www.youtube.com/live/JcRcTRedS_8?feature=shared&t=7876)",
            "pathType": "smoothstep",
            "day": 2
          },
          "selected": false
        },
        {
          "id": "peasant-da-bae-darwin-roosevelt-dicaprio-jr-bottom-2-top-2",
          "source": "peasant-da-bae",
          "target": "darwin-roosevelt-dicaprio-jr",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#ffd885"
          },
          "data": {
            "day": 0
          },
          "selected": false
        },
        {
          "id": "raora-panthera-tam-gandr-right-2-top-1",
          "source": "raora-panthera",
          "target": "tam-gandr",
          "sourceHandle": "right-2",
          "targetHandle": "top-1",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "Annoying Cat",
            "content": "Tam had never messed with Raora—ever. In fact, if she had it her way, she wouldn’t have anything to do with the sassy pink cat at all. She just wanted to go about her business in peace.\n<br>\nBut Raora? Oh, she had other plans. For her, it wasn’t just about annoying Tam (though that was a nice bonus). No, it was about sending a message—a declaration of war. A reminder that she, and not Tam, was the true Queen of the kingdom.\n<br>\nSo when Raora caught wind that Tam was building a base of her own, she wasted no time in doing what she did best—getting all up in the blue lady’s business and annoying the absolute heck out of her.\n<br>\n\n[Pink cat pestering blue woman](#embed:https://www.youtube.com/live/6VtHPTU1FB8?feature=shared&t=15032)\n\n",
            "pathType": "custom",
            "day": 2,
            "offsets": {
              "HL": 0,
              "VL": 18.379173679952537,
              "HC": 0,
              "VR": 0,
              "HR": 0
            }
          },
          "selected": false
        },
        {
          "id": "fuwawa-abyssguard-mococo-abyssguard-right-2-left-2",
          "source": "fuwawa-abyssguard",
          "target": "mococo-abyssguard",
          "sourceHandle": "right-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#709b9e"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "hot-pink-one-nino-ina-right-2-left-2",
          "source": "hot-pink-one",
          "target": "nino-ina",
          "sourceHandle": "right-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "shiori-nyavella-koseki-bijou-right-2-left-2",
          "source": "shiori-nyavella",
          "target": "koseki-bijou",
          "sourceHandle": "right-2",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "relationshipId": "marriage",
            "title": "Soap Opera",
            "content": "[\"Hello, my other wife.\"](https://www.youtube.com/live/BnpLALzUzD4?feature=shared&t=237)\n<br>\n\nThose were Shiori’s unexpected words in response to Bijou’s bright and cheerful morning greeting. The smile on the gem maiden’s face faded instantly, replaced by confusion and a pang of hurt. Bijou immediately pressed Shiori for answers—who was this \"other wife\"?\n<br>\n\nIt turned out to be Nerissa Ravencroft, someone Bijou wasn’t particularly fond of. Sure, there was the stark contrast between Bijou’s petite figure and Nerissa’s elegant hourglass form, but more importantly, Shiori was her wife, not Nerissa’s. Still, Bijou reassured herself: Nerissa hadn’t participated in the same quirky ceremony that she and Shiori had. That made their bond unique, special, and above all, official—right?\n<br>\n\nThe day started off smoothly despite the awkward morning. Bijou and Shiori went on their usual adventures, gathering materials, completing quests, and enjoying the idyllic life of a married couple. But their happiness was short-lived.\n<br>\n\nWhile wandering through the kingdom later that day, Bijou accidentally overheard a conversation between Shiori, Cecilia, and Nerissa. What she heard struck her to the core.\n<br>\n\n[She betrayed me!](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=5811)\n\n\n<br>\n\nShiori had casually mentioned that she wasn’t sure if she and Bijou were truly married. The words stung—Bijou had thought their bond was unshakable, an unbreakable vow of love. But Shiori, being Shiori, had simply been speaking without a second thought, not realizing the weight of her words.\n<br>\n\n\n\nHeartbroken and conflicted, Bijou later confronted Shiori to clear up the [misunderstanding](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=6015). A small crowd of bystanders and guildmates gathered, witnessing the tense but sincere discussion. Somehow, things worked themselves out—though exactly how, no one could really say. \n<br>\n\nThe situation grew even more chaotic when Gonathan arrived, acting as Nerissa’s unexpected messenger. \n<br>\n\n[What's even happening anymore](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=6281)\n<br>\n\n\nNerissa, he explained, was deeply saddened and jealous over the whole ordeal. She had even declared that she would “allow” Bijou to have Shiori for the night but also insisted that she was entitled to Shiori herself for their dungeon raid. Gonathan also added saying Nerissa had “permitted” him to have Shiori for the night too, and that Shiori would be okay with having mutilple wives, so technically she'd be okay with everyone going together, and-\n<br>\n\nThe tangled mess of relationships left everyone’s heads spinning. Was Shiori okay with having two wives? Three? Who even knew anymore? In the end, they all unanimously decided to blame Nerissa for the confusion, mostly for the heck of it.",
            "pathType": "smoothstep",
            "day": 2
          },
          "selected": false
        },
        {
          "id": "jyanthan-hot-pink-one-left-2-bottom-2",
          "source": "jyanthan",
          "target": "hot-pink-one",
          "sourceHandle": "left-2",
          "targetHandle": "bottom-2",
          "type": "fixed",
          "style": {
            "stroke": "#5f0066"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "darwin-roosevelt-dicaprio-jr-ceres-fauna-top-1-left-2",
          "source": "darwin-roosevelt-dicaprio-jr",
          "target": "ceres-fauna",
          "sourceHandle": "top-1",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#79b3c8"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "shiori-nyavella-nerissa-ravencroft-bottom-2-top-2",
          "source": "shiori-nyavella",
          "target": "nerissa-ravencroft",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff7ae2"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "tanakisha-shakaria-darwin-roosevelt-dicaprio-jr-top-2-right-2",
          "source": "tanakisha-shakaria",
          "target": "darwin-roosevelt-dicaprio-jr",
          "sourceHandle": "top-2",
          "targetHandle": "right-2",
          "type": "fixed",
          "style": {
            "stroke": "#ffd885"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "hot-pink-one-tam-gandr-top-3-left-3",
          "source": "hot-pink-one",
          "target": "tam-gandr",
          "sourceHandle": "top-3",
          "targetHandle": "left-3",
          "type": "fixed",
          "style": {
            "stroke": "#2b65ee",
            "strokeDasharray": "10, 10"
          },
          "data": {
            "day": 1
          },
          "selected": false
        },
        {
          "id": "elizabeth-rose-bloodflame-ceres-fauna-bottom-2-top-2",
          "source": "elizabeth-rose-bloodflame",
          "target": "ceres-fauna",
          "sourceHandle": "bottom-2",
          "targetHandle": "top-2",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "She's a Witch",
            "content": "Elizabeth was never one to let a perceived wrongdoing go unchecked, so when the newly opened **FaunaMart**, managed by Ceres Fauna, came onto the scene, Elizabeth was immediately wary. \n<br>\n\nFrom the moment Fauna used what Elizabeth could only describe as \"witchcraft\" to advertise FaunaMart directly into her mind on the previous day, distrust took root. The red knight believed Fauna's enticing lottery tickets for so-called \"big jackpots\" were nothing more than a ploy to corrupt her guildmates and strip them of their hard-earned property. \n<br>\n\n\nThe tension between them only escalated during their first one-on-one interaction while completing quests. \n<br>\n\n[Red and Green](#embed:https://www.youtube.com/live/oVguNTPnDww?t=2921)\n<br>\n\nFauna claimed her efforts, including running FaunaMart, were all for the library—a noble endeavor, she said, for the betterment of the people. But Elizabeth remained skeptical. Her doubts deepened when, upon requesting Fauna's help with a dungeon quest, Fauna demanded compensation—1,000 coins, no less.\n<br>\n\nPerhaps there was some truth in Fauna's words, but for now, Elizabeth saw her as a [witch](https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=3589)—a cunning and greedy one—whose true motives seemed firmly rooted in the pursuit of profit. Only time would reveal whether Fauna's actions were as selfless as she claimed.\n",
            "pathType": "smoothstep",
            "day": 2
          },
          "selected": false
        },
        {
          "id": "elizabeth-rose-bloodflame-nerissa-ravencroft-right-3-left-2",
          "source": "elizabeth-rose-bloodflame",
          "target": "nerissa-ravencroft",
          "sourceHandle": "right-3",
          "targetHandle": "left-2",
          "type": "fixed",
          "style": {
            "stroke": "#ff94d8",
            "strokeDasharray": "10, 10"
          },
          "data": {
            "relationshipId": "romantic",
            "title": "Beautiful Maiden",
            "content": "Elizabeth never thought she’d feel anything beyond her unwavering sense of duty—to fulfill her tasks, protect the king, and safeguard those around her. But whenever she crossed paths with Nerissa, a strange sensation stirred within her. It was a feeling she couldn’t quite identify—like butterflies fluttering in her stomach. This day was no exception, though it turned out to be one where they could finally spend some time alone together.\n<br>\n\n[Elizabeth spilling her spaghetti](#embed:https://www.youtube.com/live/oVguNTPnDww?t=820)\n<br>\n\nTheir interaction was brief, but Elizabeth cherished every moment of it. She found herself captivated by Nerissa’s charm and effortless presence, a stark contrast to her own disciplined demeanor.\n<br>\n\nHowever, her lofty expectations of the blue maiden were tempered when Nerissa revealed her motivations for slaying stains and completing the kingdom’s quests. It wasn’t out of duty or goodwill, but simply to earn money—for purchases and, most notably, *gambling*.\n<br>\n\nDespite this revelation, Elizabeth didn’t hold it against her. Not everyone needed to share her rigid sense of morality, after all. What mattered most was the connection they’d shared, however fleeting.\n<br>\n\nTruthfully told, Elizabeth was a [fumbling mess](https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=2740) whenever the blue maiden appeared. And everytime they parted ways, Elizabeth quietly hoped for more moments with Nerissa in the days to come.\n<br>\n\n[Can't stop thinking about her](#embed:https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=2185)\n",
            "pathType": "smoothstep",
            "day": 2
          },
          "selected": false
        },
        {
          "id": "nerissa-ravencroft-koseki-bijou-top-4-left-4",
          "source": "nerissa-ravencroft",
          "target": "koseki-bijou",
          "sourceHandle": "top-4",
          "targetHandle": "left-4",
          "type": "fixed",
          "style": {
            "stroke": "#e30d0d"
          },
          "data": {
            "relationshipId": "enemy",
            "title": "Fake Honkers",
            "content": "Only a day after her marriage, Bijou found herself facing unexpected obstacles in her sweet, sugar-coated life. As she greeted her wife, Shiori, upon waking, Bijou discovered some shocking news: Shiori had somehow acquired another wife. That wife was none other than Nerissa Ravencroft.\n<br>\n\n[She seems quite angy](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=5243)\n<br>\n\nThe moment Bijou heard the name, she knew she had a new rival. Her disdain for Nerissa was fueled not only by jealousy but also by insecurity—Nerissa’s hourglass figure stood in stark contrast to Bijou’s own petite, plywood-like frame.\n\n<br>\nThe blue maiden caused Bijou to become convinced that Shiori no longer cared about their marriage and wanted to be with Nerissa instead. Overcome with heartbreak, she ran off in tears. How the situation was resolved remains unclear—it simply seemed to work itself out (see [Bijou-Shiori: Soap Opera](#edge:shiori-nyavella-koseki-bijou-right-2-left-2))\n<br>\n\nBut the emotional wound lingered for Bijou, and she couldn't forgive Nerissa for the pain she caused. From that day forward, Bijou took every opportunity to jab at her rival, even going so far as to claim that Nerissa’s enviable figure was fake.\n<br>\n\n[The woman with the fake badonkas](#embed:https://www.youtube.com/live/Tl7rUzJyc_0?t=8396)\n\n",
            "pathType": "straight",
            "day": 2
          },
          "selected": false
        },
        {
          "id": "elizabeth-rose-bloodflame-koseki-bijou-bottom-3-top-1",
          "source": "elizabeth-rose-bloodflame",
          "target": "koseki-bijou",
          "sourceHandle": "bottom-3",
          "targetHandle": "top-1",
          "type": "fixed",
          "style": {
            "stroke": "#375aa0"
          },
          "data": {
            "relationshipId": "family",
            "title": "Impromptu Adoption",
            "content": "Elizabeth had already taken on quite a few roles throughout her journey—protector of two pups, the king’s loyal knight, a steadfast guardian to those in need—all in the spirit of bringing happiness to others. But now, she was about to gain yet another title: mother.\n<br>\n\n[Would you adopt me?](#embed:https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=1902)\n<br>\n\nIt all happened so suddenly. She had been casually conversing with Bijou and Cecilia when, out of nowhere, the gem maiden brought up the idea of wanting to become Elizabeth’s adopted daughter. Why? Simply because she wanted to add the Bloodflame surname to her own.\n<br>\n\nElizabeth was understandably baffled, completely taken aback, but Bijou’s sparkling, expectant eyes gave Elizabeth no time to process. The sheer weight of her enthusiasm was overwhelming.\n<br>\n\nBesides, wasn’t making people happy exactly what Elizabeth strived for? It aligned with her ideals. And so, flustered but resolute, she accepted.\n<br>\n\nSurprisingly, Elizabeth fit the role well. She encouraged Bijou when she accomplished something impressive, shielded her from danger, and even stood up for her daughter when her daughter's wife was cheating on her. And in return, Bijou acted the part of a real daughter—by pushing her mother to pursue the person she herself was in love with. The same person who was already married to Bijou's own wife.\n<br>\n\n[Acting like a mother figure](#embed:https://www.youtube.com/live/oVguNTPnDww?feature=shared&t=5752)\n<br>\n\n...Yeah, okay, that part was a bit complicated, but the sentiment was there.\n<br>\n\nEven when Elizabeth felt a tinge of [disapproval](https://www.youtube.com/live/Tl7rUzJyc_0?feature=shared&t=9716) upon learning that her new daughter supported Tam Gandr as Queen, it didn’t change the fact that she cared for her. \n<br>\n\nShe may not have been a real mother, but she was still a real knight—one with a kind and caring heart.",
            "pathType": "custom",
            "day": 2,
            "offsets": {
              "HL": 0,
              "VL": 0,
              "HC": -51.784681576327365,
              "VR": 0,
              "HR": 0
            }
          },
          "selected": false
        }
      ]
    }
  ],
  "teams": {
    "scarlet-wand": {
      "id": "scarlet-wand",
      "name": "Scarlet Wand",
      "teamIconSrc": "https://cdn.holoen.fans/hefw/media/scarletwand.webp"
    },
    "jade-sword": {
      "id": "jade-sword",
      "name": "Jade Sword",
      "teamIconSrc": "https://cdn.holoen.fans/hefw/media/jadesword.webp"
    },
    "cerulean-cup": {
      "id": "cerulean-cup",
      "name": "Cerulean Cup",
      "teamIconSrc": "https://cdn.holoen.fans/hefw/media/ceruleancup.webp"
    },
    "amber-coin": {
      "id": "amber-coin",
      "name": "Amber Coin",
      "teamIconSrc": "https://cdn.holoen.fans/hefw/media/ambercoin.webp"
    },
    "none": {
      "id": "none",
      "name": "None"
    }
  },
  "relationships": {
    "alliance": {
      "id": "alliance",
      "name": "Alliance",
      "style": {
        "stroke": "#ffd885"
      }
    },
    "marriage": {
      "id": "marriage",
      "name": "Marriage",
      "style": {
        "stroke": "#ff7ae2"
      }
    },
    "protector": {
      "id": "protector",
      "name": "Protector",
      "style": {
        "stroke": "#77e03e"
      }
    },
    "big-pink-cat": {
      "id": "big-pink-cat",
      "name": "Big Pink Cat",
      "style": {
        "stroke": "#c65cff"
      }
    },
    "enemy": {
      "id": "enemy",
      "name": "Enemy",
      "style": {
        "stroke": "#e30d0d"
      }
    },
    "related": {
      "id": "related",
      "name": "Related",
      "style": {
        "stroke": "#709b9e"
      }
    },
    "backup-plan": {
      "id": "backup-plan",
      "name": "Backup Plan",
      "style": {
        "stroke": "#5f0066"
      }
    },
    "business": {
      "id": "business",
      "name": "Business",
      "style": {
        "stroke": "#79b3c8"
      }
    },
    "unrequited-love": {
      "id": "unrequited-love",
      "name": "Unrequited Love",
      "style": {
        "stroke": "#2b65ee",
        "strokeDasharray": "10, 10"
      }
    },
    "romantic": {
      "id": "romantic",
      "name": "Romantic",
      "style": {
        "stroke": "#ff94d8",
        "strokeDasharray": "10, 10"
      }
    },
    "family": {
      "id": "family",
      "name": "Family",
      "style": {
        "stroke": "#375aa0"
      }
    }
  }
}